
{"posts":{"1826":{"id":1826,"post_title":"[Exclusive] SECHSKIES and BLACKPINK do not rest during these Thanksgiving holidays voluntarily… Shooting MV for their new songs","url_friendly_name":"exclusive-sechskies-and-blackpink-do-not-rest-during-these-thanksgiving-holidays-voluntarily-shooting-mv-for-their-new-songs","excerpt":"","post_content":"[OSEN=박현민 기자] Group SECHSKIES and BLACKPINK are working hard for their comeback with new songs, even during the upcoming Thanksgiving holidays of Korea.\r\n\r\nAccording to music industry insiders on September 12, SECHSKIES who has recently been working for their comeback will shoot a music video for two days on September 14 and 15, during the Thanksgiving holidays of Korea. To reward fans’ big support given at their first concert in 16 years since the team’s disbandment, SECHSKIES voluntarily decided to work during the holidays, in order to give a bigger momentum for the finishing work on their new songs.\r\n\r\nRookie girl group BLACKPINK is working during the holidays as well. BLACKPINK recently gave the last performance for their debut single album in SBS “INKIGAYO”. The team will shoot the music video of their new song on September 14 and 15, too, in order to come back faster than originally scheduled.\r\n\r\nAs such, SECHSKIES and BLACKPINK shoot music videos on the same days. According to insiders, YG Entertainment’s CEO YANG HYUN SUK spared no support for those two teams, by appointing famous music video directors who have mainly produced BIGBANG’s music videos to direct their new music videos.\r\n\r\nAs the timeline of the new release and comeback of SECHSKIES and BLACKPINK has not been confirmed yet, who will come back first between the two teams will depend on the speed of their final work on new songs and music videos.\r\n\r\nSECHSKIES proved their still-big popularity and opened a new chapter in their music career by holding the first concert in 16 years recently, while BLACKPINK has emerged as a “formidable rookie” by making unprecedented achievements on charts and TV music shows. Music fans are now paying keen attention to the outcome of the two team’s hard work even during the holidays.","post_date":"2016-09-13","related_blog":[854],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201609121136777533_57d6165e5b740_99_20160913075904.jpg","thumb_2x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201609121136777533_57d6165e5b740_99_20160913075904.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201609121136777533_57d6165e5b740_99_20160913075904.jpg"},"1689":{"id":1689,"post_title":"MINO&BOBBY Talk about Dating, “…want to have much experience, but realistically speaking, it’s impossible”","url_friendly_name":"minobobby-talk-about-dating-want-to-have-much-experience-but-realistically-speaking-its-impossible","excerpt":"","post_content":"[헤럴드POP=박수인 기자] MINO and BOBBY talk about dating.\r\nDuring their interview, which took place at the YG Building in Mapo-gu, Seoul at 2 PM on September 12, MOBB talked about dating.\r\nBOBBY said, “I’m not saying dating isn’t important. But, I have a lot of things to do and a lot of things I want to do. The agency doesn’t ban dating explicitly, but I feel that they don’t want us to date.”\r\nMINO said, “I want to have much experience, but realistically speaking, it’s impossible. So, I believe the right thing to do is focus when you need to focus. When you’re distracted, you can’t accomplish anything.”\r\nBOBBY and MINO released songs as solo artists and as a project group. BOBBY released “HOLUP!” on September 7, and the next day, MINO released his solo single “BODY”. Drawing on the momentum created, BOBBY and MINO released “HIT ME” and “FULL HOUSE” as a sub-unit on September 9.","post_date":"2016-09-12","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201609121442573471436_20160912144318_01_99_20160912144803.jpg","thumb_2x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201609121442573471436_20160912144318_01_99_20160912144803.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201609121442573471436_20160912144318_01_99_20160912144803.jpg"},"1694":{"id":1694,"post_title":"MINO Says, “I’m emotional and BOBBY’s energetic. He seemed almost fanatic.”","url_friendly_name":"mino-says-im-emotional-and-bobbys-energetic-he-seemed-almost-fanatic","excerpt":"","post_content":"[OSEN=정준화 기자] MOBB’s MINO talks about BOBBY and how fanatic he was when they were making the album.\r\nAt an interview on September 12, MINO talked about what he’s been up to these days and MOBB’s album.\r\nHe said, “BOBBY worked on his solo single before I did. I thought it was a very powerful hiphop song that represents BOBBY very well. I was rather calm when I was making my solo single. We worked together for a lot of stuff, and BOBBY’s song well reflects his energy, and my song, my emotional side.”\r\nMINO went on to say, “I like my group’s music too, but the kind of music that I want to do personally is a bit different. So, it felt so good to be doing music on my own, and I was very happy. BOBBY seemed almost fanatic. He was genuinely very happy.”","post_date":"2016-09-12","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201609121407779229_57d638421c4d5_99_20160912144704.jpg","thumb_2x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201609121407779229_57d638421c4d5_99_20160912144704.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201609121407779229_57d638421c4d5_99_20160912144704.jpg"},"1696":{"id":1696,"post_title":"BOBBY Says, “When we were trainees, I didn’t like MINO and was jealous of him because he rapped so well.”","url_friendly_name":"bobby-says-when-we-were-trainees-i-didnt-like-mino-and-was-jealous-of-him-because-he-rapped-so-well","excerpt":"","post_content":"[마이데일리=전원 기자] WINNER’s MINO and iKON’s BOBBY revealed their affection for each other.\r\nAn interview took place at September 12 at the YG Building in Mapo-gu, Seoul about MOBB’s debut.\r\nBOBBY talked about their trainee days and said, “I didn’t like MINO and was jealous of him because he rapped so well. But then, we got talking and found out we had a lot in common. MINO became dandier and sexier that before. He knows how to dress like a gentleman.”\r\nMINO said, “I remember dancing free style with the lights out and only relying on the lights from my cellphone. It was my only hobby during my trainee days.”\r\nMeanwhile, BOBBY and MINO recently had their debut stage on SBS’s Inkigayo, and they are about to launch a promotion campaign named “MOBB TOWN”.","post_date":"2016-09-12","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201609121414841136_1_99_20160912142004.jpg","thumb_2x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201609121414841136_1_99_20160912142004.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201609121414841136_1_99_20160912142004.jpg"},"1380":{"id":1380,"post_title":"[Yesterday V] GD, natural-born bigshot… It was his destiny","url_friendly_name":"osen%eb%b0%95%ec%86%8c%ec%98%81-%ea%b8%b0%ec%9e%90-g-dragon-was-born-a-bigshot-what-is-all-the-more-special-is-that-he-is-fully-enjoying-his-good-fortune-even-before-the-time-when-it-was-destined","excerpt":"","post_content":"[OSEN=박소영 기자] G-DRAGON was born a bigshot. What is all the more special is that he is fully enjoying his good fortune even before the time when it was destined. It has been revealed that G-DRAGON was born with an unmatched predestined fame and wealth.\r\n\r\nOn September 7 at 7PM, G-DRAGON hosted NAVER special V-APP live-broadcasting “G-DRAGON ON-AIR”. BIGBANG members have done individual live-broadcasting once every week since the end of last month. DAESUNG was the first one to do the live-broadcasting and G-DRAGON was the second to follow DAESUNG.\r\n\r\nG-DRAGON said he “has lots of concerns these days” and invited a fortune-teller to read his destiny. The fortune-teller said that G-DRAGON was destined to have big fame and wealth. The fortune-teller also said that G-DRAGON’s luck for wealth is especially great from this September to December and he will also meet a new person who will greatly help him during the period.\r\n\r\nThe lines on GD’s palms were exceptionally good as well, to surprise the fortune-teller. The line of longevity is long, being cut nowhere in the middle. Plus, the “M” shape on his palms indicates GD is a man of wealth. The fortune-teller said the lines of GD’s palms are the ones for “the king of wealth” and G-DRAGON could not stop smiling.\r\n\r\nThe fortune-teller extolled G-DRAGON’s fortune, saying, “You will have an extraordinarily good luck until early 50s”. The fortune-teller also recognized G-DRAGON’s natural talent, saying, “Your physiognomy can be compared to half-crane and half-swallow. It says that you’re full of talent and charms”.\r\n\r\n\r\n\r\nThen, the fortune-teller gave a list of lucky items for G-DRAGON. He gave advice to GD, saying, “Number 1, 3, 6, 8 and color black, blue, navy, and green are good for you. Put on clothes with tiger printing on it, or a wooden ring”. \r\n\r\nThe fortune-teller said that the lucky season for GD is spring and winter and G-DRAGON was reminded of his song “BLUE”, because the song has lyrics that go “the winter goes and spring comes”. Plus, the title of the song “BLUE” was something good for him, so G-DRAGON made a big smile.\r\n\r\nThe fortune-teller recommended café and fancy goods business for G-DRAGON. G-DRAGON was surprised by such recommendation and said, “Actually, I run a café in Jeju Island and I will collaborate with a clothing brand soon”. As such, G-DRAGON is doing what is good for him without knowing his destiny in advance. The fortune-teller praised G-DRAGON by saying, “You know what is good for you instinctively, so I don’t think you should care about your fortune”. G-DRAGON made a satisfied smile.\r\n\r\nEven though G-DRAGON was born with the destiny to become extremely famous and wealthy, he is modest about himself. When the fortune-teller said, “You should try acting career, like as a school principal or professor”, GD answered, “I’ve really never thought of acting as my career” and said he would act only in his music videos.\r\n\r\nPlus, when the fortune-teller said that G-DRAGON’s luck for this year is really good, GD said, “BIGBANG album must be released within 2016, then. Not much time is left, so I’ll hurry up and release the album within this year no matter what”.\r\n\r\nG-DRAGON will enjoy a really good luck at the age of 35 and then will accumulate wealth consistently until his early 50s. He is a natural-born super star, but he will go even higher with his own hard-work.","post_date":"2016-09-08","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/GD_2.jpg","thumb_2x1":false,"thumb_3x2":false},"1375":{"id":1375,"post_title":"[People is] Whole new SONG MINHO… Is he going to join the ranks of sexy solo male artists?","url_friendly_name":"people-is-whole-new-song-minho-is-he-going-to-join-the-ranks-of-sexy-solo-male-artists","excerpt":"","post_content":"[일간스포츠=이미현 기자] A new sexy male solo artist has been born.\r\n\r\nGroup WINNER’s SONG MINHO fully revealed his manly sex appeal with his solo debut song “BODY”. SONG MINHO released solo track “BODY” on September 8 at 0AM. He expresses the dreamy and sexy image unveiled in his solo debut teaser image, in the song.\r\nSONG MINHO sings somewhat outspoken and bold lyrics in a straightforward and frank way. He sings the feelings and memories for ex-girlfriend in a sensual atmosphere.\r\nSONG MINHO’s sex appeal reaches its climax, while he expresses a man’s feelings. Notably, the perfect shape of his face, harmony with the actress, and acting of physical affection with the actress highlight SONG MINHO’s sex appeal.\r\nThe lyrics of “BODY” are outspoken. Listeners can never stop listening to the straightforward words that stimulate imagination. The lyrics openly expresses feelings with words such as “I miss your body, your tickling breaths”, “I miss your body, your silky hair”, etc.\r\nThe imagery in the music video is as outspoken as the lyrics. In the video, SONG MINHO hugs a woman in a room, and kisses her in a swimming pool. His perfectly manly face and body shown in a shower scene reveals sex appeal which is somewhat different from the image he has shown so far.\r\nSONG MINHO co-wrote the melody and lyrics of “BODY” with other songwriters. Producer FUTURE BOUNCE took part in writing the song, to further raise its quality.\r\nAfter the release of SONG MINHO’s solo song on September 8, “MOBB”, the unit team of SONG MINHO and BOBBY, is releasing two new songs on September 9.","post_date":"2016-09-08","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/MINO_3.jpg","thumb_2x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/MINO_3.jpg","thumb_3x2":false},"1373":{"id":1373,"post_title":"SONG MINHO & BOBBY’s “MOBB” appears on V-APP… Full-fledged promotion [official]","url_friendly_name":"song-minho-bobbys-mobb-appears-on-v-app-full-fledged-promotion-official","excerpt":"","post_content":"[동아닷컴=홍세영 기자] SONG MINHO &amp; BOBBY’s “MOBB” appears on V-APP… Full-fledged promotion\r\n\r\n“MOBB”, a unit team of WINNER’s SONG MINHO and iKON’s BOBBY, is raising fans’ anticipation, hinting on full-fledged promotion.\r\n\r\nOn September 8, YG Entertainment unveiled a poster about large-scale promotion for “MOBB”, on the company’s official blog (www.yg-life.com). The promotion will be implemented under the title of “MOBB TOWN” and it will have four detailed plans.\r\n\r\nThe first plan is “MOBB TOWN LIVE”, which refers to countdown live-broadcasting on NAVER V-APP. Today, one day before the release of MOBB’s double digital single, the two will appear in V-APP live-broadcasting to further raise anticipation for their new songs and music videos, while also closely communicating with fans.\r\nPlus, a collaboration event titled “MOBB COLLAB” will be carried out with “PBA (PIZZA &amp; BEER ASSOCIATION)” store located on Gyeongridan-gil in Itaewon, Seoul. Then, events including pop-up store “MOBB STORE” in Hannam-dong, Itaewon, and album release party “MOBB NIGHT” will be carried out.\r\nNotably, all those promotion events will be hosted in Itaewon area, where the music video of one of MOBB’s double digital singles was shot. As they are held in Itaewon, the events will be free, easy, and passionate just as Itaewon is. \r\nBefore MOBB’s official duo debut, BOBBY released his solo single “HOLUP!” on September 7 at 0AM and SONG MINHO released his solo track “BODY” on September 8 at 0AM. “HOLUP!” is enjoying big popularity for BOBBY’s flagship rough and tough rapping, while “BODY” is also drawing popularity for its dreamy and sexy feel, different from “HOLUP!”. \r\nNot only hip-hop lovers but also general music fans are paying keen attention to those two songs. They are showing substantial influence on charts, staying in top 10 on iTunes charts of many foreign countries including Vietnam, Thailand, Hong Kong, Singapore, Taiwan, Malaysia, Macao, and Philippines. \r\nFollowing “HOLUP!” and “BODY”, “HIT ME” and “FULL HOUSE” of SONG MINHO and BOBBY’s unit team “MOBB” will be released today (September 8) at 0AM. Now, fans are paying keen attention to the sensation to be created by the two rappers. ","post_date":"2016-09-08","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/MOBB_4.jpg","thumb_2x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/MOBB_4.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/MOBB_4.jpg"},"1252":{"id":1252,"post_title":"[Oh!Ssen Talk] YG Says They Don’t Care about BOBBY&MINO’s Chart Results","url_friendly_name":"ohssen-talk-yg-says-they-dont-care-about-bobbyminos-chart-results","excerpt":"","post_content":"[OSEN=박현민 기자] The news that BOBBY, MINO, and unit group MOBB will release new songs is sending shockwaves across the music scene. However, the rappers don’t seem to care about how their songs will do on the charts. An YG official commented that they are already very satisfied with their songs.\r\n\r\nOn September 6, YG told OSEN, “How will they do on the charts? We don’t expect much as people are really into ballads and not hiphop these days. From the artist’s perspective, good music is music that the audience can really enjoy. It’s been such a long time since we released powerful hiphop songs. We hope that they can bring their explosive energy to the stage.”\r\n\r\nWhat’s more important than what YG thinks is what BOBBY and MINO think. It turns out that they just want to go up on the stage as soon as possible and don’t really care about the chart results. The YG official explained, “They are already satisfied with the quality of the songs and the music videos. BOBBY said he can’t wait to go on the stage. They will appear on this week’s Inkigayo and then perform the songs on stage during the Japan arena tour.”\r\n\r\nThe triple blow of BOBBY, MINO, and BOBBY&amp;MINO’s MOBB will begin on September 7. BOBBY’s first solo single “HOLUP!” will be released at 12 AM on September 7 and MINO’s “BODY” exactly 24 hours later. Then, at 12 AM on September 9, MOBB’s “HIT ME” and “FULL HOUSE” will be revealed. Also, a total of four music videos will be released. Fans are about to receive a series of presents from YG, and it almost feels like Christmas has arrived early this year.\r\n\r\nThis is a big project even for YG. No label has released four songs and four music videos in just three days. It is also the first time that members from different YG groups joined hands to form a unit group.\r\n\r\nThey are releasing the songs that they have worked so hard for almost at the same time, but they are still not worried about the chart results. Maybe this is possible because they are BOBBY and MINO, and of course, because they are YG.","post_date":"2016-09-06","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/YG.jpg","thumb_2x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/YG.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/YG.jpg"},"969":{"id":969,"post_title":"[Exclusive] YG is pouring all its capabilities in the second half of this year”… The timetable of YG artists’ comebacks and new releases","url_friendly_name":"exclusive-yg-is-pouring-all-its-capabilities-in-the-second-half-of-this-year-the-timetable-of-yg-artists-comebacks-and-new-releases","excerpt":"","post_content":"\r\n\r\n[OSEN=최나영 선미경 김보라 기자] YG Entertainment (“YG”) will take the second half of this year by the storm. A variety of musicians cherished and polished by YG will release their all-time best albums in the second half, doing their best.\r\nAn YG insider said on August 30 to OSEN, “YG’s CEO YANG HYUN SUK is taking initiative for YG’s unprecedented success for the second half of this year, saying we should pour all our power and capabilities in the second half of this year, to carry out as many projects of YG artists as possible, for the sake of fans”. Before such plan was announced, YG led the debut of BLACKPINK, YG’s first new girl group in seven years, to a great success and announced solo album release by iKON’s member BOBBY, to draw keen attention. As BOBBY is one of the leading rappers of YG, his album is expected to contain genuine hip-hop. \r\n\r\nAfter BLACKPINK and BOBBY, WINNER’s SONG MINHO who is famous for his flagship hip-hop soul, will also come back as a solo artist. Then, in fall, new albums of WINNER and iKON, the brother boy groups, are expected to be released. Then, “MADE” album of BIGBANG, YG’s leading artist, will be finally completed. \r\nFurthermore, AKMU will release an album in this fall as suggested from early this year, and then PSY, EPIK HIGH, and LEE HI will also release their new songs within this year. With YG’s jewel box widely opening as such, global music fans will be able to enjoy a variety of YG music during the second half of this year. \r\n\r\nPlus, Zion.T who has recently joined YG producer TEDDY’s new black label, as well as Hyuk Oh of EPIK HIGH’s label are likely to release new albums in the second half. As Zion.T and Hyuk Oh always sweep top places on charts, their new release is something that music fans always await for. \r\nIf new songs and albums of such bigshot YG artists are released one after another from this September until the end of this year, the music scene for the second half of 2016 will be dominated by YG. Naturally, music fans believe that a big sensation will be created by YG during that time. \r\n\r\nYG artists are famous for their long-time work on new songs. That is why fans of YG artists sometimes say that you never know when they will actually release an album until the album is really put on the market. However, that is also the proof of how much YG artists work hard for their music to be presented to the public. \r\nTherefore, YG artists always present music with higher-than-expected quality. If only more than half of those YG artists release new songs in the second half, the music scene will be just hit hard by YG. \r\n\r\n# Sechs Kies’ first concert in 16 years\r\nSechs Kies will hold a concert on September 10 and 11 at Olympic Gymnastics Arena in Seoul. That is Sechs Kies’ first concert in 16 years since the team’s breakup in 2000. Sechs Kies had originally been supposed to hold a concert in June, but after signing contract with YG, the team decided to postpone the concert, to have more time to raise the quality of the concert. In the concert whose tickets had been all sold out right after the ticket opening, Sechs Kies is highly likely to unveil their new songs. \r\nSechs Kies members are going to YG’s recording studio every day these days. Despite their busy schedules of preparation for the concert and appearance in TV shows, Sechs Kies has been recording more than 20 songs to be performed at the concert from scratch. As Sechs Kies has not performed for more than 16 years, there were only one or two available accompanying music. No one had the accompanying music for Sechs Kies’ songs and YG does not use music for TV shows at concerts, in order to present perfect sound for concerts. So, Sechs Kies members had to sing and record those songs all over again. It demonstrates how much YG is caring for the quality of Sechs Kies’ concert.\r\n\r\n# Solo BOBBY &amp; iKON \r\niKON’s member and rapper BOBBY unveiled the first teaser image for his solo comeback on August 29. The teaser image showed “COMING SOON” in large font, suggesting that BOBBY’s solo album will be released soon. BOBBY is the main rapper of iKON who debuted one year ago, as well as the winner of Mnet’s “Show Me the Money 3” show in 2014. BOBBY’s rap style with his flagship rough and tough voice always presents energetic performances. \r\nBOBBY is 20-years-old. He is a member of boy group iKON that holds Japan arena tour within only one year of their debut and now, he also releases his own solo album, rapidly evolving into an artist. He was 19-years-old when he won “Show Me the Money 3”. BOBBY’s solo album and performances to be unveiled two years after that are likely to be focusing on genuine hip-hop that best-displays BOBBY’s identity and appeals. Meanwhile, group iKON is also working on their new songs. \r\n\r\n# BLACKPINK, again\r\nIs BLACKPINK, the hottest girl group of these days, going to hit the music scene hard once again? YG artists usually present more than two songs for their debut. BLACKPINK made debut only three weeks ago, but they are setting unprecedented records on charts, unlike usual rookie girl groups. BLACKPINK has been sweeping the charts of music-streaming websites for 15 days in a row, took No.1 in a TV music show within the shortest-ever period of time for a girl group, and their music videos have surpassed 20 million views. Just a “whistle” of these girls is creating sensation in the music scene. \r\nBLACKPINK has completed the formula that an YG rookie equals a monstrous rookie. Following the great success of WINNER who debuted in 2014 and iKON who debuted last year, BLACKPINK is also creating big sensation in the music scene. All those three idol groups took music charts by the storm upon their debut. These days, it is even hard for an idol group to make their debut song enter the chart. Therefore, BLACKPINK’s success on charts is all the more remarkable. \r\n\r\n# Hyuk Oh and CL \r\nHyuk Oh drew big attention by presenting a sensational performance at SUMMER SONIC 2016, one of the leading music festivals in Japan. Hyuk Oh is holding a concert in Japan and then coming back to Korea to concentrate on their new album. Hyuk Oh was acclaimed by the audience for their performance at 2016 SUMMER SONIC FESTIVAL on August 20 and 21. Now, music fans are expressing bigger anticipation for Hyuk Oh’s comeback with new songs. \r\nPlus, CL (Lee Chae-lin)’s solo debut single is drawing big attention not only in Korea but also around the world. After establishing a base camp in the United States early last year and announcing her full-fledged debut in the country, CL has been collaborating with world-famous artists and the collaboration projects have been spotlighted by globally influential media outlets. That is why many people show rising anticipation and interest in CL’s first step in America’s music scene. \r\n\r\n# Solo SONG MINHO &amp; WINNER\r\nAlong with BOBBY to release a solo album soon, WINNER’s member SONG MINHO is also to make a solo comeback soon. As the two have boasted great talent as the rappers of WINNER and iKON, as well as in “Show Me the Money” competition, fans have high expectations for their solo music. SONG MINHO has also contributed his solo song in WINNER’s album. Just like iKON and BOBBY, WINNER is also working on their new songs, in line with SONG MINHO’s solo comeback. \r\nNotably, since the time of SONG MINHO’s comeback and BOBBY’s solo comeback overlap, the competition between the two will draw much attention. The relationship between WINNER and iKON is so special, as they competed against each other in survival audition shows for debut. The two are even called “brother idol groups”. Coinciding solo comebacks of the main rappers of two idol boy groups that target fan base of similar age group is a very exceptional and unusual case in Korea’s music scene. The constructive competition between the two is expected to create a big synergy.  \r\n2016. 8. 30.","post_date":"2016-08-31","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/201608300832773248_57c4d2f4c69b1_99_20160830092804.jpg","thumb_2x1":false,"thumb_3x2":false},"967":{"id":967,"post_title":"iKON’s BOBBY reveals his upper body to boast manly appeal… In second teaser for his solo comeback","url_friendly_name":"ikons-bobby-reveals-his-upper-body-to-boast-manly-appeal-in-second-teaser-for-his-solo-comeback","excerpt":"","post_content":"\r\n\r\n\r\n\r\n[OSEN=선미경 기자] Boy group iKON’s BOBBY who will soon release a solo album unveiled the second teaser image.\r\n\r\nYG Entertainment unveiled the second teaser image for BOBBY’s solo comeback on the company’s official blog YG LIFE, on August 30 at 10AM, to draw keen attention.\r\n\r\nIn the two photos in the teaser image, BOBBY is revealing his firm upper body with six-pack abs, with his calm eyes looking into the camera. The black-and-white images highlight BOBBY’s charisma.\r\n\r\nBOBBY’s solo debut is all the more meaningful, as it coincides with iKON’s 1st anniversary that falls on September 1. iKON who made debut one year ago is to hold Japan arena tour from next week. One more concert has recently been added to the tour, to prove the team’s big popularity in the country.\r\n\r\nPlus, iKON recently performed with BIGBANG at A-NATION, one of the biggest music festivals in Japan, to be acclaimed by the audience.\r\n\r\nBOBBY is the winner of cable channel Mnet’s rapper survival audition show “Show Me the Money 3″ aired in 2014. For the past year, he has performed both as a member of iKON and as a rapper. As BOBBY is the first iKON member to officially release a solo album, fans have bigger anticipation for him.\r\n\r\nFans are expressing special anticipation for BOBBY’s tough and intense rap as well as his flagship energetic and powerful performances, as shown in “Show Me the Money 3″.\r\n\r\n2016. 8. 30.","post_date":"2016-08-31","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/201608301001771900_57c4db0e60f71_99_20160830102003.jpg","thumb_2x1":false,"thumb_3x2":false},"952":{"id":952,"post_title":"BLACKPINK’s Other Title Song is a Sexy Hypnotizing Song Titled “WHISTLE”","url_friendly_name":"blackpinks-other-title-song-is-a-sexy-hypnotizing-song-titled-whistle","excerpt":"","post_content":"\r\n\r\n[OSEN=박소영 기자] BLACKPINK’s second debut single is titled “WHISTLE”.\r\n\r\nOn August 6, YG Entertainment posted a teaser image of BLACKPINK’s second debut single, “WHISTLE”, on its official blog (www.yg-life.com). A day before, YG had revealed the teaser poster of BLACKPINK’s first debut single “BOOMBAYAH”, attracting much attention from the public.\r\n\r\nIn the teaser poster of “BOOMBAYAH”, members looked fierce retaining the signature look of YG’s female artists. The members look sexy and charismatic in the teaser poster for “WHISTLE”. Posing under a chandelier, BLACKPINK members show their unique charm and force.\r\n\r\nAn YG official commented, “’WHISTLE’ is a song about the fluttering emotion between lovers, and the word ‘whistle’ is a metaphorical expression of such emotion. It is a minimalistic hip-hop song that is sexy and hypnotizing.”\r\n\r\n\r\n\r\nThe song is made by YG’s main producer TEDDY and FUTURE BOUNCE and written by TEDDY. YG announced earlier on that “BOOMBAYAH” is a fast-tempo song with a strong beat, and now that the title of BLACKPINK’s second debut song has been revealed, fans are anticipating their debut more than ever. \r\n\r\nYG collaborated with VM Project to make the music video for “WHISTLE”, and it is said that YG was so satisfied with the results that YG proposed doing BOBBY and SONG MINHO’s project together.\r\n\r\nBLACKPINK’s long-awaited debut is drawing near and expectations are running high. The teaser posters of each member and all of them together have served to raise the expectations in the run up to their debut on August 8.\r\n\r\nThe average age of BLACKPINK members is 19, and all the members have gone through rigorous training at YG from at least four to as much as six years. Their talent and beauty have been demonstrated in the teaser posters and BLACKPINK’s dance practice video, which surpassed five million views. BLACKPINK members are also fluent in Korean, English, Japanese, and Thai, which will enable them to go beyond Korea and succeed in the global market.\r\n\r\nYG had announced that it plans to release the tracks of BLACKPINK’s debut album one by one and not at the same time and make music videos for all of them as it has taken more than two years to make the album. This shows YG’s confidence in the album, and soon we will be able to find out whether or not they had a good reason to feel confident when “BOOMBAYAH” and “WHISTLE” get released.\r\n\r\n2016. 8. 6.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/201608061612776214_57a58e75087d5_99_20160806161603.jpg","thumb_2x1":false,"thumb_3x2":false},"951":{"id":951,"post_title":"BLACKPINK Releases Sexy & Fierce Countdown Poster with Only One Day to Go Until its Debut","url_friendly_name":"blackpink-releases-sexy-fierce-countdown-poster-with-only-one-day-to-go-until-its-debut","excerpt":"","post_content":"\r\n[스포츠조선=조윤선 기자] In just a day, YG Entertainment will be launching its first new girl group in seven years, BLACKPINK.\r\n\r\nIn the morning of August 7, YG posted a poster showing the countdown to BLACKPINK’s debut on its official blog (www.yg-life.com ). In the poster, BLACKPINK members are looking straight at the camera in sexy but confident poses. Their serious and intense gazes are impressive.\r\n\r\nOn August 5 and 6, teaser images of BLACKPINK’s debut singles—“BOOMBAYAH” and “WHISTLE”—were revealed, drawing much attention from the public. Fans have been anticipating BLACKPINK’s debut, and when the titles of their debut singles were announced, it just added fuel to the already high expectations.\r\n\r\n“BOOMBAYAH” is a fast-tempo song with a beat exciting enough to blow away the heat. “WHISTLE” is a sexy, minimalistic hip-hop song about the fluttering emotions between lovers.\r\n\r\nThe two songs that BLACKPINK will be debuting with are very different, so the music videos are different too. So, it will be a chance to find out the different charms of BLACKPINK.\r\n\r\nThe average age of BLACKPINK is 19, and the members have gone through rigorous training at YG from four to six years. They have the looks, diverse appeals, and the ability to communicate in foreign languages to succeed in the global market.\r\n\r\nMeanwhile, “BOOMBAYAH” and “WHISTLE” and their music videos will be released at 8 PM on August 8. Earlier on in the day at 3 PM, a showcase will be held, and BLACKPINK will stand before the public for the first time. The showcase will be broadcasted live on Naver V App.\r\n\r\n2016. 8. 7.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/201608071948775543_57a71258ec647_99_20160807195304.jpg","thumb_2x1":false,"thumb_3x2":false},"947":{"id":947,"post_title":"[BLACKPINK’s debut ②] Can’t help falling in love with BLACKPINK… Spoiler for the monstrous rookie","url_friendly_name":"blackpinks-debut-%e2%91%a1-cant-help-falling-in-love-with-blackpink-spoiler-for-the-monstrous-rookie","excerpt":"","post_content":"\r\n\r\n[일간스포츠=이미현 기자]  BLACKPINK, YG’s first new girl group in seven years, is making debut on August at 8PM.\r\n\r\nBLACKPINK will make an official debut in the music scene, releasing “BOOMBAYAH” and “WHISTLE”, the double title tracks of their debut album, on August 8 at 8PM.\r\n\r\nBefore their official debut, BLACKPINK’s members were unveiled one by one. Every time the members were unveiled, they created sensation on-line, taking No.1 on the real-time search word ranking of search engines. Plus, the team’s dance practice video surpassed 6.14 million views within a month of release.\r\n\r\nBLACKPINK’s outstanding beauty and talent in dancing have already been fully recognized. Now, BLACKPINK is to present their own style of music and prove their talent in singing.\r\n\r\nYG’s main producer TEDDY has worked on BLACKPINK’s debut album for two years. “BOOMBAYAH”, one of the double title tracks of the album, is a song of a quick and intense rhythm, which will cool down this summer’s heat wave. “WHISTLE” is a song about whispers of love and it is a minimal hip-hop song of a dreamlike and sexy feel.\r\n\r\nThen, what would be the biggest charms that will make you fall in love with BLACKPINK, the most promising rookie idol group for the second half of 2016? Here are the profiles of the four members of BLACKPINK for all the people who will soon become the girls’ fans.\r\n\r\n ▶ “Soul vocal” JENNIE\r\n\r\nBorn in 1996, 20-years-old\r\n\r\nTrained for six years\r\n\r\nFrom Korea\r\n\r\nJENNIE is the first member of BLACKPINK unveiled by YG. She is the most well-known one among the members of the team. When YG hinted on the debut of a new girl group, JENNIE was thought to be the most powerful candidate for the group. JENNIE studied in New Zealand and she is known to be fluent in Korean, Japanese, and English.\r\n\r\nJENNIE gained recognition by taking part in G-DRAGON’s solo album twice. She left a big impression by acting as G-DRAGON’s girlfriend in the music video of “That XX” released in 2012. She also featured for “BLACK”, the title track of G-DRAGON’s second full-length album released in 2013 and performed for the song along with G-DRAGON on his comeback stage. By presenting soulful vocal and stable performance on the stage, she proved her potential.\r\n\r\n\r\n▶ “Dance machine” LISA\r\n\r\nBorn in 1997, 19-years-old\r\n\r\nTrained for 5 years\r\n\r\nFrom Thailand\r\n\r\nLISA was the second to be unveiled as a member of BLACKPINK. She is from Thailand and her beautiful legs, well-proportioned body, and exotic visual are drawing keen interest from music fans. Notably, as she is an outstanding dancer recognized by YG’s head YANG HYUN SUK, she is drawing all the more attention. She already boasted her remarkably dynamic and fancy dance in “WHO’S THAT GIRL?” video released in 2012 when she was a trainee of YG.\r\n\r\nPlus, LISA is fluent in not only Thai but also Korean, English, and Japanese. LISA acted in the music video of TAEYANG’s “RINGA LINGA” in 2013. She also worked as the model for YG’s global young-street casual fashion brand “NONAGON” along with iKON’s B.I and BOBBY.\r\n\r\n\r\n\r\n\r\n▶ JISOO, “the next Tang Wei”\r\n\r\nBorn in 1995, 21-years-old\r\n\r\nTrained for 4 years\r\n\r\nFrom Korea\r\n\r\nJISOO is considered the next-generation blue chip for advertisements. Fans call her “the next Tang Wei”. She is also known as a versatile entertainer who is talented in dancing, singing, and acting.\r\n\r\nJISOO boasted her innocent and cute visual in the music videos of “SPOILER” of EPIK HIGH’s 8th full album and HI X SUHYUN’s single “I’m Different” released in 2014. JISOO acted a beautiful woman in love and shed tears, sensing breakup, in those music videos. In May, 2015, she gained recognition by appearing in KBS 2TV’s drama series “Producers” as a cameo actor. Also, she has worked as the model for many ads.\r\n\r\n\r\n\r\n▶ “New face” ROSÉ\r\n\r\nBorn in 1997, 19-years-old\r\n\r\nTrained for 4 years\r\n\r\nFrom Australia\r\n\r\nUnlike the other members of BLACKPINK, ROSÉ is a new face who has never been officially unveiled to the media. Her Korean name is Park Chae-young. ROSÉ is drawing big attention, boasting her well-proportioned figure and charismatic eyes.\r\n\r\nROSÉ was born in Australia and topped YG’s audition held in the country. Then, she began training in Korea in 2012. For the four years of training, she worked really hard to build skills and talent as an artist. She featured for “Without You” of G-DRAGON’s mini-album “One of a Kind”. She is also known to be good at playing guitar.\r\n\r\n2016. 8. 8.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/2016081007005110939_1_99_20160810070903.jpg","thumb_2x1":false,"thumb_3x2":false},"946":{"id":946,"post_title":"YANG HYUN SUK Talks about the Difference between BLACKPINK and 2NE1","url_friendly_name":"yang-hyun-suk-talks-about-the-difference-between-blackpink-and-2ne1","excerpt":"","post_content":"\r\n\r\n[OSEN=선미경 기자] “I want to put them on the stage quickly!”\r\n\r\nThe showcase of BLACKPINK’s debut single album “SQUARE ONE” was held at a studio in Sinsa-dong on August 8. The music videos of BLACKPINK’s debut singles—“BOOMBAYA” and “WHISTLE”—were released for the first time, and YANG HYUN SUK came to the showcase to talk about the meaning of YG’s new girl group.\r\n\r\nHe started off by saying, “I don’t have much chance to meet reporters except for when I do ‘K Pop Star’. It never really got me nervous, but I was nervous before I got up on the stage today. For BLACKPINK members, today is like a birthday. I thought they might be very nervous, so I came to sit by them and show them my support.”\r\n\r\nHe went on to say, “I think it was four years ago when I first said I would release a new girl group. The biggest complaint we receive from fans is that YG artists release so few new songs or new albums. “\r\n\r\n“I really try to find ways to make the fans happy. I understand that fans want to see the singers that they like as much as they can, and that’s why we work hard every day. YG’s system is that singers and the staff have to be satisfied with the music that was made before releasing it to the public. Compared with 20 years ago, YG has become larger and has more producers. But we never got great results when we put a time limit on creating contents.”\r\n\r\nYANG HYUN SUK also said, “In the end, if YG releases music that the singers and the staff are satisfied with, fans are satisfied with it too. I want our music to be perfect, even if fans resent me for so much time. In that sense, I would like to apologize for taking so much time to debut BLACKPINK. Now that they will debut today, I’ll make sure the fans will get to see them a lot.”\r\n\r\nJISOO said, “Our debut got delayed, but we were happy to wait because we thought it would be best to debut after we’re ready.”\r\n\r\n\r\n\r\nThe most number of questions that YANG HYUN SUK and members received were about BLACKPINK and 2NE1. YANG HYUN SUK said, “I didn’t really try to create something different. This was also the case when I made 2NE1. YG has its unique style. I think that the way to make the best girl group is to make one that is most YG-style. I didn’t really try to create another 2NE1 either. Just as the same jacket look different on another person, BLACKPINK members have different faces and voices from those of 2NE1 members. So, I thought to myself ‘Why not make the most YG-style girl group’. I tried to come up with the best.” \r\n\r\nJISOO said, “We’ve been compared to 2NE1 a lot because we’re on the same label. But, they are seniors to us, and we want to be like them. We shouldn’t be compared, BLACKPINK just need to follow in the footsteps of 2NE1.” JENNIE commented, “We’ve been living together for several years, and we’re together 24\/7. We really know each other well, and we’ve been practicing dancing and singing together for a long time. We’ve got a lot to show.”\r\n\r\nYANG HYUN SUK had a lot of affection for BLACKPINK. He said, “I want to put them on the stage quickly. If they go on the stage, there won’t be any need for further explanations. I’m notorious for not giving praises. I never praised BLACKPINK, so I’m quite nervous about whether they will be able to do well on the stage. But, I saw them practice and I’m sure that they will do well. As time goes by, in just a month or a year or so, the public will be able to see that BLACKPINK is different from 2NE1.”\r\n\r\nDuring the showcase, the music videos of “BOOMBAYA” and “WHISTLE” were released to the public for the first time. The “WHISTLE” music video was played first, and it is a song that is hypnotizing and dreamy-like. The 808 beat really stands out in the song as well as the rather unusual combination of rap and vocal. It shows the different appeals of each of the four members, and the music video is sensual yet sophisticated.\r\n\r\nThe music video of “BOOMBAYA” was played afterwards. It is a song with a unique and catchy rhythm. The drum beat is strong, and it has a bit more public appeal than “WHISTLE”. Members look charismatic and confident in the music video.\r\n\r\nBLACKPINK became an issue not only because they’re on YG but also because of their pretty looks. The group is a rookie that has both the looks and the talent. About this, YANG HYUN SUK commented, “YG has always tried to reverse the trend. But, with BLACKPINK, I wanted to reverse YG’s trend. I wanted to go in a direction that we’ve never tried before. Looks are in fact quite important.”\r\n\r\nHe went on to say, “I’ve always thought of talent as the no.1 priority and looks are just something extra. But because we’ve done this for the past 20 years, I started to think that I wanted to make a girl group that is talented and pretty a few years ago. In the case of BLACKPINK, they are not just pretty. Of course, it’s hard to find a whole package. There are few who can sing, dance and are gorgeous at the same time. I had this in mind from the get go, and so it took time.  It was different when I made 2NE1 or BIG MAMA. I just wanted to do something that I haven’t done before. But, I don’t want their music too be cute and pretty as well. I want them to be a team that does YG-style music but pretty.”\r\n\r\n\r\n\r\nWhen asked why BLACKPINK is a four-member group just like 2NE1, YANG HYUN SUK answered,”Among the candidates, these four were the most closest. I think this is the most important thing. The members have to get along. These four have been doing the monthly assessment together for a long time. Watching them, I thought they would make a good team together. There were other candidates, but I didn’t want to go out of my way to make a five-member or a six-member group.”\r\n\r\nAbout the direction of BLACKPINK’s promotions, YANG HYUN SUK said, “Their album has already been completed. We’ve been preparing for their album for more than two years, and we’ve finished making eight tracks. We already have a music video all set and done for another song. But the public needs time to get to know BLACKPINK. To be honest, I haven’t decided yet on whether to release their album or just release two singles next. I just want to put them on the stage quickly.”\r\n\r\nJISOO said, “People have been saying that we’re YG’s first new girl group in seven years, and it has been a burden on us. But we practiced really hard and will try to put on a perfect stage. We’ll practice doing lives and dancing so that we don’t ruin YG’s reputation.”\r\n\r\n\r\n\r\nLastly, YANG HYUN SUK said, “Because we don’t make many girl groups, it is a great burden. 2NE1 is on a short break right now, and BLACKPINK debut timing makes them a representative of YG artists. And I think they are very aware of that. I really do hope BLACKPINK will do well. I’ll do everything in my power to help them. I feel like I’m sending off my kids to school on their first day of elementary school. I’m sure they’ll adjust quickly and do better as time goes by. I hope you have faith in them too and send them your support.” \r\n\r\nBLACKPINK is not a group that is hard to differentiate from 2NE1 as their music and their style is what suits them the most. YANG HYUN SUK repeated several times that he want to put them on the stage quickly, and if they are all what he say they are, it will be exciting to see the youngest YG group BLACKPINK grow.\r\n\r\n2016. 8. 8.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/htm_2016081581047602342_99_20160815081203.jpg","thumb_2x1":false,"thumb_3x2":false},"945":{"id":945,"post_title":"[At the Scene] YG’s Signature Girl Group is About to be Born","url_friendly_name":"at-the-scene-ygs-signature-girl-group-is-about-to-be-born","excerpt":"","post_content":"\r\n\r\n[일간스포츠=황미현 기자] YG’s jewel box has been opened. It took a long time for YG to form a group whose members have the looks and the talent to make it to the top, but the group is now ready to take its first step.\r\n\r\nAt 3 PM on August 8, BLACKPINK’s debut showcase was held at a studio in Sinsa-dong. The members, who have trained at YG for four to six years, said, “We’re so nervous. We’ve waited for this for a long time, and we will do our best. Please send us your support.”\r\n\r\nIt was the first time that JISOO, JENNIE, LISA, and ROSÉ stood before the public, and they answered the questions with trembling voices but with smiles. When they were asked about 2NE1, they seemed to be put in a difficult position, but they were confident enough to say, “We admire them. But, we have set the color of our team first.”\r\n\r\nFour years have passed since YG announced that they will launch a new girl group. It took quite a long time for BLACKPINK to debut, and members commented, “We were not worried. We were happy to wait because the most important thing is to be well prepared for the debut.”\r\n\r\n\r\nYANG HYUN SUK stood beside BLACKPINK members at the showcase and said, “I said I debut them years ago. I think it was four years ago. The biggest complaint we receive from fans is that YG artists release so few new songs or new albums. Compared with before, YG has grown greatly. Creating contents is not something that you can put a time limit on. I want to make the fans happy, but it’s more important that YG releases contents that are at a satisfactory level. Making great music is of utmost priority for me even if people resent me for it.”\r\n\r\nBLACKPINK members have the talent and the looks. This is unusual for YG, a label that used to focus on talent over looks. Regarding this, YANG HYUN SUK commented, “I wanted to try a different direction with BLACKPINK. Of course, looks are important, especially because they are stars and entertainers. I do think that being pretty is a good thing. But, this was never a priority for me as seen in the cases of BIG MAMA and 2NE1. This also goes for BIGBANG too. In the beginning, BIGBANG was criticized for their looks.”\r\n\r\n\r\nHe went on to say, “We’ve been working under the same system for 20 years, and I thought that this time I want to make a group with the looks as well as the talent. It took such a long time because I wanted all the members to be pretty and talented.”\r\n\r\nBLACKPINK’s new singles—“BOOMBAYA” and “WHISTLE”—will be released at 8 PM on August 8. The group consists of JISOO, JENNIE, LISA, and ROSÉ, going against the trend of large groups. It shows that BLACKPINK members are the selected few who have enough charisma to jump into the game.\r\n\r\nBLACKPINK has lot of cards under the sleeve. First, all the members have gone through rigorous training at YG for as short as four years to as long as six years. Since BLACKPINK is YG’s first new girl group after 2NE1, it has been receiving full support from the label. YG’s main producer TEDDY was put in charge of producing BLACKPINK’s debut album, and the title song has been written and made by TEDDY.\r\n\r\nIn addition, four renowned choreographers from outside of Korea made the choreography for BLACKPINK. This was YANG HYUN SUK’s idea. Earlier on, BLACKPINK’s dance practice video was released, and it posted more than six million views in just a month after its release. This demonstrates the phenomenal amount of attention a group that hasn’t even debut yet has been getting.\r\n\r\n“BOOMBAYA” is a fast-tempo song with a beat exciting enough to chase the heat away, and “WHISTLE” is a sexy, hypnotizing hip-hop song with a simple beat about whispers of love.\r\n\r\n2016. 8. 8.\r\n\r\n\r\n","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/20160808173724563468_99_20160808180405.jpg","thumb_2x1":false,"thumb_3x2":false},"944":{"id":944,"post_title":"YANG HYUN SUK Says, “BLACKPINK doesn’t have a leader, the first among YG artists.”","url_friendly_name":"yang-hyun-suk-says-blackpink-doesnt-have-a-leader-the-first-among-yg-artists","excerpt":"","post_content":"\r\n[엑스포츠뉴스=전아람 기자] YG’s leader YANG HYUN SUK announced that BLACKPINK does not have a leader.\r\n\r\nOn August 8, the showcase of BLACKPINK’s debut single album “SQUARE ONE” was held at a studio in Sinsa-dong. BLACKPINK is YG Entertainment’s first new girl group in seven years.\r\n\r\nWhen asked why he has put so much effort into BLACKPINK, YANG HYUN SUK answered, “I have one daughter and one son. It’s not that I don’t care about WINNER or iKON. I did put a lot of effort into them too behind the stage when they were doing the survival shows. BIGBANG and 2NE1 both did pre-debut shows to make them known to the public, but BLACKPINK didn’t do one. So, I’m a bit anxious.”\r\n\r\nHe went on to say, “It is as five times as hard to make a girl group than a boy group. There are lots of things to take care of and to reinforce. I’ve been watching BLACKPINK members train for six years, and I believe they are up to the task.”\r\n\r\n“BLACKPINK doesn’t have a leader. They are the first YG team without a leader. I didn’t want them to have a leader because I want all of them to be like friends, work things out among themselves so that they can come up with better results” added YANG HYUN SUK.\r\n\r\n2016. 8. 8.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/201608081539111138_1_99_20160808154004.jpg","thumb_2x1":false,"thumb_3x2":false},"939":{"id":939,"post_title":"YANG HYUN SUK Says “The reason why YG releases so few new songs is because I’m a perfectionist.”","url_friendly_name":"yang-hyun-suk-says-the-reason-why-yg-releases-so-few-new-songs-is-because-im-a-perfectionist","excerpt":"","post_content":"\r\n[마이데일리=전원 기자] YANG HYUN SUK talked about the reason why BLACKPINK’s debut was so delayed.\r\n\r\nOn August 8, at a studio in Sinsa-dong, Seoul, the showcase of BLACKPINK’s debut single album “SQUARE ONE” was held.\r\n\r\nYANG HYUN SUK started off by saying, “I think it was like four years ago when I said I would debut them.”\r\n\r\nHe went on to say, “The biggest complaint we receive from fans is that YG artists release so few new songs. We’re working hard to satisfy the fans but YG artists themselves have to be satisfied with the music that they release first. The staff and I have to like the music too. We have worked under such system for 20 years.”\r\n\r\n“Compared with 20 years ago, YG has become 100 times bigger. Creating contents is not something that you can put a time limit on. I will always try to make perfect music even if people resent me for it.”\r\n\r\nMeanwhile, BLACKPINK is a four-member girl group consisting of JISOO, JENNIE, ROSÉ, and LISA. The average age of the members is 19, and they have all gone through rigorous training at YG from four to six years. BLACKPINK’s debut singles—“BOOMBAYA” and “WHISTLE”—and the music videos will be released at 8 PM on August 8.\r\n\r\n2016. 8. 8.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/201608081539111138_1_99_20160808154004.jpg","thumb_2x1":false,"thumb_3x2":false},"937":{"id":937,"post_title":"YG’s Ambitious Work After 2NE1 is Revealed","url_friendly_name":"ygs-ambitious-work-after-2ne1-is-revealed","excerpt":"","post_content":"\r\n[CBS노컷뉴스=김현식 기자]  Finally, BLACKPINK has been revealed. It is a group that YG Entertainment, one of the three biggest entertainment companies in Korea, launched for the first time in seven years after 2NE1. The group’s debut showcase was held at 3 PM on August 8 at a studio in Sinsa-dong, Seoul.\r\n\r\nThe music videos of “WHISTLE” and “BOOMBAYA”, the tracks of BLACKPINK’s debut single album ”SQUARE ONE”, were released for the first time at the showcase. YANG HYUN SUK attended to show his support for the group as they embark on their great journey.\r\n\r\n◇ Tell us about BLACKPINK.\r\n\r\n\r\n\r\nJENNIE, JISOO, LISA, ROSÉ, who all have been YG trainees from four to six years, are members of BLACKPINK. The name means that the group has talent and the looks. \r\n\r\nJISOO’s face is already known to the public as she featured on the music videos of EPIK HIGH and HI&amp;SOO HYUN. Thanks to her beauty, she appeared on a number of ads and shows great talent in dancing, singing and acting. JENNIE featured on G-DRAGON’s “BLACK”, the title track of his second solo album, and showed off her powerful and soulful voice. She studied in New Zealand when she was younger, and she is fluent in English and Japanese.\r\n\r\nROSÉ joined YG as a trainee four years ago when she was 15. She also featured on G-DRAGON’s “WITHOUT YOU” and is the main vocalist of BLACKPINK. LISA is from Thailand, and she has been a trainee of YG for five years. She is great in dancing and has been dancing as part of dance crews since she was a child.\r\n\r\nYANG HYUN SUK said, “I experimented a lot. There were dozens of candidates. Some are still trainees and some have left YG. I think the four we have now is the best combination.”\r\n\r\nBLACKPINK said, “We’re nervous because we’ve been waiting for this for a long time. We’ve been trained for a long time and we’ll do our best to show you a great performance.”\r\n\r\n◇ How is BLACKPINK different from 2NE1?\r\n\r\n\r\n\r\n\r\nYANG HYUN SUK answered, “I just want to say that I didn’t go out of my way to make them different from 2NE1. My thought was that making the most YG-like group is the most important thing.”\r\n\r\nHe added, “Until now, I valued ‘cool’ over ‘good-looking’ or ‘pretty’. Looks weren’t my priority when I made BIG MAMA, 2NE1, or BIGBANG. This was how I did things for the past 20 years, but I wanted to try a different way this time. I wanted BLACKPINK to be a group that has the looks and the talent.”\r\n\r\n“It’s hard to find people who can sing, dance and are pretty at the same time. That’s why it took so long,” he said with a chuckle.\r\n\r\nJISOO said, “People compare us with 2NE1 a lot, but they are seniors to us. We just want to be like them and follow in their footsteps.”\r\n\r\n◇ Will BLACKPINK be the next leading artist of YG?\r\n\r\n\r\n\r\nBLACKPINK’s debut album “SQUARE ONE” will be released later in the day at 8 PM. YG’s main producer TEDDY has been working on the album for more than two years. \r\n\r\nThe album consists of two tracks: a hip-hop song titled “WHISTLE” which is about the desire to receive confirmation of love and a fast EDM song titled “BOOMBAYA”, a song about loving yourself.\r\n\r\nYANG HYUN SUK said, “We’ve completed eight tracks. We’re releasing two music videos today, but we’ve have completed making another one. I think we’ll have to see on whether to release the album straight away or release two singles next like this time.”\r\n\r\nAs the showcase was nearing to an end, YANG HYUN SUK showed his confidence in the new girl group by saying, “I feel nervous as if I’m sending off my kids to school on their first day of elementary school, but I want to put them on the stage quickly.”\r\n\r\nHe added, “I feel worried and burdened because we haven’t launched many girl groups before. As you all know, 2NE1 has been on a break for two years now, and since BLACKPINK is filling in the gap as the next YG girl group, we’re feeling a lot of pressure. I hope BLACKPINK will do well, and I’ll do everything to help them.”\r\n\r\nJISOO commented, “Since we’re YG’s first girl group in seven years, we feel a lot has been put on our shoulders. But we will continue to practice hard so that we put on a perfect stage and don’t ruin YG’s reputation.”\r\n\r\n2016. 8. 8.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/20160808173724563468_99_20160808180405.jpg","thumb_2x1":false,"thumb_3x2":false},"936":{"id":936,"post_title":"BLACKPINK rising as the blue chip in the advertisement scene upon their debut","url_friendly_name":"blackpink-rising-as-the-blue-chip-in-the-advertisement-scene-upon-their-debut","excerpt":"","post_content":"\r\n\r\n[OSEN=최나영 기자] Rookie girl group BLACKPINK has been selected as the new model for cosmetics brand moonshot, drawing keen attention in the advertisement world.\r\n\r\nBLACKPINK will work as the new muse of cosmetics brand moonshot under YG Entertainment’s subsidiary YG PLUS, to promote a variety of products of the brand.\r\n\r\nBLACKPINK’s members who are 19-years-old on average boast healthy and clear skin, so industry insiders say that they are perfect models for a cosmetics brand.\r\n\r\nSo far, BIGBANG’s G-DRAGON and 2NE1’s DARA have promoted moonshot brand. People are already paying keen attention to what kind of new beauty BLACKPINK will suggest as the new face of moonshot brand, following the footsteps of the super-star predecessors.\r\n\r\nBLACKPINK’s debut song “BOOMBAYAH” and “WHISTLE” released on August 8 at 8pm boasted powerful influence in the music scene, sweeping top places on the real-time chart of major music-streaming websites in and out of the country.\r\n\r\n“WHISTLE” heralded the birth of an “unprecedented rookie girl group” by topping the real-time chart of seven music-streaming websites: Melon, Monkey 3, Olleh, NAVER Music, Bugs, Genie, and Soribada, as of August 9 at 10AM. Notably, the song succeeded in “kicking through the roof”, which refers to setting an unprecedentedly high record in Melon’s “24-hours streaming volume trend chart”.\r\n\r\nBLACKPINK is creating sensation overseas as well. Their debut album “SQUARE ONE” with two songs topped the iTunes chart of 12 countries: Hong Kong, Finland, Brunei, Indonesia, Malaysia, Norway, Paraguay, Philippines, Singapore, Thailand, Turkey, and Vietnam. Plus, it is ranked in the second place on the chart of the United States, the birthplace of pop music, seventh in France, and 11th in the U.K., enjoying a very exceptional global popularity for a rookie idol group.\r\n\r\nWith such a big sensation created by BLACKPINK within a day of their debut, people are paying keen attention to how big influence the team will exert in the advertisement world.\r\n\r\n2016. 8. 9.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/htm_2016081581047602342_99_20160815081203.jpg","thumb_2x1":false,"thumb_3x2":false},"934":{"id":934,"post_title":"[People is] BLACKPINK dominated charts in four hours… The remarkable potential of this “monstrous rookie”","url_friendly_name":"people-is-blackpink-dominated-charts-in-four-hours-the-remarkable-potential-of-this-monstrous-rookie","excerpt":"","post_content":"\r\n\r\n[일간스포츠=황미현 기자] YG’s new girl group BLACKPINK dominated all major music charts in Korea within four hours of the release of their debut songs.\r\n\r\nOn August 8 at 8PM, BLACKPINK released their debut song “BOOMBAYAH” and “WHISTLE”. “WHISTLE”, the title track, took No.1 on the chart of all music-streaming websites in Korea including Melon, Genie, Bugs, and Olleh Music, within four hours of release.\r\n\r\nMusic fans’ keen interest in BLACKPINK is also proven by “BOOMBAYAH” ranked in top five of all music charts.\r\n\r\nBased on the 808 drum and bass sound production in the beginning part, “WHISTLE” presents outstanding water-drop effect that catches the ears along with easy melody line of the theme of whistling. It is a catchy hip-hop music that presents JENNIE’s groovy rap and soulful vocal.\r\n\r\n“BOOMBAYAH” is remarkable as well.Its intro part is built up on unique synth sound and rhythmical rapping. It is an EDM (cross-over) combined with electronic house and dance hall, a mega-trend genre that is sweeping American Billboard recently. In the energetic and powerful drop part in the chorus, the key is modulated to give a fresh twist. An intense drum beat is also impressive.\r\n\r\nBLACKPINK will give their debut performance in SBS “INKIGAYO” on the 14 this month.\r\n\r\n2016. 8. 9.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/htm_2016081581047602342_99_20160815081203.jpg","thumb_2x1":false,"thumb_3x2":false},"932":{"id":932,"post_title":"GD Did Not Forget to Send Support for BLACKPINK Even on Vacation","url_friendly_name":"gd-did-not-forget-to-send-support-for-blackpink-even-on-vacation","excerpt":"","post_content":"\r\n\r\n[스포츠조선닷컴=김영록 기자] G-DRAGON did not forget to send his support for his labelmates BLACKPINK although he was on vacation on Jeju Island.\r\n\r\nOn August 9, G-DRAGON posted several photos and videos on his Instagram page.\r\n\r\nThere was a photo of G-DRAGON with another man, who is most likely to be SEUNGRI, in the sea with starfishes on their faces. He also posted a video of dolphins that he saw while he was sailing on a boat.\r\n\r\nBut the most impressive thing was G-DRAGON’s love for his labelmates. He posted a video of BIGBANG members driving carts, and the background music was BLACKPINK’s “WHISTLE”.\r\n\r\nG-DRAGON had promoted BLACKPINK even when he was on a world tour. Since he is a global star with more than 10 million followers, G-DRAGON’s Instagram page is an effective promotion tool with an impact that matches the impact of YG’s all promotion means.\r\n\r\nBLACKPINK’s debut singles “BOOMBAYA” and “WHISTLE” posted 100,0000 views in just a day after their release, and “WHISTLE” is currently dominating the charts.\r\n\r\nG-DRAGON’s support played a part in the success of BLACKPINK’s debut. The situation is different from when 2NE1 debuted in 2009, but G-DRAGON’s support for his labelmates remains the same.\r\n\r\n2016. 8. 9.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/2016081001000949700069481_99_20160809155003.jpg","thumb_2x1":false,"thumb_3x2":false},"927":{"id":927,"post_title":"[People is] YG’s Jewel Box BLACKPINK off to a Great Start","url_friendly_name":"people-is-ygs-jewel-box-blackpink-off-to-a-great-start","excerpt":"","post_content":"\r\n\r\n[일간스포츠=황미현 기자] BLACKPINK is off to a great start.\r\n\r\nYG Entertainment has been preparing to debut BLACKPINK for six years, and now their efforts are paying off. Because they have been making preparations for such a long time, the group is dubbed as YG’s “jewel box”. Now that BLACKPINK has debuted, fans are able to see they have the looks and the talent as YG guaranteed.\r\n\r\nBLACKPINK debuted by releasing “BOOMBAYA” and “WHISTLE”, the title tracks of their debut single album “SQUARE ONE”, at 8 PM on August 8. They have received much spotlight as they are YG’s first new girl group in seven years. YG’s YANG HYUN SUK said that he would launch a new girl group four years ago, but the launch had been delayed much to fans’ disappointment. At a showcase on August 8, he said, “I know what the fans want, but their debut has been delayed several times. I believed that it is better to present to the fans with something that is more satisfactory. I want to put BLACKPINK on the stage quickly. I’m sure that they are up to the task.”\r\n\r\n\r\n\r\n▶ BLACKPINK members background\r\n\r\nHe had every reason to be confident. The members of BLACKPINK, ROSÉ, JENNIE, LISA, and JISOO, have been trained at YG for four to six years. They have been assessed by YANG HYUN SUK himself monthly and honed their skills.\r\n\r\nJENNIE (20) was the first to be announced. She studied in New Zealand for a while and is fluent in Korean, Japanese, and English. She made herself known to the public by appearing in the music video of G-DRAGON’s “THAT XX”. In 2013, she featured on the title track of “BLACK”, the title track of G-DRAGON’s second solo album. Her excellent rap makes her stand out in BLACKPINK’s debut songs.\r\n\r\nLISA (19) is the only foreigner artist in YG. She is from Thailand, and she is great in dancing. LISA’s “Who’s That Girl” dance video released in 2012 became quite an issue. Just like JENNIE, LISA is also fluent in Korean, Japanese, and English on top of her mother tongue. She appeared in the music video of TAEYANG’s “RINGA RINGA” and was YG’s NONAGON model along with iKON’s B.I and BOBBY.\r\n\r\nJISOO (21) is the oldest of BLACKPINK members. She appeared in the music videos of EPIK HIGH’s”SPOILER&amp;HAPPEN ENDING” and HI&amp;SOOHYUN’s “I’M DIFFERENT”. In 2015, she appeared as a cameo in KBS 2’ drama series “Producer”.\r\n\r\nROSÉ (19) has been a trainee at YG since 2012 after winning its audition contest first place. She featured on G-DRAGON’s “WITHOUT YOU”, a track in his mini-album “ONE OF A KIND”, and is known to play the guitar well.\r\n\r\n\r\n\r\n▶BLACKPINK sets new records in just a day\r\n\r\nBLACKPINK has set new records in just a day after their debut. After its release at 8 PM on August 8, BLACKPINK’s “WHISTLE” topped four charts in just an hour and all the charts in just four hours. “BOOMBAYA” is also popular ranking fifth on the charts.\r\n\r\nBLACKPINK’s popularity is going global. As of August 9, their new single album “SQUARE ONE” topped the charts in just 12 hours after release in 12 countries including Hong Kong, Finland, Brunei, Indonesia, Malaysia, Norway, Paraguay, the Philippines, Singapore, Turkey, and Vietnam. It also ranked second in the US and 11th in the UK, which is unusual for a rookie.\r\n\r\nBLACKPINK’s music video views are also going up rapidly. The music videos of “BOOMBAYA” and “WHISTLE” surpassed seven million views in total in just five hours after release on Naver’s TV Cast and on Youtube.\r\n\r\n\r\n▶A group with both the looks and talent, which is a rare case in YG\r\n\r\nBLACKPINK is YG’s new experiment, but at the same time, it is the most YG-like group. Just like 2NE1, BLACKPINK consists of four members. When asked about the style of BLACKPINK’s music, YANG HYUN SUK answered, “I didn’t try to force them to be different from 2NE1. YG has its own style. No matter the group, we try to make music that is most YG-like. The same jacket looks different when different people put it on, and so BLACKPINK will just be doing YG-style music.”\r\n\r\nOut of all YG groups, BLACKPINK is said to have the most gorgeous looks. It is a new experiment considering that YG focused more on talent than looks when it launched 2NE1, BIGBANG, and BIG MAMA. YANG HYUN SUK commented, “It is indeed a new direction. Looks are important because they are stars and entertainers. But I do believe being pretty is good. It wasn’t my no.1 priority when I made BIG MAMA or 2NE1. It was the same for BIGBANG. At first, BIGBANG was also criticized for their looks. This was how I did things for the past 20 years, so I wanted to go a different direction when I made BLACKPINK. I wanted a group that has the looks and the talent, so that’s why it took such a long time.”\r\n\r\n2016. 8. 10.\r\n\r\n","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/htm_2016081581047602342_99_20160815081203.jpg","thumb_2x1":false,"thumb_3x2":false},"923":{"id":923,"post_title":"[Exclusive] SONG MINHO X BOBBY did guerilla shooting of music video in Itaewon… Soon to be launched","url_friendly_name":"exclusive-song-minho-x-bobby-did-guerilla-shooting-of-music-video-in-itaewon-soon-to-be-launched","excerpt":"","post_content":"\r\n\r\n[OSEN=정준화 기자] The new combination that is drawing keen attention! The unit team of YG’s rapper SONG MINHO and BOBBY is soon to be launched. The team has recently completed shooting of a music video and they are now accelerating the preparation for the release of their new album.\r\n\r\nAccording to music industry insiders on August 11, boy group WINNER’s SONG MINHO and iKON’s BOBBY did the shooting for a music video twice, on August 5 in the afternoon and on August 6 in early morning, in Itaewon located in Yongsan-gu, Seoul.\r\n\r\nThe shooting was carried out in the format of “mob”; SONG MINHO and BOBBY holding a guerilla concert in front of a big crowd was shot into the music video. The two gave performance on a truck parked amidst big crowd. BOBBY heated up the atmosphere by performing “GO” and SONG MINHO did by performing “GUP” and “Okey Dokey”. At the end of the concert, the two presented the performance of the new song that they will release soon.\r\n\r\nPlus, SONG MINHO and BOBBY showed acting in a variety of scenes, including one in they walk out of a restaurant, drunken. The two’s acting the music video is raising fans’ anticipation.\r\n\r\nOSEN had exclusively reported that SONG MINHO and BOBBY formed a unit team and they will release an album. According to insiders, the unit team of BOBBY and SONG MINHO will mainly present genuine hip-hop, which has not been performed by WINNER and iKON that much so far.\r\n\r\nSONG MINHO and BOBBY are the rapper of WINNER and iKON, respectively, who always well-express each team’s color with an intense and powerful performances. BOBBY won “Show Me the Money 3” and SONG MINHO became the runner-up of “Show Me the Money 4”, the hip-hop competition TV show, to break prejudice against idol singers.\r\n\r\n2016. 8. 11.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/201608110924777052_57abd70551164_99_20160811111103.jpg","thumb_2x1":false,"thumb_3x2":false},"922":{"id":922,"post_title":"[ISSUE is] BLACKPINK got A+ on their report card in the global music market… The victory of YG contents","url_friendly_name":"issue-is-blackpink-got-a-on-their-report-card-in-the-global-music-market-the-victory-of-yg-contents","excerpt":"","post_content":"\r\n\r\n[일간스포츠=이미현 기자] YG is standing under an exceptionally big spotlight in the global pop music market. YG’s artists are drawing even bigger attention overseas than in Korea.\r\n\r\nBLACKPINK, a rookie girl group that YG ambitiously launched for the first time in seven years, dominated music charts in Korea, entered top 10 on iTunes charts, and topped iTunes chart of nine countries, upon their debut on August 8. Riding on such momentum, BLACKPINK set an unprecedented record of becoming the first Korean girl group to top the iTunes worldwide chart of the United States, on August 10.\r\n\r\nThe reason why BLACKPINK could become such a “monstrous rookie” who is recognized not only in Korea but also overseas upon their debut is attributable to YG’s outstanding capabilities of creating good contents. YG’s CEO YANG HYUN SUK has a firm principle of creating best contents on the basis of YG’s unique musical style. Such principle was the very foundation for creation of BLACKPINK.\r\n\r\nThe principle is now getting recognized globally. Foreign pop music fans are showing keen interest in BLACKPINK who has outstanding beauty, talent in singing, and capabilities as professional artists. The music videos of BLACKPINK’s “WHISTLE” and “BOOMBAYAH” surpassed 1.73 million views and 1.37 million views, respectively, on NAVER TV CAST as of August 11 at 8AM.\r\n\r\nOn YouTube which best-demonstrates an artist’s global popularity, the music videos of the two songs are recording 6.3 million and over-7 million views, surpassing 10 million views in combination within three days of BLACKPINK’s debut. It is an unprecedentedly great popularity for a rookie who made debut only three days ago.\r\n\r\nYG artists have already been recognized in the global pop music market. PSY has evolved into a “world star” and BIGBANG proved their global influence by attracting 1.5 million fans to their world tour held in 32 cities in 13 countries around the world for 10 months from 2015.\r\n\r\n2016. 8. 11.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/htm_2016081581047602342_99_20160815081203.jpg","thumb_2x1":false,"thumb_3x2":false},"921":{"id":921,"post_title":"Chinese Fans are Showing Huge Response to BLACKPINK, Making the Group Dominate QQ Music Charts","url_friendly_name":"chinese-fans-are-showing-huge-response-to-blackpink-making-the-group-dominate-qq-music-charts","excerpt":"","post_content":"\r\n[스포츠조선닷컴=김준석 기자] YG Entertainment’s new girl group BLACKPINK has become a mega rookie not only in Korea but also in China.\r\n\r\nAs of 11 AM on August 11, BLACKPINK’s debut single album “SQAURE ONE” is at no.1 on QQ Music’s popular chart, MV chart, and K-Pop MV chart. “BOOMBAYA”, one of the title tracks of the album, ranked second and third on the K-Pop MV chart and the MV chart, which demonstrates BLACKPINK’s overwhelming popularity in China.\r\n\r\nBLACKPINK is also sweeping the charts in Korea. As of 2 PM on August 11, “WHISTLE” is no.1 on the charts of eight major music streaming websites: Melon, Monkey3, Olleh, Naver Music, Bugs, Genie, Mnet, and Soribada. This shows that YG had every reason to be so confident about BLACKPINK.\r\n\r\n“WHISTLE” is hip-hop song with a simple beat that is sexy and hypnotizing at the same time. The unique melody that is themed around whistle sounds and the tinkling bubble sounds make the song pleasant to the ear. “BOOMBAYA” is an upbeat song that has a powerful drum beat and unique synth sounds.\r\n\r\nBLACKPINK debuted on August 8, and their debut singles swept not only the realtime and daily charts of Korea but also the iTunes charts of other countries in just hours after their release, which is an unusual success for a rookie.\r\n\r\nMoreover, the music videos of “WHISTLE” and “BOOMBAYA” posted 6,705,816 and 7,481,565 views respectively as of now. Combined, the two music videos posted 14,187,381 views and are expected to surpass 20 million soon.\r\n\r\nMeanwhile, BLACKPINK will appear on SBS’s Inkigayo on August 14 and perform “WHISTLE” and “BOOMBAYA” on the stage for the first time.\r\n\r\n2016. 8. 11.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/htm_2016082092916546801_99_20160820093004.jpg","thumb_2x1":false,"thumb_3x2":false},"919":{"id":919,"post_title":"BLACKPINK, “Honored by all the support you are giving us”","url_friendly_name":"blackpink-honored-by-all-the-support-you-are-giving-us","excerpt":"","post_content":"\r\n[엑스포츠뉴스=정지원 기자] YG Entertainment’s new girl group BLACKPINK expressed their gratitude for great support from fans in and out of the country.\r\n\r\nOn August 12 at 10AM, a short video titled “A THANK YOU TO OUR FANS WORLDWIDE” was posted on YG’s official blog.\r\n\r\nIn the video, BLACKPINK’s members express their gratitude, saying, “We’re so honored by all the support you guys are giving us. Thank you so much, we love you”.\r\n\r\nNotably, JENNIE and ROSÉ boast their fluent English in the video, leaving a big impression. The two had lived in New Zealand and Australia, respectively.\r\n\r\nBLACKPINK released their debut single album “SQUARE ONE” on August 8. “WHISTLE” and “BOOMBAYAH”, the double title tracks of the album, took top ranks on the real-time and daily charts of major music-streaming websites in Korea, upon their release.\r\n\r\nPlus, BLACKPINK proved their big popularity by topping QQ Music popularity chart, music video chart, and K-pop popularity chart of China’s biggest music-streaming website QQ Music.\r\n\r\nIn the meantime, BLACKPINK will appear in SBS “INKIGAYO” on August 14, to present the performance of “WHISTLE” and “BOOMBAYAH” for the first time.\r\n\r\n2016. 8. 12.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/1470964048958_99_20160812100804.jpg","thumb_2x1":false,"thumb_3x2":false},"914":{"id":914,"post_title":"BLACKPINK’s JENNIE Sprains Her Ankle While Shooting Inkigayo","url_friendly_name":"blackpinks-jennie-sprains-her-ankle-while-shooting-inkigayo","excerpt":"","post_content":"\r\n\r\n\r\n[일간스포츠=조연경 기자] Although JENNIE was injured, she finished recording the show.\r\n\r\nBLACKPINK’s first debut performance is to be aired on SBS’s Inkigayo on September 14, and the pre-recording took place on August 12.\r\n\r\nAfter recording the “WHISTLE” performance, BLACKPINK was rehearsing “BOOMBAYAH” and JENNIE sprained her ankle while dancing passionately. She had to be taken straight to the hospital and get tested.\r\n\r\nAccording to the staff, JENNIE couldn’t even stand up straight and the recording had to be put to a halt. But, JENNIE was determined to continue and finish recording the performance. So, she went up on the stage and performed while on painkillers, and BLACKPINK was able to finish shooting the “WHISTLE” performance for the TV show.\r\n\r\nAn YG Entertainment official said, “Thankfully, it wasn’t anything serious. But her ankle is still swollen.”\r\n\r\nMeanwhile, BLACKPINK released their debut singles on August 8, and since then, their songs have swept not only the realtime and daily charts of Korea but also the iTunes charts of other countries. It is a rare success for a rookie.\r\n\r\nBLACKPINK’s “WHISTLE” and “BOOMBAYAH” performances will be aired for the first time on SBS’s Inkigayo on August 14.\r\n\r\n2016. 8. 13.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/htm_201608138578274945_99_20160813085805.jpg","thumb_2x1":false,"thumb_3x2":false},"911":{"id":911,"post_title":"[Entertainment Special] Behind the Scenes of BLACKPINK’s “WHISTLE” MV","url_friendly_name":"entertainment-special-behind-the-scenes-of-blackpinks-whistle-mv","excerpt":"","post_content":"BLACKPINK has finally made their debut. The long-awaited debut of YG’s new girl group took place on August 8 with the release of a debut single album titled “SQUARE ONE”.  \r\nCurrently, one of the title songs of the album, “WHISTLE”, is no.1 on the charts of Korea’s seven major music streaming websites as well as on the iTunes albums chart. Let us take you to behind the scenes of the “WHISTLE” music video.\r\nAs “WHISTLE” is the first song that BLACKPINK ever recorded and the first music video the group ever filmed, it bears great significance to the members.\r\nThe “WHISTLE” music video’s unique and sensual scenes are quite an eye-catcher. Naver’s Entertainment Special will take you behind the scenes of BLACKPINK’s first music video shoot. Let’s go!\r\n\r\n\r\nA lot of mystical computer graphic effects have been used in the “WHISTLE” music video.\r\n\r\nTo shoot the scene where they go up gracefully, ROSÉ and JISOO had to be attached to wires. ROSÉ was the first to go. She was not afraid and did what she had to do without showing any signs of discomfort. After shooting the scene, she shouted out loud, “I feel so happy!”\r\n\r\n\r\n\r\nThen, it was JISOO’s turn. Before shooting the scene, she seemed to be worried because she’s scared of heights. But when the shooting began, she did the scene perfectly. Let’s give a big hand to JISOO for being so brave!\r\n\r\n\r\n\r\nJENNIE had to shoot a scene with her on a horse. She went up on the horse on her first try and surprised the staff. The truth is she learned how to ride a horse when she was a child. and she had been looking forward to shooting the scene.\r\n\r\n\r\nThis is LISA shooting her part in the music video. Isn’t she lovely fiddling about with the game controller? She looks cute now, but when the shooting begins, she switches her mode and becomes charismatic.\r\n \r\nThis is LISA monitoring after shooting her part. It was hard to believe that it was her first time shooting a music video, and thorough monitoring must be the secret! \r\n\r\nThis is BLACKPINK under a chandelier. This scene was also used in the poster. Although, they were not wearing heels, their legs look fabulously long! \r\n\r\n\r\n\r\nJISOO’s face looks perfect from either side. The staff could not take their eyes off the monitoring screen while shooting this scene. \r\n\r\nWhen JENNIE was shooting this scene, suddenly it started to rain. But, the shooting had to go on and everyone had become wet. After the shoot was done, they were glad that scene turned out so great and that they didn’t get wet for nothing.  \r\n\r\nThe shooting continued all through the night, and ROSÉ went around cheering and thanking everyone by saying, “Sorry that you have to stay up all night for this and thank you.” The shooting went on for hours, but she didn’t frown for one second and worked hard all the way through. It was really thoughtful of her to thank the staff too. \r\n\r\nWhat’s that green ball that LISA is sitting on? CG effects were used to make the green ball look like the earth in the music video. The scene in the music video in which members sit on the earth is quite impressive, and this is how they shot the scene.\r\n\r\nThis is how they shot the scene with all the members in a car. The car kept going round and round, so some members got car sick! Check out the part where JENNIE makes a heart with her fingers! \r\nHere is the behind-the-scenes video and the music video of “WHISTLE”.\r\n[BLACKPINK - '휘파람'(WHISTLE) M\/V BEHIND THE SCENES]\r\n\r\n[BLACKPINK - '휘파람'(WHISTLE) M\/V]\r\n\r\nHope you enjoyed it, because we will also bring you the behind-the-scene story of BLACKPINK’s “BOOMBAYAH” soon. Don’t forget to check it out! \r\n2016. 8. 13.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/083614564_01.jpg","thumb_2x1":false,"thumb_3x2":false},"906":{"id":906,"post_title":"[BLACKPINK Review②] BLACKPINK Reaps Fruit after Six Years of Training","url_friendly_name":"blackpink-review%e2%91%a1-blackpink-reaps-fruit-after-six-years-of-training","excerpt":"","post_content":"\r\n\r\n[일간스포츠=이미현 기자] BLACKPINK finally went up on the stage for their debut performance. The four members of BLACKPINK succeeded in leaving quite an impression on the public after singing two songs.\r\n\r\nOn August 14, BLACKPINK went up on the stage on SBS’s Inkigayo and sang “WHISTLE” and “BOOMBAYAH”. Their flawless performance was the result of four to six years of training at YG Entertainment. BLACKPINK’s debut stage showed that the efforts of JENNIE, JISOO, ROSÉ, and LISA really paid off.\r\n\r\nBLACKPINK sang “WHISTLE” first. The camera zoomed in on each of the members while they sang the hypnotizing song. It was hard to believe that they are rookies after seeing their flawless singing and dancing.\r\n\r\nThe “BOOMBAYAH” performance was enough to make anyone fall in love with BLACKPINK. They put on a fierce stage and danced to the powerful beat without making a single mistake. It was difficult to take your eyes off the members as they sang and danced to the song perfectly. The audience sang along, reflecting BLACKPINK’s huge popularity.\r\n\r\nJENNIE sprained her ankle when the group was pre-recording the show on August 12. But she took painkillers and went up on the stage even though she was in great pain. Seeing her performance, it was hard to believe that she sprained her ankle only hours ago. Since JENNIE had been a trainee of YG for as much as six years, the debut stage was something that she dreamed about for a long time. It was touching to see her work so hard despite the pain for her dreams.\r\n\r\n\r\nOn the same day, BLACKPINK regained the no.1 spot on the charts of Korea’s seven major music streaming websites: Melon, Olleh Music, Naver Music, Mnet, Bugs, Soribada, and Genie.\r\n\r\nAlthough BLACKPINK is a mere rookie, their songs have been ranking high on the charts as if waiting for the right moment to take the no.1 spot. Just before their first debut stage, BLACKPINK took back the no.1 spot on the charts and proved they are a monster rookie.\r\n\r\nThe numbers also show that BLACKPINK is indeed a mega rookie. In just 100 hours after its release, the “BOOMBAYAH” music video surpassed 10 million views, and later in the day, “WHISTLE” music video also surpassed the 10 million mark. Combined, the two music videos posted more than 20 million views, reflecting the group’s global popularity. “WHISTLE” is also no.1 on the charts of Korea’s eight major music streaming websites.\r\n\r\nMeanwhile, BLACKPINK is YG’s first new girl group in seven years. The group consists of JISOO, JENNIE, ROSÉ, and LISA, who have been trainees at YG for as long as six years. On August 8, BLACKPINK released their debut single album “SQUARE ONE”, and the title tracks of the album, “WHISTLE” and “BOOMBAYAH”, are currently sweeping the charts.\r\n\r\n2016. 8. 14.\r\n\r\n","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/htm_20160814163645217492_99_20160814165303.jpg","thumb_2x1":false,"thumb_3x2":false},"904":{"id":904,"post_title":"After their Debut Stage, BLACKPINK said, “Our minds went blank when we went up on the stage. We’ll try to show many different sides of us.”","url_friendly_name":"after-their-debut-stage-blackpink-said-our-minds-went-blank-when-we-went-up-on-the-stage-well-try-to-show-many-different-sides-of-us","excerpt":"","post_content":"\r\n\r\n[마이데일리=전원 기자] YG Entertainment’s new girl group BLACKPINK did their first performance on SBS’s Inkigayo. BLACKPINK took their first step as a girl group by putting on a flawless performance and demonstrated that they deserve to be called a “monster rookie.”\r\n\r\nOn August 14, BLACKPINK did their first stage on SBS’s Inkigayo.\r\n\r\nYG Entertainment announced that BLACKPINK members said after doing their stage, “Our minds went blank when we went up on the stage. But, many people cheered for us, and so we were able to do well. Looking back, we feel that we could have done better. We’ll work harder so that fans can see us improving and our different appeals”.\r\n\r\nA singer only debuts once, so it was only natural that the scale of BLACKPINK’s debut stage was phenomenal. The set for “WHISTLE” had a LED screen that went around the stage, and in the center there was an architectural piece. The “BOOMBAYAH” set had an installation that showed the faces of the members. Both sets were spectacular considering that they were for a music show.\r\n\r\nBLACKPINK members sang and danced to their songs without making a single mistake, and it was hard to believe that they were mere rookies. For the “BOOMBAYAH” stage, BLACKPINK did the exact dance moves as in the music video, proving that they can sing and dance live and are indeed the “whole package”.\r\n\r\nThe numbers show that BLACKPINK is indeed a mega rookie. In just 100 hours after its release, the “BOOMBAYAH” music video surpassed 10 million views, and later in the day, “WHISTLE” music video also surpassed the 10 million mark. Combined, the two music videos posted more than 20 million views, reflecting the group’s global popularity. “WHISTLE” is also no.1 on the charts of Korea’s eight major music streaming websites.\r\n\r\nMeanwhile, BLACKPINK is YG’s first new girl group in seven years. The group consists of JISOO, JENNIE, ROSÉ, and LISA, who have been trainees at YG for as long as six years. On August 8, BLACKPINK released their debut single album “SQUARE ONE”, and the title tracks of the album, “WHISTLE” and “BOOMBAYAH”, are currently sweeping the charts.\r\n\r\n2016. 8. 14.\r\n","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/201608141635621138_1_99_20160814163604.jpg","thumb_2x1":false,"thumb_3x2":false},"900":{"id":900,"post_title":"[Chart is] BLACKPINK in No.1 on charts for 8 days… Recording long-run","url_friendly_name":"chart-is-blackpink-in-no-1-on-charts-for-8-days-recording-long-run","excerpt":"","post_content":"\r\n\r\n[일간스포츠=황미현 기자] Group BLACKPINK is staying in No.1 place on music charts for eight days in a row.\r\n\r\nAs of August 15, BLACKPINK’s debut song “WHISTLE” is staying in the top rank on Korea’s biggest music-streaming website Melon, as well as Bugs, Genie, and NAVER Music. The song took No.1 on charts upon its release on August 8 and has stayed within top 10 since then. On August 14, the song reclaimed No.1.\r\n\r\nAlong with “WHISTLE”, “BOOMBAYAH” is also staying in top places on music charts.\r\n\r\nBLACKPINK is YG Entertainment’s first new girl group in seven years since 2NE1. Their outstanding talent and beauty have drawn keen attention from music fans and the music scene. The members have built their capabilities as entertainers, by getting YG’s hard training for four to six years.\r\n\r\nBLACKPINK presented their debut performance in SBS “INKIGAYO” on August 14, to boast veteran charisma on the stage.\r\n\r\n2016. 8. 15.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/htm_2016081581047602342_99_20160815081203.jpg","thumb_2x1":false,"thumb_3x2":false},"898":{"id":898,"post_title":"[Entertainment Special] BLACKPINK’s “BOOMBAYAH” Behind the Scenes","url_friendly_name":"entertainment-special-blackpinks-boombayah-behind-the-scenes","excerpt":"","post_content":"[NAVER TV Entertainment] Today, the shooting of the music video of BLACKPINK’s “BOOMBAYAH” is unveiled!\r\n\r\nThe music video of “BOOMBAYAH” presents BLACKPINK’s members in intense and powerful scenes.\r\n\r\nThe video is enjoying big popularity from in and out of the country, surpassing 10 million views on YouTube within five days of release!\r\n\r\nHow the second music video of BLACKPINK was shot is unveiled now exclusively on NAVER Entertainment special.\r\n\r\nNow! Let’s go to the shooting of BLACKPINK’s music video of “BOOMBAYAH”.\r\n\r\nThe music video of BLACKPINK’s “BOOMBAYAH” begins with a scene in which the members are riding motorbikes!\r\n\r\nThe lyrics “BLACKPINK in your area” that is so attractively murmured by JENNIE feels like a spell cast on us.\r\n\r\nROSÉ jumps over a gigantic truck in the video!\r\n\r\nActually, the scene was completed after plenty of practices.\r\n\r\nGood job, ROSÉ!\r\n\r\nLISA is standing in front of huge speakers!\r\n\r\nLISA presented her veteran acting and rap performance for the shooting of “BOOMBAYAH”s music video, to be acclaimed by all the staff at the shooting.\r\n\r\nCutie JENNIE is seating on a pink car!\r\n\r\nEven though the shooting lasted overnight for three days and two nights, JENNIE showed professional acting whenever the camera was on. JENNIE’s beautiful smile made the atmosphere at the shooting comfortable and fun!!\r\n\r\nJISOO’s beauty displayed in the scene in which she put on pink lipstick in a fancy restroom left big impression!\r\n\r\nJISOO said she really liked the pink lights streaming through fans behind her, which went well with the lyrics “The dancing lights are covering me” that she sings.\r\n\r\nJISOO is seriously listening to the director’s instructions!\r\n\r\nBLACKPINK members mingle so well with one another!\r\n\r\nThey cheered up each other, enjoying the shooting all the time.\r\n\r\nThe reason why the atmosphere at the shooting was so friendly and fun was because the members have a strong bond and friendship built during the long-time training together.\r\n\r\nSo, that was how the music video of “BOOMBAYAH” was shot.\r\n\r\nPlease enjoy “WHISTLE” and “BOOMBAYAH” of BLACKPINK’s debut single “SQUARE ONE” and look forward to BLACKPINK’s performances to be presented from now on!\r\n\r\nLastly, here are “M\/V BEHIND SCENES” of BLACKPINK’s “BOOMBAYAH” and the music video!\r\n\r\n[BLACKPINK - '붐바야'(BOOMBAYAH) M\/V BEHIND THE SCENES]\r\n\r\n[BLACKPINK - '붐바야'(BOOMBAYAH) M\/V]\r\n\r\n2016. 8. 15.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/094636289_A4B7A4B7.jpg","thumb_2x1":false,"thumb_3x2":false},"896":{"id":896,"post_title":"[BIGBANG Through Numbers] BIGBANG held 100 Concerts Abroad from 2013 to 2016, and G-DRAGON has 10 Million Followers","url_friendly_name":"bigbang-through-numbers-bigbang-held-100-concerts-abroad-from-2013-to-2016-and-g-dragon-has-10-million-followers","excerpt":"","post_content":"Youtube views of “FANTASTIC BABY” stands at 240 million.\r\n\r\nBIGBANG’s earnings for the past year is 50.6 billion won.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nBIGBANG’s 10th anniversary exhibition titled “A.to.Z” is being held at S Factory in Sungsu-dong. Since its opening on August 5, an average of 1,000 people has attended the exhibition. The exhibition will be held until October 30.\r\n\r\nBIGBANG poses for the camera at a press conference before the opening of the exhibition on August 4.\r\n\r\n[서울경제=연승 기자] BIGBANG (G-DRAGON, TAEYANG, T.O.P, DAESUNG, and SEUNGRI) is celebrating the 10th anniversary of its debut this year. The group debuted in 2006 with a single album titled “BIGBANG”. Since then, it has become an iconic boy group representing K-Pop and Korea’s mass culture. BIGBANG has set, and is still setting, a number of new records and opened up a new chapter in the history of K-Pop. BIGBANG is not just an idol group but artists. Let’s see BIGBANG through numbers.\r\n\r\n◇100=According to Billboards, BIGBANG held a total of 100 concerts abroad from 2013 to 2016, the biggest number among K-Pop artists. A total of 1,456 K-Pop concerts were held abroad during the same period. The tickets to BIGBANG’s concerts were all sold out, demonstrating BIGBANG’s ticket power. During their first world tour, “ALIVE TOUR”, BIGBANG held concerts in 12 countries and drew 800,000 people. In their “MADE” tour, which started in 2015 and ended in March this year, BIGBANG held 66 concerts in 13 countries and drew 1.5 million people as audience. If you look by countries, BIGBANG held 18 concerts in four cities in Japan and drew 911,000 people as audience, and in China, drew 250,000 people by holding concerts in 13 cities.\r\n\r\n◇10 million= BIGBANG’s leader, G-DRAGON, is the first Asian celebrity to have surpassed the 10 million mark in the number of SNS followers. This shows that G-DRAGON is indeed the hottest star in Asia. G-DRAGON not only makes and writes songs for BIGBANG but also receives much spotlight for his unique and trendy fashion style. Thanks to his great fashion sense, he has recently been chosen as the model of 8 Seconds and is participating in designing too. Last year, together with Kwon Oh-sang, G-DRAGON held a contemporary arts exhibition titled “PEACEMINUSONE: Beyond the Stage”.\r\n\r\n◇242 million= The music video of BIGBANG’s “FANTASITC BABY” posted 242,168,000 views on Youtube. This is the first time that a Korean artist’s music video surpassed the two hundred million mark. In addition, four of BIGBANG’s music videos surpassed the one hundred million mark, the first among K-Pop groups.\r\n\r\n◇50.6 billion= According to Forbes, BIGBANG ranked 54th among its list of 100 top-earning celebrities. From June 2015, BIGBANG earned a whopping 50.6 billion won (44 million dollars), which is more than what Maroon 5 earned, which stands at 33.5 million dollars. It is the first time that a Korean artist was included in the list. Thanks to BIGBANG’s success, YG Entertainment’s sales grew 10-fold compared with 2008 and reached 193 billion won.\r\n\r\nWhat will the future be like for BIGBANG, a group that has set countless numbers of new records? At a press conference held earlier this month, G-DRAGON said, “We think a lot about our next step and about our next ten years. If we can inspire people, we want to contribute to enhancing the culture, and right now, we’re trying to draw the big picture for that.”\r\n\r\nMeanwhile, to celebrate BIGBANG’s 10th anniversary, a number of events are taking place. On August 20, ”BIGBANG10 THE CONCERT: 0.TO.10” will be held at the World Cup Stadium in Sangam-dong, and a total of 60,000 people is expected to attend the concert. For those who weren’t able to get the tickets, additional tickets to “restricted view” seats were also open for sale. BIGBANG’s exhibition featuring various records of the past 10 years of BIGBANG is being held at S Factory until October 30. In June, BIGBANG’s documentary “BIGBANG MADE” hit the box office.\r\n\r\n\r\n2016. 8. 15.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/1L05IDDW0B_1_99_20160815175404.jpg","thumb_2x1":false,"thumb_3x2":false},"892":{"id":892,"post_title":"YG, ‘WHO’S NEXT?’… Who will be next to BLACKPINK?","url_friendly_name":"yg-whos-next-who-will-be-next-to-blackpink","excerpt":"","post_content":"\r\n[스포츠조선닷컴=김준석 기자] YG Entertainment (“YG”) unveiled a “WHO’S NEXT?” teaser image. Music fans are paying keen attention to who the next YG artist to come back following BLACKPINK’s debut on August 8 will be.\r\n\r\nThe teaser image was unveiled on August 16 on YG’s official blog. On top of words “WHO’S NEXT? \/ AUG.19.2016”, an image of stairs leading to a mysterious door on the cloud is displayed in it, to arouse keen interest.\r\n\r\nYG had already announced plans for the second half of this year, including girl group BLACKPINK’s debut, release of BOBBY and MINHO’s unit album, and AKMU’s new album. Now, music fans are paying keen attention to whether one of those teams is coming back or a new project is going to be launched.\r\n\r\nYG is creating sensation with the domination of music charts by BLACKPINK, YG’s first new girl group in seven years. About a week after BLACKPINK’s debut, YG has now unveiled a new “WHO’S NEXT?” teaser unexpectedly. The next YG artist to release an album will be the next hot issue in Korea’s music scene.\r\n\r\n2016. 8. 16.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/2016081701001646100125861_99_20160816101205.jpg","thumb_2x1":false,"thumb_3x2":false},"888":{"id":888,"post_title":"iKON Says, “We don’t fight a lot, but SONG YUNHYEONG is the peacemaker”","url_friendly_name":"ikon-says-we-dont-fight-a-lot-but-song-yunhyeong-is-the-peacemaker","excerpt":"","post_content":"\r\n[TV리포트=박설이 기자] iKON poses for a Chinese magazine.\r\n\r\nThe August edition of Vogue China featured iKON’s pictures and interview. iKON members talked about their styles, how they spend their free time, and how they try to keep the teamwork going.\r\n\r\n\r\n\r\nWhen asked if they ever fought, leader B.I said, “We don’t fight usually. But when we do have a difference in opinions, SONG YUNHYEONG is the peacemaker. He doesn’t actually solve things. He just talks sense and everyone get along again.”\r\n\r\n\r\n\r\nMeanwhile, BOBBY talked about how he wanted to do a solo album. He said, “I like various styles of artists Jay Z, Nas, and Tupac. But at first, I liked Lil Wayne and Kendrick Lamar.”\r\n\r\nWhen asked if he ever wanted to release a solo album, BOBBY answered, “Of course, I want to make my solo album. I think that it is important to try different music styles.”\r\n\r\niKON is currently a regular cast of China’s EDM audition show “The Remix” along with PSY.\r\n\r\n\r\n\r\n2016. 8. 16.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/20160816_1471336635_38731300_1_99_20160816174205.jpg","thumb_2x1":false,"thumb_3x2":false},"884":{"id":884,"post_title":"YG and YANG HYUN SUK, Why “America” and why “CL”? ②","url_friendly_name":"yg-and-yang-hyun-suk-why-america-and-why-cl-%e2%91%a1","excerpt":"","post_content":"\r\n\r\n[스타뉴스=문완식 기자] Girl group 2NE1’s CL is making an official debut in the United States.\r\n\r\nOn August 17 in the morning, YG Entertainment announced on its official blog YG LIFE that CL is releasing an official debut single album in the United States.\r\n\r\nThe title of CL’s first single in the United States is “LIFTED”. YG explains that “LIFTED” means an “excited and upbeat feeling” in this song.\r\n\r\nThen, why does it have to be America and why does it have to be CL?\r\n\r\nYou can find the answer in SBS “Healing Camp” show aired on May 21, 2012.\r\n\r\nIn the show, YG’s CEO YANG HYUN SUK said that he wanted to go beyond and play a bigger game on the global stage. “Global” mostly meant America and Europe where there are big and matured pop music markets. In the past, YANG tried to expand to the American pop market with SEVEN, but he experienced failure at that time.\r\n\r\nYANG said in “Healing Camp”, “For SEVEN, I couldn’t do much and even I myself was not sure about whether the project really began in earnest or not. What SEVEN did most in the States was English lessons. He released one single and we even did not do any promotion. I didn’t know how to do it”.\r\n\r\n“In my opinion, in American and European music markets, women have bigger possibility of success than men. There is a huge gap between the appeals of Asian men when seen by Western women and appeals of Asian women seen by Western men”, added YANG.\r\n\r\nIn short, “a female artist who is fluent in English” is the best option for YG’s penetration in the States. If such female artist has outstanding talent that could appeal in the country, that is the right one customized for YANG HYUN SUK’s project for YG’s business in the United States.\r\n\r\n\r\n\r\nCL is a woman who had lived overseas when she was young, so fluent in English. Plus, she has an outstanding talent in music. The potential of her success in American pop music market has already been confirmed.\r\n\r\nFor almost two years, CL has established strategies for her debut in the States along with Scooter Braun. Scooter Braun is responsible for management of world-famous pop stars including Justin Bieber and Ariana Grande and he helped PSY’s success in the States.\r\n\r\nCL released “HELLO BITCHES”, the pre-promotion song for her debut in America, in November last year, to take No.1 on global music-streaming website Sportify. Such record proved her “potential”.\r\n\r\nNow, YG and YANG HYUN SUK’s long-cherished dream has taken its first step for realization. YANG HYUN SUK has achieved remarkable success as the head producer of YG so far. Music fans are now paying keen attention to if his success story will be “smoothly” written again in the States.\r\n\r\n2016. 8. 17.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/2016081708080743852_1_99_20160817104826.jpg","thumb_2x1":false,"thumb_3x2":false},"882":{"id":882,"post_title":"The next YG artist to come back is CL… First single in the States to be released on the 19 [official announcement]","url_friendly_name":"the-next-yg-artist-to-come-back-is-cl-first-single-in-the-states-to-be-released-on-the-19-official-announcement","excerpt":"","post_content":"\r\n\r\n[OSEN=정준화 기자] The one for whom YG Entertainment (“YG”)’s “WHO’S NEXT” teaser image was unveiled is CL.\r\n\r\nOn August 17 at 10AM, YG posted a poster titled “CL – FIRST SINGLE LIFTED” on the company’s official blog (www.yg-life.com). The poster says that CL will unveil “LIFTED”, her first single album in the United States, on the 19 this month. It is CL’s first official single album in the United States. The title “LIFTED” means “excited, upbeat feeling”.\r\n\r\nOn August 16, YG unveiled a “WHO’S NEXT?” teaser image, to draw keen attention for who the next artist to release a new song following BLACKPINK’s debut will be. Music fans were keenly curious about who the next YG artist to come back or launch a new project will be. Now, as the artist is found to be CL, music fans are expressing big anticipation for her new song.\r\n\r\nLast year, CL met global fans in “MDBP” (Mad Decent Block Party), a large-scale music festival of famous DJ Diplo’s lable “Mad Decent”.\r\n\r\n“HELLO BITCHES”, the pre-promotion song for CL’s debut in the States, was loved by many music fans. The song enjoyed big popularity in and out of the country, for its bouncy beat, catchy sound, and witty lyrics, taking No.1 on global music-streaming website “Sportify”. Such big popularity proved CL’s influence not only in Asia but also in the United States, the birthplace of pop music.\r\n\r\nMany music fans are paying keen attention to what kind of new music CL will present, as she has always caught eyes with her flagship energy, charisma, and intense force.\r\n\r\n2016. 8. 17.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/201608171004777291_57b3b83c91bda_99_20160817100604.jpg","thumb_2x1":false,"thumb_3x2":false},"881":{"id":881,"post_title":"BLACKPINK, YG’s monstrous rookie setting new records in shortest period of time from debut","url_friendly_name":"blackpink-ygs-monstrous-rookie-setting-new-records-in-shortest-period-of-time-from-debut","excerpt":"","post_content":"[헤럴드경제=고승희 기자]  It is an unprecedentedly successful debut. “Monstrous rookie” BLACKPINK has become one of the three top girl groups in Korea, upon their debut, along with TWICE and GFRIEND.\r\n\r\nBLACKPINK is YG’s first new girl group in seven years since 2NE1. YG’s new girl group has been drawing keen attention since the company’s announcement in May that a new girl group would be launched soon. The rookie YG girl group that had yet to make debut drew keen interest from the public, for the number of the members and profile of each member.\r\n\r\nYG Entertainment unveiled debut teaser images of each member starting from JENNIE every week from June 1. Teaser images of LISA were unveiled on June 8, JISOO on June 15, and ROSÉ on June 22. Then, on June 29, group photos of all BLACKPINK members were unveiled. Pre-promotion before official debut was perfect. Every time each member was unveiled, BLACKPINK created sensation. Because of such promotion, BLACKPINK built recognition during the whole month. BLACKPINK was originally supposed to debut in July, but they actually made debut in a debut showcase on August 8. The four members of BLACKPINK are 19 years old on average. They were hard-trained by YG for four to six years. After numerous speculations and predictions for the new girl gorup of YG for years, BLACKPINK has been finally born.\r\n\r\n\r\n\r\nAt BLACKPINK’s debut showcase, YANG HYUN SUK said, “A few years ago, I once said that I wanted to make a girl group whose members are pretty and talented at the same time. It took a long time for me to create BLACKPINK who perfectly suits the concept. Rather than focusing on differentiation from other girl groups including 2NE1, I tried to create a team that has its own unique style that best-expresses YG’s color”. \r\n\r\nWhen BLACKPINK’s debut song was unveiled after the showcase at 8PM on the same day, it took No.1 on four music-streaming websites. The music video released on the same day surpassed three million views within three hours of release.\r\n\r\nBLACKPINK is showing substantial influence even on Billboard chart.\r\n\r\nAmerican Billboard extolled BLACKPINK on the 16 this month (local time), saying, “Blackpink is less than a month old, but the new girl group is already making major moves on the Billboard charts with their debut… Blackpink is only the seventh K-pop act to hit No. 1 on World Digital Songs. The group now joins the company of PSY (who has four No. 1s on the chart), BIGBANG (with three) plus 2NE1, EXO, CL, BTS, plus G-Dragon and Taeyang (all with one). Nevertheless, Blackpink is the fastest act to hit No. 1 on the chart, and only the third to hold the top two positions after PSY and BIGBANG.”\r\n\r\n“BOOMBAYAH” and “WHISTLE”, the double title tracks of BLACKPINK’s debut single album “SQUARE ONE”, took No.1 and No.2 on American Billboard’s World Digital Songs chart, respectively. “WHISTLE” became the first K-pop song that topped American iTunes chart and worldwide chart at the same time within two days of release.\r\n\r\nThe music videos of the two songs surpassed 10 million views on YouTube within five days of release. On the 10th day from release, on August 18, the video of “WHISTLE” is recording 13,790,000 views and “BOOMBAYAH”, 15,960,000 views.\r\n\r\n2016. 8. 18.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/26217416_99_20160828100703.jpg","thumb_2x1":false,"thumb_3x2":false},"879":{"id":879,"post_title":"YG posted happy birthday image for G-DRAGON… Tomorrow is 10th anniversary of BIGBANG’s debut","url_friendly_name":"yg-posted-happy-birthday-image-for-g-dragon-tomorrow-is-10th-anniversary-of-bigbangs-debut","excerpt":"","post_content":"\r\n\r\n[OSEN=정준화 기자] YG Entertainment (“YG”) unveiled a happy birthday image for G-DRAGON on August 18.\r\n\r\nThe image unveiled on August 18 at 0AM on YG’s official blog (www.yg-life.com) shows G-DRAGON making a cute smiling facial expression with his two hands covering his face. The image also says, “HAPPY BIRTHDAY G-DRAGON”.\r\n\r\nOther musicians are also giving happy birthday messages to G-DRAGON.\r\n\r\nTAEYANG who has always been together with G-DRAGON from long ago posted a photo he took with G-DRAGON when they were children, on his social media account. With the photo, TAEYANG sent a message full of affection for G-DRAGON, “Happy birthday, my one and only friend Ji-yong”. T.O.P also posted a photo in which he is holding a birthday cake in a neat suit, saying, “Happy birthday my brother”.\r\n\r\nKUSH unveiled a photo in which little boy G-DRAGON is wearing a tutu, with a happy birthday message.\r\n\r\nJINUSEAN’s SEAN posted an image of little G-DRAGON in a music video in which he performed with little boy G-DRAGON, saying, “Happy Birthday G-dragon! Have a happy day Ji-yong. Happy birthday~”\r\n\r\nAfter his birthday on August 18, BIGBANG celebrates the 10th anniversary of their debut on August 19.\r\n\r\nIn the meantime, BIGBANG will hold 10th anniversary concert “BIGBANG10 THE CONCERT : 0.TO.10” on August 20 at Sangam World Cup Stadium in Seoul.\r\n\r\n2016. 8. 18.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/201608180803775530_57b4edb32b1ba_99_20160818080604.jpg","thumb_2x1":false,"thumb_3x2":false},"878":{"id":878,"post_title":"BLACKPINK unveiled “WHISTLE”s dance practice video… Overwhelming performance","url_friendly_name":"blackpink-unveiled-whistles-dance-practice-video-overwhelming-performance","excerpt":"","post_content":"\r\n\r\n[일간스포츠=박정선 기자] Girl group BLACKPINK is drawing keen attention, unveiling “WHISTLE”s dance practice video.\r\n\r\nOn August 18 at 10AM, YG Entertainment released a dance practice video of “WHISTLE”, one of the double title tracks of BLACKPINK’s debut album, on YG’s official blog (www.yg-life.com) and NAVER TV CAST.\r\n\r\nIn the video, the members of BLACKPINK appear in comfortable but unique outfits. Then, they present eye-catching dance to “WHISTLE”, a minimal hip-hop song with a dreamy and sexy mood. With the sophisticated and disciplined dance, the members boast their sexy and chic appeals. Their group dance in a perfect order leaves a big impression.\r\n\r\nThe choreography for “WHISTLE” was created by four famous foreign choreographers including world’s top choreographer Jonte who created the dance for Beyonce’s “Single Ladies”. Out of the dances created by them, YG’s head producer YANG HYUN SUK cherry-picked good ones directly, to complete “WHISTLE”s dance. As it was worked on by world’s top choreographers, “WHISTLE”s choreography boasts perfect quality.\r\n\r\nBLACKPINK already drew keen attention when they unveiled the first dance practice video in July, before their official debut. Then, on the 14 this month, BLACKPINK created sensation by presenting overwhelming debut performances in SBS “INKIGAYO”.\r\n\r\nAs BLACKPINK’s intense and eye-catching charms that trigger crush on many people have been the focus of the music scene these days, the new dance practice video is also expected to draw big attention.\r\n\r\nIn the meantime, BLACKPINK swept No.1 of music-streaming websites in Korea, including their real-time charts, daily charts, and weekly charts, upon their debut. The team is continuing to create sensation in the music scene, setting unprecedented new records such as No.1 on iTunes charts of 14 countries, as well as No.1 and No.2 on American Billboard’s World Digital Songs chart.\r\n\r\n2016. 8. 18.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/2016082001002091700159801_99_20160819144604.jpg","thumb_2x1":false,"thumb_3x2":false},"877":{"id":877,"post_title":"CL Samples Wu- Tang Clan’s “Method Man” in Her New Single “LIFTED”","url_friendly_name":"cl-samples-wu-tang-clans-method-man-in-her-new-single-lifted","excerpt":"","post_content":"\r\n\r\n[스타뉴스=문완식 기자] The official writing credits of CL’s first US single “LIFTED” have been released.\r\n\r\nAt 4 PM on August 18, YG Entertainment uploaded a poster featuring CL standing on clouds and the writing credits of CL’s new single “LIFTED” on its official blog.\r\n\r\n“LIFTED” is produced by TEDDY and co-written by TEDDY, CL, and American rapper Asher Roth.\r\n\r\nThe song contains interpolations of “Method Man”, a song by the legendary ‘90s hip-hop group Wu- Tang Clan.\r\n\r\n“Method Man” is a track in Wu- Tang Clan’s debut album “Enter the Wu-Tang (36 Chambers)” and was chosen as one of the 100 Best Rap Singles by The Source.\r\n\r\nTEDDY, who has liked Wu- Tang Clan since he was a child, took parts of “Method Man” and used it in “LIFTED”. The original version is sung by a male rapper, but CL added a sexy and mystical feel to it.\r\n\r\nCL met Method Man in person and played “LIFTED” to him, and it is said that he liked the song very much.\r\n\r\nThe word “lifted” is used as the title of the song to mean “feeling upbeat and high”. Although CL has released “HELLO BITCHES” in the US last year as a promotion single, “LIFTED” is her first official US single, so she has put a lot of work into it.\r\n\r\nCL is seeking to sweep not only Korea and Asia but also the whole world with this song.\r\n\r\nLast year, CL received much spotlight by featuring on DJ Diplo’s “Doctor Pepper” and releasing “HELLO BITCHES”. She received favorable reviews from global media outlets, such as Billboards, Fuse TV, Complex, Teen Vogue, The Guardian, and Hype Track, and they all showed great interest in her US debut.\r\n\r\nExpectations are running high for her US debut and, with the release of a new single, CL will no doubt receive much media attention again.\r\n\r\nMeanwhile, CL’s new single “LIFTED” will be released on August 19 (12 AM KST, 8AM PST, 11AM EST).\r\n\r\n2016. 8. 18.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/2016082801002813900215141_99_20160827150504.jpg","thumb_2x1":false,"thumb_3x2":false},"875":{"id":875,"post_title":"Countdown to the Release of CL’s New Single “LIFTED” Has Begun","url_friendly_name":"countdown-to-the-release-of-cls-new-single-lifted-has-begun","excerpt":"","post_content":"\r\n\r\n[일간스포츠=박정선 기자] CL is to release her new single “LIFTED” at 12 AM on August 18.\r\n\r\nCL’s agency YG Entertainment uploaded a poster featuring the countdown timer to the release of her new single on its official blog, raising the expectations for her new song.\r\n\r\nThere are two CLs in the poster, CL in white and CL in black. She looks seductive and sexy, making the fans anticipate her new song even more.\r\n\r\n“LIFTED” is sung in English, so it will not be released on Korea’s music streaming websites. However, you can listen to the song on Apple Music. The song will also be released on iTunes, Google Play, and Spotify.\r\n\r\nThe word “lifted” is used as the title of the song to mean “feeling upbeat and high”. Although CL has released “HELLO BITCHES” in the US last year as a promotion single, “LIFTED” is her first official US single. CL is seeking to sweep not only Korea and Asia but also the whole world with this song.\r\n\r\nLast year, CL received much spotlight by featuring on DJ Diplo’s “Doctor Pepper” and releasing “HELLO BITCHES”. She received favorable reviews from global media outlets, such as Billboards, Fuse TV, Complex, Teen Vogue, The Guardian, and Hype Track, and they all showed great interest in her US debut. Expectations are running high for her US debut and, with the release of a new single, CL will no doubt receive much media attention again.\r\n\r\n2016. 8. 18.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/htm_2016081818259286729_99_20160818180408.jpg","thumb_2x1":false,"thumb_3x2":false},"874":{"id":874,"post_title":"Director of Jay Z’s Music Videos Also Made CL’s “LIFTED” MV","url_friendly_name":"director-of-jay-zs-music-videos-also-made-cls-lifted-mv","excerpt":"","post_content":"\r\n\r\n[일간스포츠=박정선 기자] Top artists have participated in making CL’s first US single.\r\n\r\nCL is to release her new single “LIFTED” at 12 AM on August 18. Wu- Tang Clan’s Method Man and Dave Meyers took part in making her new song.\r\n\r\nDave Meyers is a world-renowned director who made numerous music videos for top singers including Janet Jackson, Jay Z, Missy Elliot, and Justin Bieber. He received the best music video award at the 48th Grammy Awards for the music video of Missy Elliot’s “Lose Control”.\r\n\r\nHe also made music videos for Rihanna’s “Where Have You Been”, Katie Perry’s “Firework”, Justin Bieber’s “Somebody to Love”, and Fergie’s “Glamorous”.\r\n\r\nMethod Man also played a key role in CL’s new song. He is a member of the legendary hip-hop group Wu- Tang Clan, and the group named a song in their debut album after him. CL sampled parts of the song in “LIFTED”. Method Man appears as a cameo in the music video to show his support for CL.\r\n\r\nThe word “lifted” is used as the title of the song to mean “feeling upbeat and high”. Although CL has released “HELLO BITCHES” in the US last year as a promotion single, “LIFTED” is her first official US single. She is seeking to sweep not only Korea and Asia but also the whole world with this song.\r\n\r\nMeanwhile, CL’s new single “LIFTED” will be released on August 19 (12 AM KST, 8AM PST, 11AM EST).\r\n\r\n2016. 8. 18.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/2016082801002813900215141_99_20160827150504.jpg","thumb_2x1":false,"thumb_3x2":false},"872":{"id":872,"post_title":"[BIGBANG 10th Anniversary ①] Steadily 10 years already… BIGBANG’s existence itself is the role model","url_friendly_name":"bigbang-10th-anniversary-%e2%91%a0-steadily-10-years-already-bigbangs-existence-itself-is-the-role-model","excerpt":"","post_content":"\r\n\r\n[일간스포츠=이미현 기자] August 19, 2006. BIGBANG was launched with full potential and big expectations from music fans. For the past 10 years since then, BIGBANG has taken No.1 for every song they released, always staying at the center of interest and spotlight. Now, BIGBANG is an unmatched idol boy group that does not need any further explanation.\r\n\r\nBIGBANG is at the center of interest overseas as well. Foreign media outlets spotlight BIGBANG’s new songs. BIGBANG holds tour concerts not only in Asia but also in America and Europe. In 2011, BIGBANG received “MTV Europe Music Awards” for the first time for a Korean artist. Last year, American New York Times extolled BIGBANG’s concert, saying, “Boy bands were created in the United States like automobiles, but they were completed in somewhere else”.\r\n\r\nIt is only natural for BIGBANG to get such big congratulations for the 10th anniversary of their debut. Most idol boy groups broke before their 7th anniversary, failing to overcome the “7th year jinx”. One or two members of many boy bands came to stand out than others and the gap between their careers grew bigger. In the process, some of those teams’ members broke away from the teams, members changed, and some even tentatively retired. However, BIGBANG has survived through such environment. SHINHWA is the only idol boy group in Korea who has maintained the team for more than 10 years, other than BIGBANG. You can see how meaningful and great BIGBANG’s 10th anniversary is.\r\n\r\n\r\nBIGBANG had some crisis, too. Nevertheless, BIGBANG’s teamwork grew even stronger in the process of overcoming them. In the 10th anniversary exhibition “BIGBANG10 THE EXHIBITION :A TO Z”, T.O.P said, “We have never fought so far”.\r\n\r\nG-DRAGON said, “There have been a lot of good things, as well as bad things. The most memorable time was when I was a trainee. Since BIGBANG’s debut, we have been greatly loved, working in a very good environment. If it were not for those days of hard training, BIGBANG today would not have existed”.\r\n\r\nTAEYANG explained, “We’ve changed in a good way, filling each other’s gaps and leading each other. We have grown older year after year, taking care of each other and maintaining good relationship”.\r\n\r\nThe existence of 10-year-long boy group is a firm role model for junior boy groups. Such big expectations for BIGBANG may be burdensome for them, but BIGBANG is drawing a bigger picture.\r\n\r\nG-DRAGON said, “The biggest issue for us recently is what our next step will be. We’ve been so much loved by many people, but at the same time, we’ve gone through many things and overcome them. As we have been doing so far, we’ll keep living with this tension. As more people recognize us and love us, we sometimes feel burdened. Just creating good music is not enough. We want to give good influence to young generations in and out of the country”.\r\n\r\nSuch remarks are the proof of even more promising next 10 years for BIGBANG than their past 10 years.\r\n\r\n2016. 8. 19.\r\n\r\n","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/htm_2016081901332919437_99_20160819065106.jpg","thumb_2x1":false,"thumb_3x2":false},"870":{"id":870,"post_title":"[BIGBANG 10th Anniversary ①] From “real documentary” to “MADE” series… The history of BIGBANG’s past 10 years","url_friendly_name":"bigbang-10th-anniversary-%e2%91%a0-from-real-documentary-to-made-series-the-history-of-bigbangs-past-10-years","excerpt":"","post_content":"[헤럴드POP=노윤정 기자] Boys who fascinated audience on the stage have now become a brand, BIGBANG. The boy group who is recognized not only in Korea but also throughout the world now celebrates the 10th anniversary of their debut.\r\n\r\n\r\n\r\nBIGBANG is a boy group formed in real documentary TV show “Real-docu BIGBANG” aired in 2006 on MTV Korea. The documentary depicted the process of BIGBANG’s debut, making BIGBANG members get familiar to the public even before their debut album’s release. BIGBANG members had to win in the survival audition, where five out of six were given the opportunity to debut as BIGBANG. The five winners who managed to survive in the competition took their first step into the music scene in YG Family’s 10th anniversary concert held on August 19 in 2006 at Seoul Olympic Gymnastics Arena.  \r\n\r\nBIGBANG became famous upon their debut, with hit songs such as “We Belong Together” and “La La La”. From their very debut, BIGBANG members actively participated in production of their album, writing the melody and lyrics for their songs. That was how BIGBANG was different from “cookie-cutter” idol boy groups of other music labels. Indeed, “We Belong Together”s melody and lyrics were written by G-DRAGON, with help from T.O.P for the lyrics. All the members wrote the lyrics of “La La La” together.\r\n\r\nSince their debut, BIGBANG members have played leading role in making their own music and performances, to enjoy big popularity from music fans for their unique color. Notably, G-DRAGON’s producing greatly contributed to maintenance of BIGBANG’s special color. Along with G-DRAGON’s growth as an artist, the quality of BIGBANG’s albums has also grown. BIGBANG’s hit songs such as “V.I.P”, “DIRTY CASH”, “LIES”, “HARU HARU”, “LAST FAREWELL”, “FANTASTIC BABY”, “STILL ALIVE”, and “MONSTER” were all born from G-DRAGON and the other members of BIGBANG.\r\n\r\nNotably, “LIES” recorded mega-hit, making BIGBANG the top idol group in Korea. BIGBANG received their first No.1 trophy in a TV music show for the song and swept trophies in music awards at the end of that year. Every song released since then recorded big hit. On the basis of the remarkable success of BIGBANG, each member performed as solo artists and in unit teams, giving even bigger fame to BIGBANG.\r\n\r\n\r\n\r\nBIGBANG was away from the music scene for three years since “STILL ALIVE” album. BIGBANG’s potential was proven once again when they made comeback after three years of hiatus. Last year, BIGBANG carried out “MADE” project in which they released one single every month for fans who had been longing for BIGBANG’s music. The project was a great success. Single “M”, “A”, “D”, and “E” released from May to August last year all swept top places on charts and TV music shows. All songs in those albums including “LOSER”, “BAE BAE”, “BANG BANG BANG”, “IF YOU”, “SOBER”, “ZUTTER” (GD&amp;T.O.P), and “LET’S NOT FALL IN LOVE” created sensation and BIGBANG swept trophies in music awards at the end of last year. Notably, “BANG BANG BANG” and “LOSER” surpassed 100 million views on video-streaming website “YouTube”, following “FANTASTIC BABY” and “GOOD BOY”. With the record, BIGBANG became the first Korean boy group who has four music videos that have reached the 100 million view mark on YouTube. \r\n\r\nThe reason why BIGBANG is recognized is not just because of the large number of their hit songs and trophies they have received. Other than Korea’s longest-lived boy group SHINHWA, BIGBANG is the only idol boy group in Korea who has performed for more than 10 years without any change in the members. That enhances BIGBANG’s value even further.\r\n\r\nBIGBANG is not just a long-lived idol boy group. The name BIGBANG has enormous influence. Last year, BIGBANG held world tour “MADE” in 32 cities of 13 countries. Total 66 concerts were held in the tour and more than one and a half million people went to the concerts. A concert held at LA Staples Center in the United States was included in the list of “world’s top 10 highest-earning concerts” selected by Billboard (total 13,361 entrances, $1,715,587\/$1,940,000,000 of ticket revenues).\r\n\r\nPlus, BIGBANG has recently been appointed as “CREATIVE ICON” selected by the Ministry of Culture, Sports, and Tourism to promote Korea’s new national brand “CREATIVE KOREA” throughout the world. BIGBANG will work as the PR ambassador for “CREATIVE KOREA” until the PyeongChang Winter Olympic Games in 2018. BIGBANG’s appointment as “CREATIVE ICON” is the proof of BIGBANG’s big influence on people of all age groups in the entire world.\r\n\r\nAfter their constant growth for the past 10 years since debut, BIGBANG is now celebrating the 10th anniversary of their debut. BIGBANG has recently been celebrating the 10th anniversary with fans in documentary movie, exhibition, and concerts. As BIGBANG is still the top idol boy group in Korea in the 10th year of their debut, constantly writing new history in music, it will be worthwhile to look forward to their next 10 years.\r\n\r\n2016. 8. 19.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/201608190006386661931_20160819001231_01_99_20160819064107.jpg","thumb_2x1":false,"thumb_3x2":false},"868":{"id":868,"post_title":"[New Songs is] CL to make debut in the United States soon boasts sexy swag… Groove ↑","url_friendly_name":"new-songs-is-cl-to-make-debut-in-the-united-states-soon-boasts-sexy-swag-groove-%e2%86%91","excerpt":"","post_content":"\r\n\r\n\r\n[일간스포츠=황미현 기자] Group 2NE1’s CL unveiled the first single for her official debut in the United States. The groovy hip-hop song makes listeners move their shoulders up and down to the rhythm.\r\n\r\nCL released her first official singe “LIFTED” for her debut in the United States, on August 19 at 0AM in Korean time.\r\n\r\nCL transformed familiar “Method Man” in her unique style. “LIFTED” of a familiar but fresh feel boasts catchy sound based on CL’s unique voice and groovy feel.\r\n\r\nA music video released with the song also catches eyes, displaying CL’s sex appeal. CL in a revealing outfit does wave dance and naturally mingles with local people, leaving a big impression. CL appears in the video in comfortable but sexy clothes, giving viewers bigger fun to see her different styling.\r\n\r\nCL presents catchy dance with two men against river in one scene, then on clouds in the sky of a city in another.\r\n\r\nThe music video of CL’s “LIFTED” was helped by famous artists. Dave Meyers who received the best music video award of the 48th Grammy Awards directed CL’s music video. At that time, Dave Meyers directed the music video of Missy Elliot’s “Lose Control”. He has also directed music videos of Janet Jackson, Jay-Z, Missy Elliot, Justin Bieber, and other famous pop singers.\r\n\r\nPlus, Wu-Tang Clan’s member Method Man appears in CL’s music video as a cameo actor, to draw big attention.\r\n\r\n“LIFTED” was produced by YG’s TEDDY and the song’s lyrics were written jointly by CL, TEDDY, and American rapper Asher Roth. Part “Method Man” by Wu-Tang Clan, a legendary hip-hop group in New York in the 1990’s, was applied to “LIFTED” in sampling.\r\n\r\nCL’s new song will be released on August 18 at 8AM in western America and at 11 on the same day in eastern America. In Korea, the song was released on Apple Music and overseas, it was released on Apple Music, iTunes, Google Play, Sportify, AMAZON, DEEZER, QQ Music , etc.\r\n\r\n2016. 8. 19.\r\n","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/htm_2016081901627537567_99_20160819001804.jpg","thumb_2x1":false,"thumb_3x2":false},"865":{"id":865,"post_title":"[BIGBANG 10 Years] Going beyond limits for idol singer, to become the idol of idol singers","url_friendly_name":"bigbang-10-years-going-beyond-limits-for-idol-singer-to-become-the-idol-of-idol-singers","excerpt":"","post_content":"[매일경제 스타투데이=한인구 기자] BIGBANG (G-DRAGON, T.O.P, TAEYANG, DAESUNG, and SEUNGRI) who debuted on August 19, 2006, celebrates the 10th anniversary of their debut today. The teenaged boys have now become men in their late 20s and they stayed in top of the music scene for 10 years. During that time, numerous boy bands have appeared, shone, and disappeared. However, BIGBANG has established themselves as the idol of idol singers, firmly maintaining their own color.\r\n\r\nJust as the name “bigbang” suggests, BIGBANG has created sensation for every step they took forward. YG Entertainment recruited trainees to find out talents in singing and dancing, as well as a variety of field. G-DRAGON, T.O.P, TAEYANG, DAESUNG, and SEUNGRI were selected as the members of BIGBANG, after winning a survival audition.\r\n\r\nBIGBANG gave their first performance on the stage of YG Family’s 10th anniversary concert held in 2006 at Seoul Olympic Gymnastics Arena. Then, they released first single album “La La La” and then second single album “BigBang Is V.I.P”. In December that year, BIGBANG released their first full album and held first concert.\r\n\r\nThe time when BIGBANG ‘s success became more striking was when “LIES” and “LAST FAREWELL” included in their first mini-album made big hit in 2007. The two songs stayed in No.1 on music charts for seven and eight weeks, respectively, enjoying popularity from fans and music lovers of a wide range of age groups. That year, BIGBANG received best male group award and song of the year award in Mnet’s KM Music Festival.\r\n\r\nAfter their debut in Korea, BIGBANG also made debut in Japan. Then, each member began to perform as solo artists, from 2008. TAEYANG released “Only Look At Me” to get recognized for good performance and singing. Then, he released “HARU HARU” and “Sunset Glow” remade from Lee Munse’s song, to become top idol boy band.\r\n\r\nBIGBANG has the root of their music in the hip-hop genre polished by YG so far, but they transplanted popular melody in it. In early days of BIGBANG’s debut, YG’s planning and production exerted big influence on the direction of BIGBANG’s music and performance, but as BIGBANG members themselves took part in their own members more and more, BIGBANG’s unique color was added to the team’s music and performances.\r\n\r\n\r\n\r\nG-DRAGON presented trendy music that went well with his fashion, in his first solo album “Heartbreaker” released in 2009. TAEYANG released his solo track “Wedding Dress” and T.O.P, DAESUNG, and SEUNGRI displayed their talent in TV dramas, musicals, and TV shows. The success of BIGBANG made each member of the team spread their wings in a variety of fields.\r\n\r\nBIGBANG held concerts overseas and swept music awards. Then, in 2011, BIGBANG released their fourth mini-album “Tonight”. That year, BIGBANG made big success with their music, but DAESUNG got involved in a car accident and a scandal of G-DRAGON’s weed smoking emerged, to become a topic of gossips.\r\n\r\nThat crisis could have led to a slump. However, fifth mini album “Alive” released in 2012 gave BIGBANG an opportunity for a new leap forward. As BIGBANG said “All the six songs in the album are title tracks”, “BLUE”, ‘BAD BOY”, and “FANTASTIC BABY” boasted perfect quality. The album made a record hit, taking the 150th place on “Billboard 200”, American Billboard’s main albums chart.\r\n\r\nBIGBANG members concentrated on their solo careers again in 2013. DAESUNG released his first full album in Japan and SEUNGRI released his second solo mini-album. G-DRAGON released second full album “COUP D’ETAT” and TAEYANG released his second full album “RISE”. T.O.P appeared in movie “The Commitment” and released digital single album “DOOM DADA”.\r\n\r\nIn celebration of the fifth anniversary of their debut in Japan, BIGBANG held five dome tours in the country, to attract total 741,000 fans to 15 concerts of the tours in five cities. BIGBANG held seven concerts at Osaka Kyocera Dome, setting the record of the longest period of concert at dome by a foreign artist.\r\n\r\nLast year, BIGBANG announced news of their new release, and then carried out “M.A.D.E” project, releasing a single album every month from May to August. During the period, “LOSER”, “BAE BAE”, “BANG BANG BANG”, “IF YOU”, and other songs of “M.A.D.E” albums took No.1 on music charts.\r\n\r\nBIGBANG released documentary film “BIGBANG MADE” that showed BIGBANG’s performances in tour and their daily lives, in celebration of the 10th anniversary of debut. Then, exhibition “BIGBANG EXHIBITION A to Z” was held. Now, on August 20, a concert for celebration of the 10th anniversary of BIGBANG’s debut will be held, to spend the meaningful day with fans.\r\n\r\n\r\n\r\n2016. 8. 19.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/20160818_3048162_1471566786_99_20160819112903.jpg","thumb_2x1":false,"thumb_3x2":false},"864":{"id":864,"post_title":"[People is] BLACKPINK got 10 proposals for modeling for TV commercials within 10 days of debut… “Creating sensation”","url_friendly_name":"people-is-blackpink-got-10-proposals-for-modeling-for-tv-commercials-within-10-days-of-debut-creating-sensation","excerpt":"","post_content":"\r\n\r\n\r\n[일간스포츠=황미현 기자] Group BLACKPINK has received more than 10 proposals for modeling in TV commercials, within 10 days of their debut. It is an unprecedented record for a rookie artist.\r\n\r\nAccording to advertisement industry’s insiders on August 19, BLACKPINK has received more than 10 proposals for modeling in TV commercials within 10 days of their debut, for their pretty appearance and stylish image. Most of the proposals are from sports and clothing brands. It is a very rare case for a rookie artist who has just debuted to draw big attention in the TV commercial industry like BLACKPINK. Such situation is proving the big potential of BLACKPINK armed with outstanding beauty and talent once again.\r\n\r\nCurrently, BLACKPINK is carefully thinking about for what TV commercials they will sign contract. Rather than accepting all the proposals, BLACKPINK is trying to select ones that suit their image. BLACKPINK has already signed contracts for two commercials and will keep discussing on the rest of commercials as well.\r\n\r\nInsiders said, “Even though BLACKPINK is a rookie artist, the unprecedented records set by them since their debut have firmly established BLACKPINK’s good image. Their pretty look and unique sense of style are drawing big attention from the advertisement industry”.\r\n\r\nBLACKPINK made official debut on August 8. Upon the release of their debut songs, BLACKPINK swept all music charts, showing enormous potential as a “monstrous rookie”. “WHISTLE” and “BOOMBAYAH”, the double title tracks of BLACKPINK’s debut album, are recording 14,447,441 views and 16,826,103 views on YouTube, respectively, as of August 19. In total, BLACKPINK’s music videos are recording 31,273,544 views together, writing an unprecedented record for a rookie artist. The two songs took No.1 and No.2 on the K-pop weekly chart of China’s biggest music-streaming website QQ Music. BLACKPINK took No.1 on iTunes charts of 14 countries and No.1 and No.2 on American Billboard’s World Digital Songs chart.\r\n\r\n2016. 8. 19.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/htm_2016082092916546801_99_20160820093004.jpg","thumb_2x1":false,"thumb_3x2":false},"862":{"id":862,"post_title":"[M+BIGBANG 10th Anniversary ①] From dreaming trainees to the role model for other idol groups","url_friendly_name":"mbigbang-10th-anniversary-%e2%91%a0-from-dreaming-trainees-to-the-role-model-for-other-idol-groups","excerpt":"","post_content":"[MBN스타=남우정 기자] Boys whose sole goal was debut have now grown into musicians who lead K-pop.\r\n\r\nOn August 19, BIGBANG celebrates the 10th anniversary of their debut. Ten years ago, YG Entertainment (“YG”) selected the members of new idol group BIGBANG through survival audition show Mnet “Real-docu BIGBANG”. Such format of TV shows is common these days, but back then, there was no TV show that revealed the whole process of production of an idol group. BIGBANG drew big attention as the first idol boy group of YG and the TV show recorded more than million views.\r\n\r\n\r\n\r\n“Real-docu BIGBANG” left a big impression to the public as the first-ever survival audition show and it also became an unforgettable memory for BIGBANG members. In a press meeting of “A to Z” exhibition held in celebration of the 10thanniversary of BIGBANG’s debut, G-DRAGON said, “The best thing I’ve ever done in my life was my refusal to go home when Mr. YANG told me to go home. Another was when SEUNGRI explained the reason why he had to join BIGBANG”, making viewers burst into laughter.\r\n\r\nBIGBANG who had a sole purpose of debut back then has now become the role model for Korean idol groups, and they have established themselves as the center of K-pop, being recognized globally. In Korea’s music scene, BIGBANG has always at the center of interest.\r\n\r\nFirst, BIGBANG suggested a new direction for idol groups that had been planned in a strict framework of music labels. Starting from G-DRAGON, BIGBANG members wrote their own songs for albums from the very debut, setting a good model for idol producers. The reason why many idol singers now are boasting their capabilities as producers such as in the case of Block-B’s ZICO, Jinyoung of B1A4, Jung Yong-hwa of CNBLUE, BTS, and Woozi of Seventeen is all attributable to BIGBANG’s trial.\r\n\r\nBIGBANG also showed the fact that even for a team, each member’s capabilities are important. Exceptionally for an idol group, all the members of BIGBANG released solo albums and those solo albums showed new music totally different from team BIGBANG’s music. TAEYANG presented R&amp;B that best-suits his voice, and T.O.P presented more powerful and intense rap as a solo artist. DAESUNG tried trot, the genre of adult pop with a little color of Korean traditional music, which was a very rare case for an idol singer. G-DRAGON presented more experimental music in his solo albums.\r\n\r\n\r\n\r\nBIGBANG also proved the fact that an idol group can be split into different unit teams, not just into individual solo artists. GD&amp;T.O.P unit team of rappers and the unit team of GD&amp;TAEYANG who are also closest friends, have created bigger sensation.\r\n\r\nBIGBANG went beyond the music scene and has become the icon of fashion, leading trends. BIGBANG members are not typical handsome guys, but they have unique style and sense of fashion and they have always tried new styles. The items that BIGBANG wore for “LIES” released in 2007 including high-top sneakers, bandanas, and caps created sensation as “it” fashion items. Ever since then, BIGBANG has always presented experimental styles. Notably, G-DRAGON emerged as a fashionista, being recognized as a celebrity not only in Korea but also globally. World-famous luxury brand Louis Vuitton invested in YG, which well-demonstrates BIGBANG’s enormous potential in the fashion world.\r\n\r\n\r\n\r\nBIGBANG is now the icon that represents Korea. BIGBANG has recently been appointed as the PR ambassador for Korea’s new national brand “CREATIVE KOREA”. BIGBANG will work as the PR ambassador from the 2016 Rio Olympics until the 2018 PyeongChang Winter Olympic Games.\r\n\r\nMost of all, it is hard to find any other idol groups than SHINHWA and BIGBANG who have maintained the team for more than 10 years. Plus, BIGBANG has worked with the same company for those 10 years. There have been some scandals for the 10 years including suspicion that G-DRAGON smoked weed and car accidents of DAESUNG and SEUNGRI, but still, BIGBANG maintained the team and stayed in the top place. That shows how exceptionally meaningful BIGBANG is in Korea’s music scene.\r\n\r\n2016. 8. 19.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/822600810100_99_20160819100309.jpg","thumb_2x1":false,"thumb_3x2":false},"860":{"id":860,"post_title":"[Entertainment History] Looking Back on the Past 10 Years of BIGBANG, Who Transformed From Teenagers to Global Stars","url_friendly_name":"entertainment-history-looking-back-on-the-past-10-years-of-bigbang-who-transformed-from-teenagers-to-global-stars","excerpt":"","post_content":"\r\n\r\n[일간스포츠=황미현 기자] BIGBANG debuted with “WE BELONG TOGETHER” and “LALALA” in 2006, and the group became a star instantly. All the songs that the group released ever since became big hits.\r\n\r\nWhen BIGBANG debuted, the members were just boys. But ten years have passed, and now they have become fashion icons and artists. Let’s take a look at the past ten years of BIGBANG, from when they released their self-titled debut album to their most recent album “MADE”.\r\n\r\n▶August 2006\r\n\r\nThis was when they released their debut album “BIGBANG”. The members are still teenagers, but their unique poses and expressions are impressive. BIGBANG’s self-titled single album sold more than 40,000 copies.\r\n\r\n\r\n\r\n▶September 2006\r\n\r\nThis was when BIGBANG released their official debut song “LA LA LA”. BIGBANG had their debut stage singing “LA LA LA” on MBC’s Show! Music Core. They look fierce with henna tattoos on their faces. The album “BIGBANG IS V.I.P”, which contains “LA LA LA”, was released in September and sold 32,000 copies.\r\n\r\n\r\n\r\n▶December 2006\r\n\r\nThis was when BIGBANG released their first regular album “BIGBANG VOL.1”. G-DRAGON himself wrote the lyrics of the album’s title track “DIRTY CASH”. The members look trendy and hip wearing their jeans down and tops with patterns. The album sold 48,000 copies.\r\n\r\n\r\n\r\n▶August 2007\r\n\r\nBIGBANG debuted exactly ten years ago from today, and their biggest hit song “LIES” is climbing back up on the charts. This is because “LIES” is like the signature song of BIGBANG. BIGBANG made a grand comeback with “LIES” performing the song in white costumes. “LIES” is also written and composed by G-DRAGON.\r\n\r\n\r\n\r\n▶November 2007\r\n\r\nThis was when BIGBANG released their second EP album “HOT ISSUE”. The members show off their gentle but masculine side standing at the bank of Han River during sunset with 63 Building as background. At that time, G-DRAGON brought scarves back into fashion. The title track of the album “LAST FAREWELL” was on the top of the charts for eight weeks.\r\n\r\n\r\n\r\n▶August 2008\r\n\r\nThis was when BIGBANG released their third EP album “STAND UP”. The title track of the album “HARU HARU” is co-composed by G-DRAGON and Daishi Dance, a Japanese DJ\/composer. The album sold 166,000 copies.\r\n\r\n\r\n\r\n▶November 2008\r\n\r\nBIGBANG’s “SUNSET GLOW” was and still is loved by many. The overall concept of the song was bright and lively, and BIGBANG members sang the song with big smiles on their faces, which made many people fall in love with them all over again. More than 20,000 copies of “REMEMBER”, the album that contained “SUNSET GLOW”, were sold on preorders alone. BIGBANG’s “SUNSET GLOW” is a remake of Lee Moon-se’s “SUNSET GLOW”, which was released in 1988. Usually singers sample the chorus part of the original version, but BIGBANG put their feel into the song, making it sound like a totally different song.\r\n\r\n\r\n\r\n▶February 2011\r\n\r\nThey released their fourth EP album “TONIGHT” after a two-year break. By this time, BIGBANG members no longer looked like boys but like men and became the heartthrob of many girls. The album topped the charts in just seven days after its release, and the title track of the album “TONIGHT” swept the charts upon release.\r\n\r\n\r\n\r\n▶February 2012\r\n\r\nBIGBANG released their fifth mini-album after a one-year hiatus. All the songs of the album were title tracks, which sent shockwaves across the music industry. G-DRAGON received much media attention thanks to his long side hair in the music video of “FANTASTIC BABY”. The album sold 260,000 copies on preorders alone and more than 200,000 copies in just a month. With this song, BIGBANG became no.150 on Billboard’s top 200 albums chart. It was the first time that a Korean artist made it so high on Billboard’s charts with a song sung in Korean.\r\n\r\n\r\n\r\n\r\n▶June 2012\r\n\r\nBIGBANG released a special album titled “STILL ALIVE” for their fans who were longing for their comeback. “STILL ALIVE” contains the tracks in BIGBANG’s “ALIVE” album plus four new tracks, including “MONSTER”. The album sold 100,000 copies in just a month after its release.\r\n\r\n\r\n\r\n\r\n\r\n\r\n▶May 2015\r\n\r\nIn 2015, BIGBANG released single albums every month from May to August under a project named “MADE”. Every time a new single was released, it topped the charts. As a result, BIGBANG dominated the chart for four months straight. The group has indeed written history by coming up with different styles of music and fashion every month.\r\n\r\n2016. 8. 19.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/htm_20160819115554401833_99_20160819145005.jpg","thumb_2x1":false,"thumb_3x2":false},"856":{"id":856,"post_title":"[Exclusive]YG is to Make its First Variety Show in 20 Years along with SBS","url_friendly_name":"exclusiveyg-is-to-make-its-first-variety-show-in-20-years-along-with-sbs","excerpt":"","post_content":"\r\n\r\n[일간스포츠=김진석 기자] YG Entertainment will make its own variety show.\r\n\r\nSources told Daily Sports on August 19, “YG will make its first variety show with SBS. They both wanted to make a good show and decided to do it together. Soon, viewers will be able to watch a YG-made variety show.”\r\n\r\nEstablished in 1996, YG Entertainment has produced top stars including BIGBANG, 2NE1, WINNER, iKON, and BLACKPINK, but it is the first time that it jumped into making variety shows. The entertainment industry is watching YG’s unusual move with keen interest. Some are envious that YG has grown so big that it is expanding its business to include making variety shows. YG is determined to make a new type of variety show and become an all-round entertainment company.\r\n\r\nYG celebrated its 20th anniversary in May this year. It has produced top singers such as JINUSEAN, 1TYM, BIGBANG, 2NE1, WINNER, iKON, and BLACKPINK and made PSY into a global star. Recently, it began representing not only singers but also top celebrities. CHA SEUNG WON, KANG DON WON, KIM HEE AE, CHOI JI WOO, AHN YOUNG MI, and YOO BYUNG JAE are currently signed to the company.\r\n\r\n2016. 8. 19.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/htm_20160819165728914131_99_20160819165905.jpg","thumb_2x1":false,"thumb_3x2":false},"854":{"id":854,"post_title":"BLACKPINK Becomes No.1 On China’s Biggest Online Chart and Has Been Dominating Korea’s Charts for 13 Days","url_friendly_name":"blackpink-becomes-no-1-on-chinas-biggest-online-chart-and-has-been-dominating-koreas-charts-for-13-days","excerpt":"","post_content":"\r\n[일간스포츠=이미현 기자] BLACKPINK is rocking the charts in China.\r\n\r\nAs of 9 AM on August 20, the title tracks of BLACKPINK debut album “SQUARE ONE”—“WHISTLE” and “BOOMBAYAH”—took the top two spots of QQ Music’s MV chart. QQ Music is China’s largest music streaming provider.\r\n\r\nIn Korea, BLACKPINK has also taken back the no.1 spot on the realtime charts amidst the flurry of newly released songs.\r\n\r\n“WHISTLE” is at the no.1 spot on the charts of Melon, Monkey3, Naver Music, Bugs, Soribada, and Mnet. BLACKPINK has kept the no.1 spot for 13 days as the group has succeeded in building a wide fanbase and winning the public’s love at the same time.\r\n\r\nMeanwhile, upon debut, BLACKPINK has swept the music industry by dominating all the realtime, daily, and weekly charts in Korea. They also became no.1 on the iTunes charts of 14 countries and no.1 and no.2 on Billboards’ world digital songs chart.\r\n\r\n2016. 8. 20.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/htm_2016082092916546801_99_20160820093004.jpg","thumb_2x1":false,"thumb_3x2":false},"851":{"id":851,"post_title":"[Exclusive]YG’s First Variety Show is to be “꽃놀이패”","url_friendly_name":"exclusiveygs-first-variety-show-is-to-be-%ea%bd%83%eb%86%80%ec%9d%b4%ed%8c%a8","excerpt":"","post_content":"\r\n\r\n\r\n\r\n[일간스포츠=김진석 기자] The first variety show to be made by YG Entertainment is going to be “꽃놀이패”.\r\n\r\nSources informed Daily Sports on August 20 that YG Entertainment will make “꽃놀이패” together with SBS.\r\n\r\nEarlier on, the news that YG will be making a variety show has been announced but no details have been revealed. However, we know that YG’s first variety show is going to be “꽃놀이패”. It aired as a pilot program earlier on. Six celebrities went on a three-day trip, and viewers made decisions for them via Naver’s V Live votes.\r\n\r\nWhen the pilot episode was aired, Seo Jang-hoon, Ahn Jung-whan, Jo Se-ho, YOO BYUNG JAE, Kim Min-suk, and Jung Kook were casted on the show. But due to scheduling complications, Kim Min-suk and Jung Kook will no longer be on the show, and instead, EUN JI WON and LEE JAE JIN of SECHSKIES will fill in their places.\r\n\r\nEstablished in 1996, YG has produced top stars such as BIGBANG, 2NE1, WINNER, iKON, and BLACKPINK. Now, it is determined to become an all-round entertainment company and make a creative variety show as the first step.\r\n\r\nThe first episode of “꽃놀이패” will be aired at 11 PM on September 5.\r\n\r\n2016. 8. 20.\r\n","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/htm_20160820104716121370_99_20160820104905.jpg","thumb_2x1":false,"thumb_3x2":false},"849":{"id":849,"post_title":"BIGBANG’s 10th Anniversary Concert Was Hotter Than the Heat Wave","url_friendly_name":"bigbangs-10th-anniversary-concert-was-hotter-than-the-heat-wave","excerpt":"","post_content":"\r\n\r\n[OSEN=박소영 기자] It was a concert that only BIGBANG could pull off. Fans from all around the world came to Sangam-dong to celebrate the 10th anniversary of BIGBANG. The five members of BIGBANG on the stage and 65,000 fans in the audience all shone bright like stars.\r\n\r\nAt 7 PM on August 20, “BIGBANG10 THE CONCERT: 0.TO.10” took place at the World Cup Stadium in Sangam-dong to celebrate the 10th anniversary of BIGBANG’s debut. BIGBANG debuted exactly ten years ago on August 19, and they decided to hold a large-scale concert to share the joy with their fans.\r\n\r\nA whopping 65,000 fans from in and out of Korea flocked to Sangam-dong. Originally, the concert was to hold only 60,000 people, but because there were so many requests from those who couldn’t get tickets, extra tickets for the restricted-view seats were opened for sale later on. Not only Korean fans but also fans from all around the world came to see BIGBANG on the stage.\r\n\r\n\r\n\r\n◆BIGBANG heated up the stage from the very beginning.\r\n\r\nBIGBANG kicked off the concert with “HEAVEN”. The audience went wild as soon as the concert started. BIGBANG was covered in sweat even when they were singing their first song. After “HEAVEN”, BIGBANG sang “WE LIKE TO PARTY” and “HANDS UP”. They ran about the stage trying to make eye contact with those on the second and third floor and even those in restricted-view seats.\r\n\r\nBIGBANG has been around for ten years now, and so, they had no trouble making witty introductions at the beginning of the concert. G-DRAGON introduced himself, “Hello, I’m G-DRAGON, and I’ve been leading BIGBANG for ten years now.” T.O.P said, “Your lights are making our hearts warm. Let’s rock the night away.” DAESUNG shouted out, “It’s already hot tonight. But let’s make it hotter!”\r\n\r\nAfter BIGBANG sang “BAD BOY” and “LOSER”, SEUNGRI turned into a DJ and played a medley of their hit songs. “We have so many songs that we couldn’t sing them all at a concert”, SEUNGRI explained why he prepared his special DJing performance. The medley included a number of BIGBANG’s hit songs such as “FEAR”, “LOLLIPOP”, and “STILL ALIVE” and made the audience very happy.\r\n\r\n\r\n\r\n◆BIGBANG is great together and apart.\r\n\r\nWhat followed afterwards was a thing that only BIGBANG could do. SEUNGRI performed his solo singles “LET’S TALK ABOUT LOVE” and “STRONG BABY”. DAESUNG sang “WINGS” and “LOOK AT ME GWISOON”. Then the two sang G-DRAGON’s “CROOKED” to the surprise of the audience.\r\n\r\nG-DRAGON performed “HEARTBREAKER” and “CRAYON” for his solo stage. Then he sang “HIGH HIGH” with T.O.P and “GOOD BOY” with TAEYANG. His charisma on the stage made the audience go wild and proved that he is indeed a star.\r\n\r\nThen it was T.O.P’s turn. He sang “ACT LIKE NOTHING IS WRONG” and “DOOM DADA”. Next, TAEYANG performed “EYES, NOSE, LIPS”, “LOOK AT ME ONLY”, and “RINGA LINGA”. He sang all the songs live and they were all flawless. All these performances were only possible because BIGBANG members all released solo albums.\r\n\r\n\r\n\r\n◆ A journey of the past 10 years of BIGBANG\r\n\r\nAs the concert went on, BIGBANG members and the audience began enjoying the concert as if they were one. BIGBANG sang their mega hit songs as well as their recent hit songs such as “IF YOU”, “HARU HARU”, “BANG BANG BANG”, “FANTASITC BABY” and “SOBER” and enthralled the audience.\r\n\r\nFor their closing remarks, members said, “We are trying to draw the big picture for the next ten years of BIGBANG. We hope you’ll keep on sending us your support. Once again, thank you for your support during the past ten years. We’ll keep on creating great music and putting on great performances. Thank you.”\r\n\r\nThe heat and the roar of in Sangam-dong were strong enough to be felt on the other side of the earth. For their encore stage, BIGBANG sang “LAST FAREWELL”, “SUNSET GLOW”, “LIES”, “ALWAYS”, and “BAE BAE”. During the two and a half hour concert, the five members of BIGBANG and 65,000 fans truly became one. History was written again on August 20, 2016.\r\n\r\n2016. 8. 20.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/201608202130772837_57b8538d61193_99_20160820231103.jpg","thumb_2x1":false,"thumb_3x2":false},"848":{"id":848,"post_title":"[On-site is] BIGBANG’s Words During their 10th Anniversary Concert","url_friendly_name":"on-site-is-bigbangs-words-during-their-10th-anniversary-concert","excerpt":"","post_content":"\r\n\r\n\r\n[일간스포츠=이미현 기자] BIGBANG held a concert to celebrate the 10th anniversary of their debut. They performed their songs with more passion and energy that ever. 65,000 people stood up all throughout the concert and cheered loudly even amidst the recording-breaking heat wave.\r\n\r\nSo far, BIGBANG has been holding a lot of concert outside of Korea. They must have missed doing a concert in Korea. Five months have passed since they last held a concert in Korea, which was when they did their “MADE” concert in March. As if they missed talking in their mother tongue, they chattered a lot during the concert.\r\n\r\n○…DAESUNG, who is known to be the most friendly member of BIGBANG, said hi in a rather unique way. He said, “Hello, I’m your nurungji and your cheonggukjang. Would you like to go to heaven with me?”\r\n\r\n○…SEUNGRI revealed what T.O.P said to the members. He said, “Unlike his usual self, T.O.P woke up early at 8 AM. He surprised us by messaging, ‘Don’t be late. Let’s all get there early and get ready. I really want today’s concert to go well.” SEUNGRI went on to say, “T.O.P cries a lot these days. Whenever he does that, I make fun of him by saying that female hormones are taking hold of him because he’s getting old”.\r\n\r\n○…G-DRAGON talked about how the meaning of August has changed since 2006. He said, “Before joining YG, August was just a month I was born in. But after 2006, it has become a special month during which I think about the meaning of the members and our fans a lot. I’m so happy.”\r\n\r\n○…TAEYANG thanked the staff for their hard work. He said, “We don’t do much. We make music, and we sing and dance on the stage that is already made for us. The staff members including Mr. Yang made us who we are today. Of course, our fans played the biggest part.”\r\n\r\n\r\n\r\n○…When the concert was nearing to its end, there was a short poem-making time. DAESUNG asked SEUNGRI to make a poem with “10th anniversary.” SEUNGRI made a poem that goes, “It has already been 10 years. You and I exchanged love. In Yanbian” and made rest of the members boo him. DAESUNG was asked to do the same. His poem went, “Has it been ten years already? I will remember every second, every minute, every day, and every week of it. We must be lovers. I love you” and, DAESUNG received a big applause for it.\r\n\r\n○…BIGBANG’s “MADE” movie hit the box office in June. BIGBANG promised that they would reveal a video showing SEUNGRI taking a shower if the movie scores 100,000 viewers. But unfortunately, they did not get a chance to keep the promise. Afterwards, BIGBANG announced they would reveal the video at their concert. SEUNGRI made the audience laugh by saying that they shouldn’t do it because his parents and relatives are at the concert.\r\n\r\n2016. 8. 21.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/1471701639271_1_230446_99_20160821071804.jpg","thumb_2x1":false,"thumb_3x2":false},"846":{"id":846,"post_title":"PSY Said, “What YANG HYUN SUK said ten years ago came true. BIGBANG is a great group.”","url_friendly_name":"psy-said-what-yang-hyun-suk-said-ten-years-ago-came-true-bigbang-is-a-great-group","excerpt":"","post_content":"\r\n[TV리포트=김예나 기자] PSY appeared as a guest at BIGBANG’s concert and praised BIGBANG.\r\n\r\nOn August 20, “BIGBANG10 THE CONCERT: 0.TO.10” was held at the World Cup Stadium in Sangam-dong to celebrate the 10th anniversary of BIGBANG’s debut. BIGBANG debuted exactly ten years ago on August 19, and around 65,000 fans came to celebrate the joyous occasion and see the members. The number of audience was the biggest number for a single concert in Korea.\r\n\r\nWhen part one of the concert was over, PSY appeared on the stage as a guest. He performed before the beginning of part two.\r\n\r\nPSY said, “I came here as a close friend of BIGBANG. I think this is a phenomenal concert. I heard that the number of people here at BIGBANG’s concert is the biggest number for a single concert.”\r\n\r\nHe went on to say, “It was in 2006, and it was the day when I appeared on TV to promote “CELEBRITY” for the last time. YANG HYUN SUK asked me to tell him what I think of BIGBANG’s stage. It was also the day when BIGBANG went on the stage with “LA LA LA”. He said to me that ‘Those guys will rock the world in the future’. What he said ten years ago came true.”\r\n\r\nPSY sang “CHAMPION” and “GANGNAM STYLE” for his special performance.\r\n\r\n2016. 8. 21.\r\n","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/20151224_1450964199_18783300_1_99_20160821080004.jpg","thumb_2x1":false,"thumb_3x2":false},"844":{"id":844,"post_title":"BIGBANG Spotted Having a Party With Lee Jung Hyun and YANG HYUN SUK after their 10th Anniversary Concert","url_friendly_name":"bigbang-spotted-having-a-party-with-lee-jung-hyun-and-yang-hyun-suk-after-their-10th-anniversary-concert","excerpt":"","post_content":"\r\n[스포츠조선닷컴=이지현 기자] BIGBANG was spotted having a party after their 10th anniversary concert.\r\n\r\nOn August 21, a picture of BIGBANG’s at their after party was posted on YG Entertainment’s official Instagram page. The picture shows BIGBANG members having a good time with their friends and YANG HYUN SUK.\r\n\r\nBIGBANG held a concert at the World Cup Stadium on August 20 to celebrate the 10th anniversary of their debut. It was not just a concert but a festival for the 65,000 fans who came to the concert.\r\n\r\nAt the concert, BIGBANG’s leader G-DRAGON said, “Before 2006, August was just a month I was born in. But after our debut, it is a month that makes me think about our fans and the members. I would like to thank the parents of all five of us for bringing us to this world, our agency for bringing us together, and our fans for making us who we are today. I hope we’ll still be able to see you and have a concert like this ten years from now.”\r\n\r\n2016. 8. 21.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/2016082201002236100174112_99_20160821082505.jpg","thumb_2x1":false,"thumb_3x2":false},"842":{"id":842,"post_title":"Only a Legendary Group Like BIGBANG Could Have Made it Possible","url_friendly_name":"only-a-legendary-group-like-bigbang-could-have-made-it-possible","excerpt":"","post_content":"[조이뉴스=이미영기자] “They are a boy band that grows every day while maintaining their unique identity.”\r\n\r\nThis is how PSY described BIGBANG. It’s not just a mindless rhetoric that guests say to praise the host when invited to a concert. It is a true, hard fact. During the last ten years, BIGBANG has set countless numbers of new records and is still leading K-Pop. The legendary K-Pop group BIGBANG has created another legend at Sangam-dong.\r\n\r\nOn August 20, “BIGBANG10 THE CONCERT: 0.TO.10” was held at the World Cup Stadium in Sangam-dong. 65,000 fans flocked to look back on the past ten years of BIGBANG and to promise another ten years.\r\n\r\n\r\n\r\nThe concert was special in many ways. BIGBANG debuted on August 19 in 2006, and they have been around for ten years without a change of members. 65,000 fans, the biggest number for a single concert, came to see BIGBANG on that day. The concert demonstrated that BIGBANG still has strong presence on Korea’s music scene and a wide fan base.\r\n\r\n65,000 people holding yellow crown sticks got together in Sangam-dong, and even before the concert started, they were cheering loudly. The heat at the concert was hotter than the record-breaking heat wave that struck Seoul.\r\n\r\nBIGBANG led the audience to a heavenly bliss by singing “HEAVEN” and signaled the beginning of a great party with “WE LIKE 2 PARTY”. The concert was a shortened version of the past ten years of BIGBANG. BIGBANG sang their hit songs such as “BAD BOY”, “LOSER”, “IF YOU”, “HARU HARU”, “BANG BANG BANG”, “FANTASTIC BABY”, “SOBER”, “LAST FAREWELL”, “SUNSET GLOW”, and “LIES” without stopping for one moment. 65,000 fans sang along to the songs and heated up the 10thanniversary party.\r\n\r\n\r\n\r\nBIGBANG also did solo and unit performances. All the members of BIGBANG had released solo singles and had formed unit groups. The solo and unit performances took up a third of the total concert time, providing a chance for the fans to have a taste of each member’s music.\r\n\r\nMaybe it was because the 10th anniversary had such a big meaning to them or maybe it was something else, but BIGBANG talked a lot during the concert. Although they were charismatic during performances, they went back to their usual cheerful and fun selves and chatted away with their fans. They were funny and witty, making the concert even more joyful for the fans. Most of all, they were thankful to their fans.\r\n\r\nG-DRAGON thanked the fans by saying, “Before I joined YG, August was just a month I was born in. But now, it has become a special month that makes me think about our fans and the members a lot. I’d like to thank you once again because I truly believe that you made us who we are today. I hope you keep on sending your support. Time flies. The past ten years have gone past so quickly. I hope that we’ll be able to perform for you and be with you for another ten years.”\r\n\r\nTAEYANG said, “A lot has happened during the past ten years. I didn’t expect so many people to come to this concert. Thank you for allowing us to sing for ten years. We’ve been busy every day. We’re trying to draw the big picture for the next ten years of BIGBANG.”\r\n\r\nT.O.P started to tear up when it was his turn to make remarks. He said, “I have a lot to be thankful for. I’ve had a lot of happy moments during the past ten years as well as moments that I don’t want to remember. I’d like to thank the fans for being with me and supporting me all the way through.”\r\n\r\n\r\n\r\nSince it was a 10th anniversary concert, there were many unexpected scenes both in and out of the stadium. The set was glamorous and magnificent, and many new records were set.\r\n\r\nFor starters, the number of audience was extraordinary. As much as 65,000 people came to see BIGBANG, and it was the biggest number for a single concert in Korea. The tickets were all sold out, even the tickets to the view-restricted seats. The audience consisted of people from various age groups from those in their teens to those in their 40s and 50s. There were fans from outside of Korea, and some male fans dressed up as G-DRAGON.\r\n\r\nBIGBANG members have held concerts all around the world, but when they saw that the stadium was filled with fans from all around the world, they couldn’t help but feel impressed and thankful.\r\n\r\nSEUNGRI said, “Thank you for coming to our 10th anniversary concert. I didn’t expect so many people would come to the concert because this is originally a football stadium.” TAEYANG said, “I’m so happy that we could celebrate our 10th anniversary with so many people. If we had known so many would come, we would have held concerts for two days.” G-DRAGON said with a big smile on his face, “I was worried that we would not be popular in Korea because we’ve been out a lot. But I know now that there was no need to worry.”\r\n\r\n\r\n\r\nThe set and the installations were phenomenal. It was a big stadium, but the stage was big and glamorous enough to fill the stadium. Thanks to the cutting-edge installations, BIGBANG members were able to sing on different sets every time. The splendid LED screen and lights made the concert even more glamorous. Delay speakers were installed at a total of ten spots to provide best quality sound to the audience.\r\n\r\nThere was also a three storey, 14m-long and 14m-high lift in the shape of a pyramid on the stage. The front part of the stage could be lifted as high as 8 meters. The stage was mostly made of large lifts. There were four outdoor broadcasting vans, 30 cameras, and wire cams to shoot every corner of the stage and the stadium.\r\n\r\nThings were just as hot outside the stadium.\r\n\r\nThe hot weather couldn’t get in the way of the fans. Those who got standing seat tickets started to get in line from the morning to get the best view of the stage. There were crowds of people even from the subway station when it was time for the concert to begin, and they had to wait for a long time just to get in the stadium. There were also scalpers and fans who couldn’t get the tickets wandering outside of the stadium.\r\n\r\nBIGBANG’s 10th anniversary concert was indeed a huge blast. BIGBANG has created another legend with the concert.\r\n\r\n\r\n\r\n2016. 8. 21.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/1471701639271_1_230446_99_20160821071804.jpg","thumb_2x1":false,"thumb_3x2":false},"841":{"id":841,"post_title":"[Review is] BIGBANG Went Crazy on Stage and Fans Went Crazy because They Wanted to See More","url_friendly_name":"review-is-bigbang-went-crazy-on-stage-and-fans-went-crazy-because-they-wanted-to-see-more","excerpt":"","post_content":"\r\n\r\n\r\n[일간스포츠=이미현 기자] It was a concert that only BIGBANG could pull off. Fans from all around the world came to Sangam-dong to celebrate the 10th anniversary of BIGBANG. The five members of BIGBANG on the stage and 65,000 fans in the audience all shone bright like stars.\r\n\r\nAt 7 PM on August 20, “BIGBANG10 THE CONCERT: 0.TO.10” took place at the World Cup Stadium in Sangam-dong to celebrate the 10th anniversary of BIGBANG’s debut. BIGBANG debuted exactly ten years ago on August 19, and they decided to hold a large-scale concert to share the joy with their fans.\r\n\r\nA whopping 65,000 fans from in and out of Korea flocked to Sangam-dong. Originally, the concert was to hold only 60,000 people, but because there were so many requests from those who couldn’t get tickets, extra tickets for the restricted-view seats were opened for sale later on. Not only Korean fans but also fans from all around the world came to see BIGBANG on the stage.\r\n\r\n\r\n\r\n◆BIGBANG heated up the stage from the very beginning.\r\n\r\nBIGBANG kicked off the concert with “HEAVEN”. The audience went wild as soon as the concert started. BIGBANG was covered in sweat even when they were singing their first song. After “HEAVEN”, BIGBANG sang “WE LIKE TO PARTY” and “HANDS UP”. They ran about the stage trying to make eye contact with those on the second and third floor and even those in restricted-view seats.\r\n\r\nBIGBANG has been around for ten years now, and so, they had no trouble making witty introductions at the beginning of the concert. G-DRAGON introduced himself, “Hello, I’m G-DRAGON, and I’ve been leading BIGBANG for ten years now.” T.O.P said, “Your lights are making our hearts warm. Let’s rock the night away.” DAESUNG shouted out, “It’s already hot tonight. But let’s make it hotter!”\r\n\r\nAfter BIGBANG sang “BAD BOY” and “LOSER”, SEUNGRI turned into a DJ and played a medley of their hit songs. “We have so many songs that we couldn’t sing them all at a concert”, SEUNGRI explained why he prepared his special DJing performance. The medley included a number of BIGBANG’s hit songs such as “FEAR”, “LOLLIPOP”, and “STILL ALIVE” and made the audience very happy.\r\n\r\n\r\n\r\n◆BIGBANG is great together and apart.\r\n\r\nWhat followed afterwards was a thing that only BIGBANG could do. SEUNGRI performed his solo singles “LET’S TALK ABOUT LOVE” and “STRONG BABY”. DAESUNG sang “WINGS” and “LOOK AT ME GWISOON”. Then the two sang G-DRAGON’s “CROOKED” to the surprise of the audience.\r\n\r\nG-DRAGON performed “HEARTBREAKER” and “CRAYON” for his solo stage. Then he sang “HIGH HIGH” with T.O.P and “GOOD BOY” with TAEYANG. His charisma on the stage made the audience go wild and proved that he is indeed a star.\r\n\r\nThen it was T.O.P’s turn. He sang “ACT LIKE NOTHING IS WRONG” and “DOOM DADA”. Next, TAEYANG performed “EYES, NOSE, LIPS”, “LOOK AT ME ONLY”, and “RINGA LINGA”. He sang all the songs live and they were all flawless. All these performances were only possible because BIGBANG members all released solo albums.\r\n\r\n\r\n\r\n◆ A journey of the past 10 years of BIGBANG\r\n\r\nAs the concert went on, BIGBANG members and the audience began enjoying the concert as if they were one. BIGBANG sang their mega hit songs as well as their recent hit songs such as “IF YOU”, “HARU HARU”, “BANG BANG BANG”, “FANTASITC BABY” and “SOBER” and enthralled the audience.\r\n\r\nFor their closing remarks, members said, “We are trying to draw the big picture for the next ten years of BIGBANG. We hope you’ll keep on sending us your support. Once again, thank you for your support during the past ten years. We’ll keep on creating great music and putting on great performances. Thank you.”\r\n\r\nThe heat and the roar of in Sangam-dong were strong enough to be felt on the other side of the earth. For their encore stage, BIGBANG sang “LAST FAREWELL”, “SUNSET GLOW”, “LIES”, “ALWAYS”, and “BAE BAE”. During the two and a half hour concert, the five members of BIGBANG and 65,000 fans truly became one. History was written again on August 20, 2016.\r\n\r\n2016. 8. 21.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/20160821_3049907_1471744777_99_20160821112304.jpg","thumb_2x1":false,"thumb_3x2":false},"839":{"id":839,"post_title":"In just 14 Days after Debut, BLACKPINK becomes Candidate for No.1 on the Charts","url_friendly_name":"in-just-14-days-after-debut-blackpink-becomes-candidate-for-no-1-on-the-charts","excerpt":"","post_content":"\r\n[스포츠조선닷컴=정유나 기자] It’s been only two weeks since BLACKPINK debuted, but the girl group became a candidate for the no.1 spot on Inkigayo’s chart. If BLACKPINK does become no.1, it will be the shortest time that a girl group topped the chart of a national TV music show.\r\n\r\nOn August 21, BLACKPINK will appear on SBS’s Inkigayo and sing “WHISTLE” and “BOOMBAYAH”—the title tracks of their debut single album “SQAURE ONE”.\r\n\r\nThe girl group is also a candidate for no.1 on Inkigayo’s chart, which is remarkable considering that BLACKPINK is only a rookie that debuted 14 days ago.\r\n\r\nOn August 14, BLACKPINK first performed their debut songs on Inkigayo, and ever since, they have been become a big issue online. As of 10 AM on August 21, BLACKPINK’s “WHISTLE” is no.1 on the charts of Korea’s seven major music streaming websites.\r\n\r\n2016. 8. 21.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/2016082201002244600174761_99_20160821101604.jpg","thumb_2x1":false,"thumb_3x2":false},"837":{"id":837,"post_title":"[Concert] The Five Bad Boys of BIGBANG Look Back on their Past Ten Years","url_friendly_name":"concert-the-five-bad-boys-of-bigbang-look-back-on-their-past-ten-years","excerpt":"","post_content":"\r\n[매일경제 스타투데이=한인구 기자] “This is a historic concert. I’ve never seen so many people at a concert in Korea. It was in 2006, and it was the day when I appeared on TV to promote “CELEBRITY” for the last time. YANG HYUN SUK and I were watching BIGBANG’s debut stage. He said to me that ‘Those guys will rock the world in the future’. BIGBANG is a group that grows every day while maintaining their unique identity. “\r\n\r\nPSY talked about BIGBANG’s debut stage when he appeared as a guest at BIGBANG’s 10th anniversary concert, which took place on August 20 at the World Cup Stadium. The global star praised BIGBANG for keeping their style of music for the past ten years. The concert was indeed a journey into the past ten years of BIGBANG.\r\n\r\n65,000 people came to see BIGBANG despite the scorching heat, and the concert looked like a “little Asia.” Fans from Japan, China, and even Southeast Asian countries cheered when the screen showed BIGBANG’s hit-medley video before the concert.\r\n\r\nWhen the concert finally began at 7 PM, music videos of “BAE BAE”, “LET’S NOT FALL IN LOVE”, and “SOBER” were played. Fans cheered loudly watching the faces of members on the screen. A video showing celebratory remarks and members was played afterwards.\r\n\r\nWearing silver costumes, BIGBANG members appeared on the main stage, which had a large three-storey pyramid lift. They shouted out, “10th anniversary of BIGBANG! Let’s start the party!” and sang “WE LIKE 2 PARTY”. G-DRAGON, TAEYANG, SEUNGRI went up on a lift on one side and T.O.P and DAESUNG on another one so that they could move to the very end of the stage.\r\n\r\nUnlike other singers who go on a lift when the concert is coming to an end, BIGBANG heated up the atmosphere by moving via lifts at the very beginning of their concert. For the “HANDS UP” performance, members changed lifts.\r\n\r\nG-DRAGON said, “Hi, I’m G-DRAGON and I’ve been the leader of BIGBANG for ten years now. I hope you enjoy the concert.” DAESUNG thanked the audience for coming to their concert in such a hot weather by saying, “It’s already hot. But let’s heat things up and enjoy the party!”\r\n\r\n\r\n\r\nBIGBANG then performed “BAD BOY” and “LOSER”. Because of the hot weather, the members looked tired at times, but they quickly regained strength and continued on. To prevent the audience from fainting, the members gave time for them to take short rests.\r\n\r\nThe concert was filmed to be released as a DVD, and this was why YG Entertainment put so much into the concert. The stage consisted mainly of large lifts, and four outdoor broadcasting vans, 30 cameras, and a wire-cam were used to record BIGBANG’s concert. The members didn’t forget to look at the camera during their performances.\r\n\r\nThree large LED screens were installed, one on the main stage and two on the side, so that the audience don’t miss a moment. Delay speakers were placed at ten spots to provide high-quality sound to all the seats. Every time BIGBANG finished singing a song, fireworks went off. The sound and the set were fabulous, fit for the 10th anniversary concert of BIGBANG.\r\n\r\nWhen it was his time to say a word, DAESUNG said, “I wanted to do a concert in Korea because I love your passion. I would like to thank those who have come from other countries too.” G-DRAGON said, “I was worried that we wouldn’t be popular in Korea because we’ve been doing concerts outside of Korea for such a long time. Thank you all for coming.”\r\n\r\nBIGBANG members also did solo performances. DAESUNG sang “WINGS” and “LOOK AT ME GWISOON” in a jacket that had embroidered arms. He sang G-DRAGON’s “CROOKED” with SEUNGRI after SEUNGRI finished his “STRONG BABY” performance.\r\n\r\nG-DRAGON sang “HEARTBREAKER” and “CRAYON”, TAEYANG sang “EYES, NOSE, LIPS”, “LOOK AT ME ONLY”, and T.O.P performed “ACT LIKE NOTHING IS WRONG” and “DOOM DADA” for their solo performances. In between solo performances, members put on unit performances such as GD&amp;T.O.P’s “HIGH HIGH” and GD&amp;TAEYANG’s “GOOD BOY”.\r\n\r\nBIGBANG debuted at YG Family’s 10th anniversary concert, which was held at Olympic Gymnastics Stadium on August 19, 2006. For the past ten years, BIGBANG have done their style of music. BIGBANG’s melodies are pleasant to the ear, yet, their music has its roots in hip-hop, the main genre of YG Entertainment. The five “bad boys” of BIGBANG made a decade worth of YG’s know-how into their own and opened a whole new decade for YG.\r\n\r\nAfter singing “HARU HARU”, “IF YOU” and “BANG BANG BANG”, BIGBANG said, “YG brought BIGBANG together. There are many people here today, and it is because of you we have become who we are today. 10th anniversary means a lot to us, and we’re happy to be celebrating this special occasion. We’re trying to draw the big picture for the next ten years of BIGBANG”.\r\n\r\n\r\n\r\n2016. 8. 21.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/20160821_3049907_1471744777_99_20160821112304.jpg","thumb_2x1":false,"thumb_3x2":false},"835":{"id":835,"post_title":"[Oh!Ssen Focus] BLACKPINK is Exceeding all Expectations","url_friendly_name":"ohssen-focus-blackpink-is-exceeding-all-expectations","excerpt":"","post_content":"\r\n\r\n[OSEN=선미경 기자] BLACKPINK’s success was somewhat expected. The fact that BLACKPINK is YG’s first group in seven years guaranteed its strong presence and success. But they are doing better and exceeding all expectations.\r\n\r\nBLACKPINK debuted two weeks ago, and they have made remarkable success ever since. They are already setting new records as a girl group that has become no.1 in the shortest amount of time. BLACKPINK debuted by releasing “WHISTLE” and “BOOBAYAH” on August 8. The public responded quickly thanks to their talent and fresh style.\r\n\r\nSince then, BLACKPINK has continued setting new records. “WHISTLE” has been topping the charts for two straight weeks now. Major singers have released new songs, but the song has maintained the no.1 spot and is likely to do so for some time. Although they are only rookies, YANG HYUN SUK and TEDDY have done a good job in prepping them and BLACKPINK is surely on the path to success.\r\n\r\nChart results show the level of popularity among the general public, not just among the fan base. Unlike other new idol groups, BLACKPINK did not appear on TV shows before their debut. So, it is remarkable that so many people know and love their music. Of course, this was in part because BLACKPINK is launched by YG and people are bound to take interest in groups that are launched by such large entertainment companies. But interest would not have transferred to popularity if it wasn’t backed up by good music and fresh style.\r\n\r\nWhat is most surprising is that BLACKPINK became a candidate for no.1 spot of Inkigayo’s chart in just 14 days after debut. It is the shortest time that a girl group became a candidate for the no.1 spot of a national TV music show. This shows the power of BLACKPINK.\r\n\r\nBLACKPINK’s debut stage video surpassed one million views, demonstrating people’s great interest in the group both in and out of the country. Billboards also took interest in the group and said, “Blackpink is only the seventh K-pop act to hit No. 1 on World Digital Songs. The group now joins the company of PSY (who has four No. 1s on the chart), BIGBANG (with three) plus 2NE1, EXO, CL, BTS, plus G-Dragon and Taeyang (all with one). Nevertheless, Blackpink is the fastest act to hit No. 1 on the chart, and only the third to hold the top two positions after PSY and BIGBANG.”\r\n\r\nOf course, BLACKPINK has a long way to go. As they are an YG group, they are expected to aim higher and bigger. They’ve hit a jackpot at the very start of their journey and they are bound to hit some more in the days to come.\r\n\r\n2016. 8. 21.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/201608211112771500_57b90e988ba55_99_20160821111805.jpg","thumb_2x1":false,"thumb_3x2":false},"833":{"id":833,"post_title":"BLACKPINK Tops All the Charts and Become a Candidate for no.1 of a Music Show Chart","url_friendly_name":"blackpink-tops-all-the-charts-and-become-a-candidate-for-no-1-of-a-music-show-chart","excerpt":"","post_content":"\r\n[텐아시아=조현주 기자] The nickname “monster rookie” isn’t enough to describe them.\r\nBLACKPINK swept the no.1 spot of eight music streaming websites, signaling the start of a mega-rookie.\r\n\r\nIn the afternoon of August 21, BLACKPINK’s “WHISTLE” took the no.1 spot on the charts of Korea’s eight music streaming websites—Melon, Monkey3, Olleh, Naver Music, Bugs, Mnet, Soribada, and Genie. By doing so, it has become the biggest hit song of this summer.\r\n\r\nAfter its debut, BLACKPINK has dominated all the realtime, daily, and weekly online charts and took the no.1 spot on the iTunes charts of 14 countries. The group has also ranked first and second on Billboard’s World Digital Songs chart and QQ Music’s weekly chart. It is an unprecedented record for a rookie.\r\n\r\nMeanwhile, BLACKPINK became a candidate for the no.1 spot of a national TV music show in the shortest amount of time for a girl group. Check out whether the group will be able to take the no.1 spot in only a week after its first debut stage.\r\n\r\n2016. 8. 21.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/2016082115032213450-540x355_99_20160821150702.jpg","thumb_2x1":false,"thumb_3x2":false},"831":{"id":831,"post_title":"[Music Talk Talk] The reason why Sechs Kies goes to YG recording studio every day before their concert","url_friendly_name":"music-talk-talk-the-reason-why-sechs-kies-goes-to-yg-recording-studio-every-day-before-their-concert","excerpt":"","post_content":"\r\n\r\n[OSEN=선미경 기자] These guys are doing their very best for fans. While group Sechs Kies is working hard on their upcoming concert, they are going to YG’s recording studio every day. For their first concert in 16 years, Sechs Kies is doing everything from scratch, from the music itself.\r\nSechs Kies goes to YG’s recording studio every day these days. While being busy with preparation for the concert and appearance in TV shows, Sechs Kies has been recording more than 20 songs they will perform in the concert from scratch.\r\nAccording to YG, there were only one or two available accompanying music for Sechs Kies songs as they have not sung for the past 16 years. No one had the accompanying music for Sechs Kies’ songs. Plus, YG does not usually use accompanying music for TV shows in its artists’ concerts, as the company puts great importance on the quality of the sound. Therefore, YG is creating the accompanying music for Sechs Kies’ concert on its own. It shows how big pride YG has in its concerts and how much YG is caring about the quality of its concerts.\r\nYG plays music in multi-tracks from rehearsals and mixes the sound again in compliance with the one-site conditions found in the rehearsals, because echo is generated and sound becomes much different according to the size and circumstances of concert halls. YG’s CEO YANG HYUN SUK puts utmost importance on the quality of sound in concerts, so the first thing he did upon signing the contract with Sechs Kies was to call more than 10 producers and to order them to restore the sound of Sechs Kies’s music that was recorded 16 years ago.\r\nThat is the work to upgrade the sound through mixing by American engineers, while maintaining the originality of Sechs Kies’ music. It is of course hard to rewrite and mix more than 20 songs within a short period of time, but it is even harder for Sechs Kies to record those songs all over again including chorus parts.\r\nAn YG insider said, “It is only hard at the beginning. Once the recording and mixing is completed, all performances that Sechs Kies will do from now on will be able to boast perfect sound”. As Sechs Kies members are working very hard on the preparation of their concert with YANG HYUN SUK’s full support, many people believe that the concert will be unprecedentedly perfect.\r\nNotably, all the 20,000 tickets for Sechs Kies’ concert have been sold out, proving the team’s still-great presence in the music scene. Such a record also shows how desperately fans have been longing for Sechs Kies’ reunion. Fans are expressing big anticipation for Sechs Kies’ first concert in 16 years.\r\nSechs Kies’ concert “2016 SECHSKIES CONCERT YELLOW NOTE” will be held on September 10 and 11 at Olympic Gymnastics Arena in Seoul.\r\n2016. 8. 26.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/201608261327778732_57bfc581c732c_99_20160826133604.jpg","thumb_2x1":false,"thumb_3x2":false},"828":{"id":828,"post_title":"BLACKPINK Tops Three Gaon Charts and Writes New History Every Day","url_friendly_name":"blackpink-tops-three-gaon-charts-and-writes-new-history-every-day","excerpt":"","post_content":"\r\n\r\n[OSEN=표재민 기자] BLACKPINK has topped Gaon charts for two consecutive weeks. Last week, the group became no.1 on two of Gaon’s charts but this week on three of them.\r\n\r\nThe Gaon charts for the 34th week were announced on August 26, and BLACKPINK’s “WHISTLE” was no.1 on its digital chart, streaming chart, and mobile chart.\r\n\r\nA week ago, BLACKPINK topped Gaon’s digital and download charts. By taking the no.1 spot on three of Gaon’s charts, the group has demonstrated its huge popularity.\r\n\r\nUpon debut, BLACKPINK has dominated all the major charts in Korea. Not only that, it became no.1 on iTunes charts of 14 countries and took the top two spots on Billboard’s World Digital Songs chart. BLACKPINK has also set a new record by becoming no.1 on a music show in the shortest time for a girl group.\r\n\r\n2016. 8. 26.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/26217416_99_20160828100703.jpg","thumb_2x1":false,"thumb_3x2":false},"826":{"id":826,"post_title":"CL’s “LIFTED” Receives Spotlight on a Famous US Radio Show","url_friendly_name":"cls-lifted-receives-spotlight-on-a-famous-us-radio-show","excerpt":"","post_content":"\r\n[스포츠조선닷컴=정안지 기자] CL’s “LIFTED” receives much spotlight on a famous streaming website and a radio show, demonstrating the song’s high popularity in the US.\r\n\r\nCL’s first official US single, “LIFTED”, was on Spotify’s New Music Friday list released on August 26 (local time). New Music Friday is a list of songs Spotify’s editor recommends among the newly-released songs of that week.\r\n\r\nFurthermore, on the same day, “LIFTED” was discussed on Sirius XM’s Youtube 15 show. Youtube 15 is hosted by Jenna Marbles and is one of the most popular shows of Sirius XM.\r\n\r\nCL’s “LIFTED” is a song produced by YG’s TEDDY, and its lyrics are written by CL, TEDDY, and Asher Roth. CL sampled parts of the legendary hiphop group Wu- Tang Clan’s “Method Man” and added her unique and sexy feel to its rap.\r\n\r\nUpon release, the song became no.17 on Billboard’s Social Chart 50, no.12 on iTunes Top US Hiphop Chart, and was chosen as Apple Music’s Best of the Week songs. “LIFTED” also covered by major media outlets such as The Time, Entertainment Weekly, and USA Today.\r\n\r\nMeanwhile, the official music video of “LIFTED” surpassed the six million mark and posted 6,253,572 views on Youtube on August 27.\r\n\r\n2016. 8. 27.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/2016082801002813900215141_99_20160827150504.jpg","thumb_2x1":false,"thumb_3x2":false},"820":{"id":820,"post_title":"[TV Talk Talk] GD’s Unexpected Camera Shyness Makes it More Interesting","url_friendly_name":"tv-talk-talk-gds-unexpected-camera-shyness-makes-it-more-interesting","excerpt":"","post_content":"\r\n\r\n[OSEN=박진영 기자] The combination of Infinite Challenge and G-DRAGON is never wrong.\r\n\r\nOn August 27, the making of Infinite Challenge’s much-anticipated Muhan Company special was released. The Muhan Company special is a mega special project the goal of which is to make a short movie with the cast of Infinite Challenge. The script of the short movie is written by Kim Eun-hee, the screenwriter of “Signal”. Jang Hang-jun is the director and the cast of Infinite Challenge each have parts.\r\n\r\nOther top actors\/actresses including Lee Jae-hoon, Kim Hae-soo, Jun Kunimura, Kim Hee-won, Jeon Seok-ho, Son Jong-hak, and Jun Mi-sun appear as cameos. BIGBANG’s G-DRAGON also plays a significant role in the short movie.\r\n\r\nIn the making, he looked nervous about acting saying that he agreed to take part only because he liked Infinite Challenge so much. He seemed to be taken aback by the huge scale of the project.\r\n\r\nIt is not surprising since it was his first time acting for a legitimate drama. He has had offers to appear in movies and TV dramas but declined them because he couldn’t imagine himself acting seriously. But, now he had no choice but to do his first serious acting for Infinite Challenge, and he seemed to be very nervous about it. Whenever he heard the names of the fellow actors and actresses, he seemed to be embarrassed, and this gave unexpected fun to the viewers.\r\n\r\nInfinite Challenge is very special to G-DRAGON, so much so that he participated in almost all of its special projects. He really likes the show, and the cast of Infinite Challenge really likes him too. But we have never seen him so nervous as this time. Ten years have passed since he debuted, so it is hard to understand why he would ever be nervous in front of a camera. The fact that he is playing an important role and that it is his first time acting for a legitimate movie must have weighed on him.\r\n\r\nNevertheless, G-DRAGON did his utmost and acted for the movie with passion. But, he also had a good laugh when he was around Infinite Challenge members, playing along with their jokes. He was especially kind and considerate to Kwang-hee. When Lee Jae-hoon confessed that he was a big fan of BIGBANG, G-DRAGON gave his number and promised to get him tickets to BIGBANG’s concerts. When Jang Hang-jun asked G-DRAGON if he could take a picture with his wife and daughter, G-DRAGON said yes without any reluctance. We are all looking forward to seeing G-DRAGON in the Muhan Company special, which will be aired next week.\r\n\r\n2016. 8. 28.","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/201608281044772576_57c2436136363_99_20160828133109.jpg","thumb_2x1":false,"thumb_3x2":false},"818":{"id":818,"post_title":"“Autumn, fantastic GD”… G-DRAGON presents perfect mood for autumn”","url_friendly_name":"autumn-fantastic-gd-g-dragon-presents-perfect-mood-for-autumn","excerpt":"","post_content":"\r\n\r\n\r\n\r\n[Dispatch=이수아기자] “BIGBANG”s G-DRAGON proved his fame as a fashionista, boasting unmatched charisma in outfits of a variety of styles.\r\nRecently, G-DRAGON did photo-shooting for the September issue of fashion magazine “Elle”. G-DRAGON took special care of every detail for the photo-shooting, from the pattern and fabric to the color of the outfits for him.\r\nGD’s special tattoo left a big impression, too. Despite the scorching hot weather, GD tried fancy styling in a sukajan jumper, leather pants, coat, and knit.\r\n\r\nG-DRAGON also made a satisfied smile on his face, with his pet cat in his arms. He expressed a care-free attitude in outdoor photo-shooting. \r\nThin eye-makeup and thick eyebrows added to GD’s charisma. His outstanding aura overwhelmed everyone at the photo-shooting.\r\nGD has recently rounded off BIGBANG’s 10th anniversary concert held on August 20 at Sang-am World Cup Stadium in Seoul. \r\n&lt;Photos=Elle&gt;\r\n\r\n\r\n2016. 8. 29.\r\n\r\n","post_date":"2016-08-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/20160829075017_4826364461264_99_20160829082704.jpg","thumb_2x1":false,"thumb_3x2":false},"814":{"id":814,"post_title":"YG's BOBBY is returning as a solo artist...\"Coming Soon\" Teaser unveiled","url_friendly_name":"ygs-bobby-is-returning-as-a-solo-artist-coming-soon-teaser-unveiled","excerpt":"","post_content":"[OSEN=최나영 기자] Rapper BOBBY, 22, who is also a member of iKON, has unveiled the first teaser image for his solo comeback.\r\n\r\nNews regarding BOBBY preparing for this solo album first began surfacing a few months ago. Today (Aug. 29), YG Entertainment officially confirmed BOBBY's solo comeback on the company's blog.\r\nThe teaser image shows “COMING SOON” in a large font, indicating that BOBBY’s solo album will be released soon.\r\nBOBBY is the main rapper in iKON, a group that debuted one year ago, as well as the winner of \"Show Me the Money 3\" that aired back in 2014. BOBBY's rap style and tough voice are impressive and unique, and his performances are always full of energy.\r\nHe is a member of the all-male group iKON that notably held a Japan arena tour within one year of their debut. Now, he will experience another chapter as a solo artist with the release of this solo album.\r\nBOBBY was only 19-years-old when he won the “Show Me the Money 3” competition. His solo album and live performances that are being released two years after his victory will be hip-hop and demonstrate BOBBY's identity and appeals.\r\nYG Entertainment will unveil teaser images of BOBBY’s solo comeback every day from now on.","post_date":"2016-08-29","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/BOBBY_solo-artist.jpg","thumb_2x1":false,"thumb_3x2":false},"755":{"id":755,"post_title":"[DUMMY DATA] TITLE PLACEHOLD","url_friendly_name":"dummy-data-title-placehold","excerpt":"Yet that vulnerability is absent from the Beyoncé brigade that marches out from behind the fog at Citi Field to open the show with the song from which the tour gets its name.","post_content":"\"Beyoncé is not God. She tells you as much about a third of the way through her Formation World Tour — which lit up Citi Field in Queens for the second of two nights on Wednesday — with two stadium-length illuminated screens bearing the words “God is God. I am not” in all caps. As it does during the snarling “Don’t Hurt Yourself” in her visual masterpiece &lt;i&gt;Lemonade&lt;\/i&gt;, the message flashes fast. Blink and you’ll miss it. The position is reinforced by moments that are, if only briefly, unmistakably human — such as when, on the first night of her NYC dates. Twice, politely and discreetly, into her arm, like any non-godly person, one not performing for a sold-out crowd at a stadium that last year co-hosted the World Series, might do. But for many, witnessing Beyoncé let out a sneeze only adds to the mystique of feeling “close” to someone so seemingly godlike, prompting her otherwise quiet &lt;i&gt;achoo&lt;\/i&gt; to dominate the news cycle for an entire day. On her second night at Citi Field, Beyoncé’s bedazzled nude bodysuit ripped near the crotch during her finale — “Halo,” appropriately — moments after she and her apostolic all-female dancers create the illusion of walking barefoot on water. Beyoncé may not be God, but she still conveys an air of being more than human.&lt;b&gt; &lt;\/b&gt; The Beyoncé that rises from the bitterness — and all the events that may or may not have inspired it — is a woman knocked off her axis. She’s been tortured, flung off a roof, gone rogue with a baseball bat, baptized in the holy water of redemption, and eventually resurrected. Every emotional flaw she exposes finds itself under her own microscope. Yet that vulnerability is absent from the Beyoncé brigade that marches out from behind the fog at Citi Field to open the show with the song from which the tour gets its name.\",","post_date":"2016-08-24","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/WINNER.jpg","thumb_2x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/WINNER.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/WINNER.jpg"},"1840":{"id":1840,"post_title":"YG says, “No plan for 2nd girl group to follow BLACKPINK”","url_friendly_name":"yg-says-no-plan-for-2nd-girl-group-to-follow-blackpink","excerpt":"","post_content":"[스타뉴스=문완식 기자] While YG Entertainment’s new girl group BLACKPINK is to make debut by the end of July, YG announced that there will be no other girl group made of the rest of YG’s girl trainees.\r\n\r\nOn July 30, YG announced, “We have no plan for the second new girl group.”\r\n\r\nYG said, “Just like most of large music labels, about 50 trainees have been working hard for training at YG for years, and we have not decided yet about whether the rest of the members not included in BLACKPINK will make a team or team up with other trainees.”\r\n\r\nAs the number of BLACKPINK’s members which was announced on the 29 was less than expected at four, people’s curiosity about other trainees who have been working with the members of BLACKPINK so far is growing.\r\n\r\nYG said, “Some say that the rest of the trainees will make debut as well soon, but that is some media outlets’ hasty speculation. As BLACKPINK is YG’s first girl group in seven years, YG will focus on BLACKPINK’s successful debut.”\r\n\r\nBLACKPINK is known to be concentrating on the final work on their debut by the end of July. According to insiders, BLACKPINK is currently shooting three music videos and four famous foreign choreographers are working on the choreography for BLACKPINK’s debut song. Plus, YG’s main producer TEDDY is giving the final touch for the team’s debut album.","post_date":"2016-06-30","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/2016063009054792843_1_99_20160630091408.jpg","thumb_2x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/2016063009054792843_1_99_20160630091408.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/2016063009054792843_1_99_20160630091408.jpg"},"1972":{"id":1972,"post_title":"[Night TV] ONE and #GUN Put on Phenomenal Performances against Each Other on SMTM","url_friendly_name":"night-tv-one-and-gun-put-on-phenomenal-performances-against-each-other-on-smtm","excerpt":"","post_content":"\r\n\r\n[마이데일리=신소원 기자] ONE has been eliminated from Show Me The Money 5, but his last performance was the best ever. #GUN also put on a phenomenal show and went on to the next round.\r\n\r\nOn June 24, the first round of Mnet’s Show Me The Money 5 kicked off. Against the expectations of many, G2, Donutman, and ONE were eliminated, and #GUN went on to the next round after putting on a great performance.\r\n\r\nFor the team rap battle, ONE was pitted against Xitsuh. ONE showed his strong determination to win by saying, “I’ve never liked him anyway” during his interview. He rapped to the beat that Xitsuh rapped to just before he was eliminated in the previous season. But to everyone’s dismay, ONE forgot his lines.\r\n\r\n#GUN also forgot his lines during the team battle and stopped rapping altogether. He started rapping right after Superbee, but during his diss rap, he forgot his lines and said, “Turn off the beat”. Gil was very disappointed in #GUN’s performance and said, “I thought he would win. But, he didn’t rap. How can this happen?”\r\n\r\nBut, Gil and #GUN were determined to win the first round. Simon Dominic and Gray chose ONE over G2 for the group performance to everyone’s surprise. ONE put on a stable performance, and the three good-looking guys captured the hearts of the girls in the audience.\r\n\r\n\r\n\r\nn Gil and Mad Clown’s team, Boi B volunteered to put on a solo performance, and Gil and Mad Clown chose #GUN to go on the stage with them for the group performance. Producers were not impressed with #GUN’s previous performances, and his identity as a rapper was unclear. But he was well prepared to go on the stage, and he rapped his own story, which moved the hearts of the audience. In the end, #GUN won, and ONE became eliminated.\r\n\r\nONE said, “A lot has happened, Now, I’ll try to become a better rapper and put on great performances elsewhere other than Show Me The Money.” He became eliminated, but he left Show Me The Money 5 in style. #GUN emerged as the dark horse of Gil and Mad Clown’s team.","post_date":"2016-06-25","related_blog":[],"main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201606250115241112_1_99_20160625071105.jpg","thumb_2x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201606250115241112_1_99_20160625071105.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201606250115241112_1_99_20160625071105.jpg"}},"posts_order":[1826,1689,1694,1696,1380,1375,1373,1252,969,967,952,951,947,946,945,944,939,937,936,934,932,927,923,922,921,919,914,911,906,904,900,898,896,892,888,884,882,881,879,878,877,875,874,872,870,868,865,864,862,860,856,854,851,849,848,846,844,842,841,839,837,835,833,831,828,826,820,818,814,755,1840,1972],"hot_posts":[755]}