
{"events":{"1698":{"id":1698,"post_title":"BLACKPINK wraps up performances for their debut single… “Will come back quickly”","post_content":"[스포츠조선닷컴=정안지 기자] Rookie girl group BLACKPINK who took this summer by the storm has successfully rounded off performances for their debut single album.\r\nOn September 11, BLACKPINK gave the last performance for their debut single “SQUARE ONE” in SBS “INKIGAYO”. On the day, BLACKPINK took honorable No.1 in “INKIGAYO” with “WHISTLE”, one of the double title tracks of “SQUARE ONE”.\r\nBLACKPINK members expressed their gratitude to fans through their label YG Entertainment (“YG”), saying, “We made debut only a month ago and you have given us so much support. We’ll keep working hard, so that we can come back to you quickly. Please look forward to our comeback”.\r\nBLACKPINK was finally unveiled to the public on August 8 this year, under big spotlight. To live up to people’s big expectations for YG’s first rookie girl group in seven years, BLACKPINK left a big impression to the public, writing unprecedented records exceptional for a rookie upon their debut.\r\n▶ Causing seismic change in the music scene, with sensation created by “WHISTLE”!\r\nBLACKPINK was sensational from the very beginning. “WHISTLE” swept top ranks on the real-time, daily, and weekly charts of eight major music-streaming websites in Korea. Despite rush of new songs pouring onto charts, “WHISTLE” stayed in No.1 for 16 days in a row and also swept No.1 on six monthly charts, exerting unprecedentedly large influence. Notably, “WHISTLE” topped the digital, download, streaming, and mobile chart of Gaon Chart of August of 2016.\r\nBLACKPINK’s popularity went beyond Korea. It took No.1 on iTunes chart of 14 countries; seventh place on British Amazon’s “Rap &amp; Hip-Hop Hot New Release” chart; and No.1 on the weekly, popularity, music video, and K-pop music video chart of China’s biggest music-streaming website QQ Music. With such big success which is unbelievably exceptional for a rookie artist, BLACKPINK wrote new history in the music scene.\r\n▶ The icon of the “first and shortest”!\r\nBLACKPINK recorded so many “firsts” and “shortests” after their debut. BLACKPINK took their first No.1 in a TV music show within 14 days from their debut in SBS “INKIGAYO”, which was the shortest period of time ever recorded by a girl group. Plus, BLACKPINK took No.1 and No.2 on American Billboard’s World Digital Songs chart with “BOOMBAYAH” and “WHISTLE” within the shortest-ever period of time for a Korean girl group, to prove their big influence once again.\r\nThe official music videos of “BOOMBAYAH” and “WHISTLE” released on YouTube along with the songs are recording 34,660,099 views and 28,481,564 views, respectively, surpassing 60 million views in total.\r\nMusic fans are paying keen attention to BLACKPINK’s future to be unfolded after their successful debut.","post_date":"2016-09-12","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/2016091301000955600065691_99_20160912100804.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/2016091301000955600065691_99_20160912100804.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/2016091301000955600065691_99_20160912100804.jpg","excerpt":"BLACKPINK wraps up performances for their debut single… “Will come back quickly”","url_friendly_name":"blackpink-wraps-up-performances-for-their-debut-single-will-come-back-quickly","artist_id":602,"related_event":[1590,1592,1369]},"1703":{"id":1703,"post_title":"iKON’s second Japan arena tour has begun! Fascinating 8,000 fans","post_content":"[동아닷컴=곽현수 기자] iKON has successfully begun “iKON JAPAN TOUR 2016”, the second Japan arena tour since their debut, in the first show of the tour held in Chiba, Japan.\r\niKON proved their big popularity in Japan by fascinating more than 8,000 fans in the first show of their arena tour concert, which was held on September 10 and 11 at Makuhari Messe Event Hall in Chiba, Japan.\r\nWhen a piano music was played to open the show and iKON members appeared on the stage, the concert hall was filled up with fans’ acclamations. By the end of the opening performance, B.I shouted “Party People!” and then single “DUMB&amp;DUMBER” to be released on the 28 this month in Japan was played. All the fans at the show sang along the song with big acclamations.\r\nIn the show, iKON presented performances of their hit songs including rock version of “RHYTHM TA”, one of the double title tracks of iKON’s debut half album “WELCOME BACK”, as well as debut warm-up single “MY TYPE”. The team also performed “LOVE” which has not been released in Korea yet, as well as “SINOSIJAK REMIX” that drew much attention even before iKON’s official debut. Plus, another boy group WINNER’s member SONG MINHO appeared on the stage, to perform “FULL HOUSE” with iKON’s member BOBBY, to electrify fans. Unit team “MOBB” formed by WINNER’s SONG MINHO and iKON’s BOBBY is enjoying big popularity these days.\r\nWhile holding Japan arena tour, iKON will release “DUMB&amp;DUMBER”, their first original single in Japan, on September 28. The single will include Japanese versions of total four songs: “DUMB&amp;DUMBER”, “#WYD” that drew much popularity when released in Korea in May this year; “LOVE ME” which is released in Japanese first; and lastly “SINOSIJAK”.","post_date":"2016-09-12","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/80256876.1_99_20160912090507.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/80256876.1_99_20160912090507.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/80256876.1_99_20160912090507.jpg","excerpt":"iKON’s second Japan arena tour has begun! Fascinating 8,000 fans","url_friendly_name":"ikons-second-japan-arena-tour-has-begun-fascinating-8000-fans","artist_id":241,"related_event":[1620,1618]},"1705":{"id":1705,"post_title":"BLACKPINK Wins Another Trophy on Their Last TV Appearance, Proving itself a “monster rookie”","post_content":"&nbsp;\r\n\r\n\r\n\r\n[OSEN=박현민 기자] BLACKPINK won another trophy on their last TV appearance. With this, BLACKPINK won three no.1 trophies with its debut song and demonstrated that the group is indeed a “monster rookie”.\r\n\r\nOn the September 11 show of Inkigayo, BLACKPINK’s “WHISTLE” and “BOOMBAYAH” were both nominated for the no.1 spot, and “WHISTLE” won the spot. The song was pitted against Han Dong Geun’s ”Making A New Ending For This Story, a song that has climbed high up on the charts once again after it went down.\r\n\r\nAfter “WHISTLE” was announced as the no.1 song, BLACKPINK thanked YANG HYUN SUK and the YG staff for their efforts and the fans for their support. Their eyes filled up with tears.\r\n\r\nBLACKPINK took the no.1 spot on Inkigayo on August 21 and on M Countdown on September 8.When they were interviewed by the hosts of the show before their stage, BLACKPINK members said that their most memorable moment was when they first met the fans and when they first became no.1 on Inkigayo. The moment when they won their third trophy on their last TV appearance will surely be included on the list.\r\n\r\n\r\n\r\nAlso on Inkigayo that day, various other singers made a comeback. Gain made a comeback breaking her 18-month hiatus and performed her new songs “Secret” and ”Carnival”. Red Velvet sang “Lucky Girl” and “Russian Roulette”, and Tae Jin A performed “People’s Fate” along with Gangnam.\r\n\r\nIn addition, MOBB, a hiphop subunit consisting of MINO and iKON”s BOBBY, performed “HIT ME” and “FULL HOUSE” for the first time on stage.","post_date":"2016-09-11","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201609111642776111_57d50b26cc8ae_99_20160911165604.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201609111642776111_57d50b26cc8ae_99_20160911165604.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201609111642776111_57d50b26cc8ae_99_20160911165604.jpg","excerpt":"BLACKPINK Wins Another Trophy on Their Last TV Appearance, Proving itself a “monster rookie”","url_friendly_name":"blackpink-wins-another-trophy-on-their-last-tv-appearance-proving-itself-a-monster-rookie","artist_id":602,"related_event":[1626,1590]},"1721":{"id":1721,"post_title":"MOBB Performs “HIT ME” & “FULL HOUSE” For the First Time on Inkigayo","post_content":"\r\n\r\n[헤럴드POP=김지아 기자] Hiphop project duo MOBB (MINO &amp; BOBBY) reveals their new songs.\r\n\r\nOn September 11, MOBB, the subunit made up of WINNER’s MINO and iKON’s BOBBY, went up on the stage Inkigayo to sing their new songs for the first time. Their “HIT ME” and “FULL HOUSE performances were so exciting and full of energy that they almost made the audience feel as if they are at a party. MINO and BOBBY showed everything that they worked so hard for on stage, and the audience cheered loudly.\r\n\r\n“HIT ME” is an exciting upbeat song that sounds as if MINO and BOBBY exchange spontaneous raps. There are also parts that are homages to KUSH &amp; ZION.T’s “MACHINE GUN” and GD&amp;T.O.P’s “DON’T LEAVE”. “FULL HOUSE” is song that has witty lyrics on a heavy trap beat.\r\n\r\nMeanwhile, MOBB released their first album “THE MOBB”, which has “HIT ME” and “FULL HOUSE” as double title tracks, online on September 9. The album shows the unique and sophisticated rap of the two very special rappers.","post_date":"2016-09-11","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201609111629159211920_20160911163728_01_99_20160911163807-e1473802195811.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201609111629159211920_20160911163728_01_99_20160911163807-e1473802195811.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201609111629159211920_20160911163728_01_99_20160911163807-e1473802195811.jpg","excerpt":"MOBB Performs “HIT ME” & “FULL HOUSE” For the First Time on Inkigayo","url_friendly_name":"mobb-performs-hit-me-full-house-for-the-first-time-on-inkigayo","artist_id":1722,"related_event":[1721]},"1725":{"id":1725,"post_title":"[Round-up] BLACKPINK Ends Promotion with a Trophy and MOBB Debuts on Inkigayo","post_content":"\r\n\r\n&nbsp;\r\n\r\n[일간스포츠=이미현 기자] BLACKPINK wraps up the promotions for their debut album with a no.1 trophy on Inkigayo.\r\n\r\nOn SBS’s Inkigayo that aired from 3:30 on September 11, BLACKPINK’s “WHISTLE” became no.1.\r\n\r\nFor their acceptance speech, BLACKPINK said, “We would like to thank Mr. Yang and the staff.”\r\n\r\nThey went on to say, “It hasn’t been long since we debuted but our fans have shown us so much love. We would like to thank them.”\r\n\r\nBefore going up on the stage for their last stage, BLACKPINK said, “We’re sorry that this is our last stage. But we’ll never forget our debut stage on Inkigayo.”\r\n\r\nJISOO said, “I’ll cherish the memories of when I emceed the show last week. This will be our last stage, but we’ll come back soon with a great song. So wait for us!”\r\n\r\n\r\n\r\nMOBB’s also had their debut stage on Inkigayo that day.\r\n\r\nThey sang “HIT ME” and “FULL HOUSE” and heated up the party mood. They had such a strong presence that the stage looked full with only the two of them.\r\n\r\nTheir rap had a great flow and their performance was exciting. BOBBY’s powerful, rhythmical rap and MINO’s sexy and mystical rap created a great combination.\r\n\r\nMeanwhile, Tae Jin A, Homme, Gain, Vixx, MOBB, New East, Spika, Halo, Red Velvet, BLACKPINK, Laboum, Cosmic Girls, NCT Dream, and Mask appeared on Inkigayo on that day.","post_date":"2016-09-11","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/htm_20160911164422755732_99_20160911164504.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/htm_20160911164422755732_99_20160911164504.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/htm_20160911164422755732_99_20160911164504.jpg","excerpt":"[Round-up] BLACKPINK Ends Promotion with a Trophy and MOBB Debuts on Inkigayo","url_friendly_name":"round-up-blackpink-ends-promotion-with-a-trophy-and-mobb-debuts-on-inkigayo","artist_id":602,"related_event":[1626,1590]},"1760":{"id":1760,"post_title":"MINO & BOBBY’s MOBB to Perform New Songs For the First Time Today (Sep.11)","post_content":"[스포츠조선=조윤선 기자] MOBB, a sub-unit of WINNER’s MINO and iKON’s BOBBY, will perform its new singles for the first time on SBS’s Inkigayo.\r\n\r\nOn the September 11 show of SBS’s Inkigayo, MOBB will perform “HIT ME” and “FULL HOUSE”. Expectations are running high for their performances as they are sure to exhibit explosive energy and great chemistry on stage as “the perfect hiphop duo”.\r\n\r\nThrough its agency YG Entertainment, MOBB conveyed how they feel before their first TV appearance.\r\n\r\nMINO said, “I’m excited to perform the music that we have worked so hard at. I’ll do my best to put on a great performance. We have a lot prepared, lots of music and performances. We’ll continue to work hard, so be sure to check us out.”\r\n\r\nBOBBY commented, “We’ll not be on stage as iKON or WINNER, but MOBB. I’m happy to show you the music that I’ve always wanted to do. We’ve a lot of fans showing their support for us. I won’t let them down. This is only the beginning. This is not a one-off project but a long-term one.”\r\n\r\nMOBB will show off their explosive energy during their first performance and will continue to promote their songs through their promotion campaign “MOBB TOWN”.","post_date":"2016-09-11","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/2016091201000863200059471_99_20160911090604.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/2016091201000863200059471_99_20160911090604.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/2016091201000863200059471_99_20160911090604.jpg","excerpt":"MINO & BOBBY’s MOBB to Perform New Songs For the First Time Today (Sep.11)","url_friendly_name":"mino-bobbys-mobb-to-perform-new-songs-for-the-first-time-today-sep-11","artist_id":1722,"related_event":[1721]},"1738":{"id":1738,"post_title":"[Music Talk Talk] BLACKPINK Tops Everything, From Monthly Charts to Brand Power","post_content":"[OSEN=정준화 기자] It is in their DNA? BLACKPINK has been no.1 in everything ever since their debut. Not only did the group sweep the realtime online charts upon debut but also became no.1 on music shows and brand power, and it’s only been one month since they debuted.\r\n\r\nOn September 8, BLACKPINK’s “WHISTLE” became no.1 on Mnet’s M Countdown. This is especially meaningful since they never appeared on the show.\r\n\r\nIt’s BLACKPINK’s second no.1 trophy following the one they won on SBS’s Inkigayo on August 21. BLACKPINK will be rounding off their promotions for their debut album “SQAUARE ONE” with their appearance on Inkigayo this week. If BLACKPINK become no.1 on Inkigayo again this week, the group will be winning Inkigayo trophies for two weeks in a row. BLACKPINK is highly likely to win this week too as their online charts results are good.\r\n\r\nThe fact that BLACKPINK became no.1 on music shows with their debut song proves that the group has staying power. Already, the group has taken the online charts by storm with the title tracks of their debut album, “WHISTLE” and “BOOMBAYAH”. In particular, “WHISTLE” maintained the no.1 spot for almost a month, which is rare for a rookie’s song. BLACKPINK became no.1 on a music show in the shortest time among girl groups.\r\n\r\nBLACKPINK has also dominated the monthly charts. “WHISTLE” remains high on the charts of Melon, the biggest music streaming website in Korea. BLACKPINK also topped four Gaon charts in August including its digital chart, streaming chart, and download chart.\r\n\r\nAccording to the Korea Company Reputation Research Institute, BLACKPINK has the best brand reputation among girl groups. The Institute analyzed 40,887,502 bytes of data from August 9 to September 10 to find out which girl group has the biggest brand power. BLACKPINK scored the highest in participation index, media index, communication index, and reputation index, becoming the queen of girl groups.\r\n\r\nBLACKPINK was followed by other girl group in the order of I.O.I, Twice, GFriend, Red Velvet, Oh My Girl, Laboum, Girls’ Generation, Apink, Mamamoo, Tiara, AOA, Lovelyz, Girl’s Day, Sistar, Gugudan, Nine Muses, Wonder Girls, EXID, and April.\r\n\r\nBLACKPINK’s participation index stood at 4,038,400, media index at 225,126, communication index at 3,000,393, and brand reputation index at 7,468,3741. BLACKPINK’s brand reputation index was almost double of that of I.O.I, who came second with 4,127,257.\r\n\r\nIt’s not an exaggeration to say that there has never been a hotter girl group than BLACKPINK. This is why we are looking forward to seeing them more.","post_date":"2016-09-11","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/2016091301000955600065691_99_20160912100804.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/2016091301000955600065691_99_20160912100804.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/2016091301000955600065691_99_20160912100804.jpg","excerpt":"[Music Talk Talk] BLACKPINK Tops Everything, From Monthly Charts to Brand Power","url_friendly_name":"music-talk-talk-blackpink-tops-everything-from-monthly-charts-to-brand-power","artist_id":602,"related_event":[1626,1590]},"1736":{"id":1736,"post_title":"CL to Appear on CBS’s The Late Late Show","post_content":"[동아닷컴=장경국 기자] CL will appear on CBS’s main talk show all set to capture the hearts of US viewers.\r\n\r\nAt 12:35 on September 16 (EST), CL will appear on CBS’s The Late Late Show with James Corden. She will perform her new song “LIFTED” and talk about her life in the US.\r\n\r\nFirst aired in 1995, The Late Late Show is broadcasted not only in the US but also in around the world in countries like Canada, New Zealand, Australia, and the UK via CBS’s partner channels.\r\n\r\nOn August 19, CL released her first US single “LIFTED” for her official US debut. It is very rare for a Korean musician to appear on a show of one of America’s three major broadcasting stations, and it shows that CL has global presence and great potential to do well in the US.\r\n\r\nMeanwhile, CL’s “LIFTED” ranked 17th on Billboard’s Social Chart 50 and 12th on iTunes Top 40 US Hiphop Chart. The song was also chosen as Apple Music’s Best of the Week songs and covered by major media outlets such as The Time, Entertainment Weekly, and USA Today.","post_date":"2016-09-10","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/80237193.1_99_20160910110403.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/80237193.1_99_20160910110403.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/80237193.1_99_20160910110403.jpg","excerpt":"CL to Appear on CBS’s The Late Late Show","url_friendly_name":"cl-to-appear-on-cbss-the-late-late-show","artist_id":1585,"related_event":[1721]},"1730":{"id":1730,"post_title":"BOBBY’s “HOLUP!” and MINO’s “BODY” Hit a Total of 5 Million Views","post_content":"[OSEN=선미경 기자] iKON’s BOBBY and WINNER’s MINO each released solo tracks a couple of days ago, and the music videos posted three and two million views, respectively.\r\n\r\nBOBBY’s “HOLUP!” music video was released on September 7, and in just a day, the music video posted a million views. And then, as of 8 AM on September 10, it surpassed three million views at 3,285,297.\r\n\r\nMINO’s “BODY” music video was released a day after BOBBY’s, and it hit a million views in just a day. As of 8 AM on September 10, it surpassed two million views at 2,478,314.\r\n\r\nBOBBY’s “HOLUP!” music video features home-party like scenes, colorful CG effects, and BOBBY’s fit body. BOBBY looks tough and energetic in the music video.\r\n\r\nMINO’s “BODY” music video consists of sensual and dreamlike scenes and shows MINO’s masculine side. The swimming pool kiss scene has become a big issue as it shows that MINO is no longer a boy any more.\r\n\r\nAfter their successful debut as solo artists, BOBBY and MINO’s sub-unit MOBB released “HIT ME” and “FULL HOUSE” on September 9. In just two days after the release, their songs topped the iTunes charts in Hong Kong, Indonesia, Malaysia, Taiwan, Thailand, and Vietnam.\r\n\r\nThe music videos of “HIT ME” and “FULL HOUSE”, which were uploaded on Naver TV Cast and Youtube, posted 1,747,770 views combined.\r\n\r\nMeanwhile, MOBB is to perform their two songs for the first time on SBS’s Inkigayo on September 11. They will continue to promote the new songs through a promotion campaign titled “MOBB TOWN”.","post_date":"2016-09-10","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201609100814773753_57d342b915948_99_20160910081704.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201609100814773753_57d342b915948_99_20160910081704.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201609100814773753_57d342b915948_99_20160910081704.jpg","excerpt":"BOBBY’s “HOLUP!” and MINO’s “BODY” Hit a Total of 5 Million Views","url_friendly_name":"bobbys-holup-and-minos-body-hit-a-total-of-5-million-views","artist_id":514,"related_event":[1575]},"1605":{"id":1605,"post_title":"BLACKPINK Unveiled for the First Time on Inkigayo","post_content":"[스포츠조선닷컴=정안지 기자] YG Entertainment’s new girl group BLACKPINK is unveiled on Inkigayo.\r\n\r\nBLACKPINK performed “WHISTLE” and “BOOMBAYAH” on stage for the first time on SBS’s Inkigayo on August 14.\r\n\r\n\r\n\r\nBLACKPINK is YG Entertainment’s first new girl group after the company launched 2NE1 seven years ago.\r\n\r\nUpon release, BLACKPINK’s songs became no.1 on iTunes worldwide charts, and expectations were running high for BLACKPINK’s first ever performance.\r\n\r\nBLACKPINK put on a flawless stage, so much so that it was hard to believe that it was their debut performance.\r\n\r\nAs they have been trainees for a long time, BLACKPINK members sang and danced to the songs perfectly, making the fans fall in head over heels in love with them.\r\n\r\n“BOOMBAYAH” is a fast-tempo song with a beat exciting enough to chase the hot summer’s heat away, and “WHISTLE” is a sexy and hypnotizing hip-hop song.","post_date":"2016-09-09","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_5.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_5.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_5.jpg","excerpt":"BLACKPINK Unveiled for the First Time on Inkigayo","url_friendly_name":"blackpink-unveiled-for-the-first-time-on-inkigayo","artist_id":602,"related_event":[1590]},"1578":{"id":1578,"post_title":"[Oh! Music] BLACKPINK’s never-ending popularity… No.1 in TV music show again","post_content":"[OSEN=선미경 기자] BLACKPINK’s popularity never ends. BLACKPINK is creating sensation continuously, in the second week of September, the time when they are giving the last performance for their debut single. In cable channel Mnet’s “M-Countdown” that was live-broadcasted on September 8 in the evening, BLACKPINK took their first No.1 in the show with debut song “WHISTLE”. Such achievement is all the more meaningful, as they took No.1 without appearance in the show.\r\nThe No.1 in “M-Countdown” is the second No.1 in a TV music show for BLACKPINK, following the first No.1 in SBS “INKIGAYO” on the 21 last month. BLACKPINK will wrap up performances for their debut single “SQUARE ONE”, with a performance in this week’s “INKIGAYO” (exclusively reported by OSEN). If BLACKPINK takes No.1 in this week’s “INKIGAYO” that will not be aired because the day is Thanksgiving holiday, BLACKPINK will practically take No.1 in the show for two weeks in a row. Considering records on charts, BLACKPINK is highly likely to take No.1 in this week’s “INKIGAYO”.\r\nBLACKPINK released debut single “SQUARE ONE” on the 8 last month, to hit music charts by the storm with double title tracks “WHISTLE” and “BOOMBAYAH”. Notably, “WHISTLE” stayed in No.1 on charts for about a month, recording a long-run hit so exceptionally for a rookie. The team also took No.1 in a public TV’s music show within the shortest-ever period of time since debut for a rookie girl group. Because of such big popularity they enjoyed upon their debut, BLACKPINK has given performances for a longer period than originally scheduled.\r\nAn YG insider said, “BLACKPINK will give a TV performance on September 11 and that will be the last performance for their debut single album. We’re especially grateful for fans’ support much greater than we expected. Even though BLACKPINK gave their performances for a period longer than originally planned, that was still not enough to fully satisfy fans, so we’re really sorry. Instead, BLACKPINK will put more focus on preparation for their new songs. We believe that BLACKPINK’s comeback with quality music is the way to reward for fans’ support. BLACKPINK will meet fans in more diverse channels for the next album”.\r\nEven though it has already been about a month since the release of “WHISTLE”, the song is still enjoying great popularity, taking No.1 in a TV music show. Already, BLACKPINK wrote history when they took No.1 in TV music show “INKIGAYO” in two weeks of their debut, the shortest-ever period of time for a rookie girl group. That proved BLACKPINK’s formidable potential.\r\nThat is not all. BLACKPINK’s “WHISTLE” is enjoying long-run popularity, staying in top ranks on Korea’s biggest music-streaming website Melon. The song wrote an unprecedented record on Gaon Chart as well, taking No.1 on four of its charts including digital chart, streaming chart, and download chart. By sweeping August’s Gaon chart, BLACKPINK proved their potential as a “monstrous rookie” once again.\r\nBLACKPINK even took No.1 and No.2 with “BOOMBAYAH” and “WHISTLE” on American Billboard’s World Digital Songs chart, going beyond Korea. Such record further raised fans’ expectations for BLACKPINK’s future.\r\nBLACKPINK is the most promising rookie artist of this year. BLACKPINK proved their potential as the super rookie once again, by taking No.1 on four charts of August’s Gaon Chart. The four girls are firmly building their career by sweeping Gaon’s digital, streaming, as well as download charts. By dominating August’s monthly charts of Gaon, BLACKPINK hit the music scene by the storm again.\r\nWhat is even more notable about BLACKPINK is the fact that “WHISTLE” is still staying in high ranks on music charts. The song is enjoying long-run popularity, staying in high places on Korea’s biggest music-streaming website Melon. Music fans are paying keen attention now to how long BLACKPINK’s popularity will continue despite rush of other artists’ new songs.","post_date":"2016-09-09","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/블랙핑크.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/블랙핑크.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/블랙핑크.jpg","excerpt":"[Oh! Music] BLACKPINK’s never-ending popularity… No.1 in TV music show again","url_friendly_name":"oh-music-blackpinks-never-ending-popularity-no-1-in-tv-music-show-again","artist_id":602,"related_event":[1369,1268]},"1577":{"id":1577,"post_title":"SONG MINHO X BOBBY’s unit team MOBB took No.1 on iTunes chart of 4 Asian countries","post_content":"[엑스포츠뉴스=정지원 기자] “MOBB”, a unit boy group of WINNER’s SONG MINHO and iKON’s BOBBY, is recording success on foreign charts.\r\nMOBB’s new song “HIT ME” and “FULL HOUSE” released on September 9 at 0AM took No.1 on iTunes chart of four Asian countries: Hong Kong, Indonesia, Taiwan, and Thailand.\r\n“HIT ME” is a quick and exciting hip-hop song that tells friends to “hang out” together. “FULL HOUSE” is a hip-hop song that talks about a man who says, “I’m always surrounded by women”. The song well-expresses hip-hop genre’s unique swag.\r\nSONG MINHO and BOBBY catch the eyes in the music video of “FULL HOUSE”, boasting their appeals in turn as if they compete against each other. The sensual and fancy colors in the video, as well as the two rappers’ comfortable but groovy performance leave big impression. Notably, CL from YG appears in the video to support the two colleague rappers, drawing keen attention.\r\n“MOBB” took No.1 on overseas albums chart of iTunes of four countries: Hong Kong, Indonesia, Taiwan, and Thailand. In addition, it entered top 10 on iTunes chart of 12 countries: No.2 on the chart of Malaysia, Philippines, and Singapore; No.3 in Finland; No.5 in Hungary; No.8 in Sweden and Denmark; and No.9 in Mexico. It is also placed in the 23rd place on iTunes chart of the United States. \r\nIn the meantime, “MOBB” will unveil the performance of their double digital singles in SBS “INKIGAYO” to be aired on the 11.","post_date":"2016-09-09","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/MOBB_6.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/MOBB_6.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/MOBB_6.jpg","excerpt":"SONG MINHO X BOBBY’s unit team MOBB took No.1 on iTunes chart of 4 Asian countries","url_friendly_name":"song-minho-x-bobbys-unit-team-mobb-took-no-1-on-itunes-chart-of-4-asian-countries","artist_id":514,"related_event":[1575]},"1575":{"id":1575,"post_title":"BOBBY & MINHO’s unit team MOBB took No.1 on iTunes chart of 7 countries… 19th in American iTunes","post_content":"[OSEN=선미경 기자] “MOBB”, a unit team of WINNER’s SONG MINHO and iKON’s BOBBY, is proving their big popularity not only in Korea but also overseas, taking No.1 on iTunes albums chart of seven countries.\r\n“MOBB”s debut album with double title tracks “HIT ME” and “FULL HOUSE” released on September 9 at 0AM took No.1 on iTunes albums chart of seven countries as of September 9 at 1PM. Notably, MOBB took the 19th place on iTunes albums chart of the United States, the birthplace of hip-hop, to draw even more attention. \r\n“HIT ME” is a quick and exciting hip-hop song that tells friends to “hang out” together. “FULL HOUSE” is a hip-hop song that talks about a man who says, “I’m always surrounded by women”. The song well-expresses hip-hop genre’s unique swag. The two songs are appealing to both hip-hop fans and general music fans, well-displaying the “special chemistry” between SONG MINHO and BOBBY.\r\n\r\nMusic videos released with the songs are also drawing keen attention. The video of “HIT ME” well-displays the unrestrained performances of free and easy SONG MINHO and BOBBY. Notably, the video unveils SONG MINHO and BOBBY’s rooms, as well as their guerilla performance given in Itaewon, Seoul, which electrified audience.\r\nSONG MINHO and BOBBY catch the eyes in the music video of “FULL HOUSE”, boasting their appeals in turn as if they compete against each other. The sensual and fancy colors in the video, as well as the two rappers’ comfortable but groovy performance leave big impression. Notably, CL from YG appears in the video to support the two colleague rappers, drawing keen attention.\r\nIn the meantime, “MOBB” will unveil the performance of the two songs for the first time in SBS “INKIGAYO” to be aired on September 11. Then, large-scale promotion “MOBB TOWN” in which MOBB will meet many fans will be carried out.\r\n","post_date":"2016-09-09","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/MOBB_6.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/MOBB_6.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/MOBB_6.jpg","excerpt":"BOBBY & MINHO’s unit team MOBB took No.1 on iTunes chart of 7 countries… 19th in American iTunes","url_friendly_name":"bobby-minhos-unit-team-mobb-took-no-1-on-itunes-chart-of-7-countries-19th-in-american-itunes","artist_id":514,"related_event":[1378,1140]},"1378":{"id":1378,"post_title":"MINO X BOBBY, the winners who became the icon of hip-hop [Debut of MOBB]","post_content":"[OSEN=정준화 기자] This two have broken the prejudice against “idol rappers”. They beat underground rappers who disrespected idol rappers in rapper competition show “Show Me the Money” of Mnet, solely with their own talent. This is the story of WINNER’s SONG MINHO and iKON’s BOBBY who have become the icon of hip-hop.\r\n\r\nThe two’s victory has exerted great influence in the music scene. After BOBBY became the winner of “Show Me the Money 3″ and SONG MINHO became the runner-up of “Show Me the Money 4″, people’s perspective of idol singers has substantially changed. The two proved the fact that idol rappers are not just pretty boys who spit out a few words in a “commercially-produced” boy bands. Then, they got recognized not only by the public but also by rival rappers.\r\n\r\nOf course, their talent was not built just overnight. Since the days of debut survival audition “WIN” aired on Mnet, the two competed against each other while working together as close colleagues, exchanging big influences. Then, SONG MINHO joined WINNER and BOBBY joined iKON to build diverse experiences on the stage. In short, the two gained solid talent and skills in the process of going through hard-training and survival competition for debut.\r\n\r\nSuch two men have now teamed up together. The new team of SONG MINHO and BOBBY, named “MOBB”, is carrying out three-day-long bold debut project of releasing solo tracks of each one first and then releasing the team’s new songs.\r\n\r\n\r\n\r\nBOBBY laid the foundation for the success of the project first, presenting his flagship energetic and bold flow and witty lyrics. BOBBY made a successful solo debut by releasing his solo track “HOLUP!” on September 7 at 0AM. The song is staying in top ranks on the real-time charts of a variety of music-streaming websites. .\r\nThe song boasts monstrously intense mood and mesmerizing repeat part. Its lyrics are straightforward and outspoken. Just as the lyrics that say “This song will make everyone feel drunken”, BOBBY’s rap and manly appeal mesmerize listeners like strong liquor.\r\nSONG MINHO is as fascinating as BOBBY. He is revealing his irresistible appeal in new song “BODY” released on September 8. The song is subtly and delicately appealing, just as the title itself indicates. SONG MINHO’s flagship comfortable flow creates perfectly harmony, revealing his charisma. The perfect combination between rap and hook of catchy melody is also so fresh and fascinating. \r\nThe encounter of such two differentiated artists is expected to create a big synergy. The climax of the three-day-long promotion will be the release of double digital single “HIT ME” and “FULL HOUSE” on September 9. \r\nNot only the two’s fans but also music industry insiders are paying keen attention to the synergy to be created by “MOBB”. ","post_date":"2016-09-08","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/MOBB_5.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/MOBB_5.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/MOBB_3.jpg","excerpt":"MINO X BOBBY, the winners who became the icon of hip-hop [Debut of MOBB]","url_friendly_name":"mino-x-bobby-the-winners-who-became-the-icon-of-hip-hop-debut-of-mobb","artist_id":514,"related_event":[]},"1370":{"id":1370,"post_title":"Today (Sep, 8), SONG MINHO X BOBBY video-records performance for “INKIGAYO” to be aired on the 11… Departing to Japan on the 9","post_content":"[스타뉴스=길혜성 기자] WINNER’s SONG MINHO and iKON’s BOBBY have formed a unit team and the team is to give their first TV performance on September 8.\r\n\r\nThe name of SONG MINHO and BOBBY’s unit team is MOBB, a combination of letters in English name MINO and BOBBY. MOBB will release their double digital singles “HIT ME” and “FULL HOUSE” on a variety of music-streaming websites on September 9 at 0AM.\r\n\r\nMOBB will give their first TV performance in SBS “INKIGAYO” to be aired on September 11 in the evening, to unveil the performance of “HIT ME” and “FULL HOUSE” for the first time.\r\n\r\n“INKIGAYO” is a live-broadcasted TV music show, so artists give live performances for the show. However, inevitably, MOBB will video-record their performance on September 8 in Seoul, for “INKIGAYO” of this week.\r\n\r\nThat is because iKON for which BOBBY is a member will begin new Japan tour “iKON JAPAN TOUR 2016″ on the 10 this month.\r\n\r\niKON successfully finished their first Asia tour “iKONCERT 2016 SHOWTIME TOUR” on the 3 this month, in Jakarta, Indonesia. Now, beginning from a show on September 10 and 11 at Makuhari Messe Event Hall in Chiba, Japan, iKON will host 16 shows in six cities in Japan including Aichi, Osaka, Kobe, Fukuoka, and Tokyo, until the end of October.\r\n\r\nWINNER’s SONG MINHO will perform in iKON’s Japan tour as a special guest performer.\r\n\r\nBOBBY and SONG MINHO will depart to Japan for the tour on the 9, so they have to pre-record their performance for “INKIGAYO” to be broadcasted on September 11.\r\n\r\nIn the meantime, BOBBY’s solo debut song “HOLUP!” released on the 7 and SONG MINHO’s solo song “BODY” released on the 8 are enjoying big popularity on charts.","post_date":"2016-09-08","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/MOBB_3.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/MOBB_3.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/MOBB_3.jpg","excerpt":"Today (Sep, 8), SONG MINHO X BOBBY video-records performance for “INKIGAYO” to be aired on the 11… Departing to Japan on the 9","url_friendly_name":"today-sep-8-song-minho-x-bobby-video-records-performance-for-inkigayo-to-be-aired-on-the-11-departing-to-japan-on-the-9","artist_id":514,"related_event":[]},"1369":{"id":1369,"post_title":"BLACKPINK took No.1 on August’s Gaon Chart… Living up to their nickname of “monstrous rookie”","post_content":"[OSEN=선미경 기자] Girl group BLACKPINK’s debut song “WHISTLE” took No.1 on August’s monthly chart of Gaon Chart.\r\n\r\nAccording to Gaon Chart on September 8, BLACKPINK’s “WHISTLE” took No.1 on the digital chart, streaming chart, and download chart for August.\r\n\r\nNo.2 in August’s monthly digital chart is Standing Egg’s “Summer Night, You and I”; No.3 is Wonder Girls’ “Why So Lonely”; No.4 is GFRIEND’s “NAVILLERA”; and No.5 is Han Dong-geun’s “Making a new ending for this story”.\r\nNo.1 on August’s Gaon albums chart is EXO’s “LOTTO – The 3rd Album Repackage (Korean Ver.)” that has sold total 223,953 records. No.2 on the albums chart is EXO’s ‘LOTTO – The 3rd Album Repackage (Chinese Ver.)” that recorded 115,217 sales. No.3 is VIXX’s “Hades” that recorded 97,222 sales. \r\nOn Gaon’s weekly chart, digital chart, and on-line download chart for the 36th week of the year 2016, Han Dong-geun’s “Making a new ending for this story” took No.1 after climbing up the ranks again. ","post_date":"2016-09-08","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP.jpg","excerpt":"BLACKPINK took No.1 on August’s Gaon Chart… Living up to their nickname of “monstrous rookie”","url_friendly_name":"blackpink-took-no-1-on-augusts-gaon-chart-living-up-to-their-nickname-of-monstrous-rookie","artist_id":602,"related_event":[]},"1367":{"id":1367,"post_title":"MINO & BOBBY’s MOBB to Release New Songs and Do a V App Show Today","post_content":"[동아닷컴=홍세영 기자] MINO &amp; BOBBY’s MOBB to Release New Songs and Do a V App Show Today\r\nMOBB, a subunit consisting of WINNER’s MINO and iKON’s BOBBY, will release “HIT ME” and “FULL HOUSE” at 12 AM on September 9, and to raise the expectations even more, a poster with a countdown timer has been released.\r\nAt 4 PM on September 8, YG Entertainment uploaded a poster with a timer counting down to the debut of MOBB on its official blog (www.yg-life.com).\r\nThe poster also features MINO and BOBBY looking fierce in black suits and heavy makeup.\r\nThe debut of MOBB is especially interesting as it is taking place right after the two rappers each released solo songs. On September 7, BOBBY successfully debuted as a solo musician with “HOLUP!”, a hard rap song with a strong beat. Then on the next day, MINO released his solo single “BODY” and captured the hearts of the fans with his dreamy-like and melodic rap. Fans have high hopes for the new subunit as it will surely bring the best out of the two unique rappers and create a great synergy effect.\r\nMINO and BOBBY participated in writing the lyrics of “HIT ME” and “FULL HOUSE”. YG’s top producers such as TEDDY, KUSH, CHOICE 37, and SEO WON JIN participated in making the songs.\r\n\r\nYG Entertainment also announced the promotion plans for MOBB, a.k.a the MOBB TOWN plan, at 10 AM on September 8. The promotion campaign will consist of doing “MOBB TOWN LIVE”, a V App live show starting a hour before the release of MOBB’s new songs; holding “MOBB COLLAB”, a collaboration event with PBA in Itaewon on September 9; opening a pop-up store called the “MOBB STORE” in Itaewon during September; and holding a party titled “MOBB NIGHT” on September 22 to celebrate the release of their album.\r\nMeanwhile, MOBB’s “HIT ME” and “FULL HOUSE” will be released online along with the music videos at 12 AM on September 9, and the debut mini album will also be sold in offline stores. MOBB will perform the two songs on SBS’s Inkigayo on September 11. ","post_date":"2016-09-08","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/MOBB_2.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/MOBB_2.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/MOBB_2.jpg","excerpt":"MINO & BOBBY’s MOBB to Release New Songs and Do a V App Show Today","url_friendly_name":"mino-bobbys-mobb-to-release-new-songs-and-do-a-v-app-show-today","artist_id":514,"related_event":[]},"1364":{"id":1364,"post_title":"MV of BLACKPINK’s “WHISTLE+BOOMBAYAH” reached 30 million views… BLACKPINK syndrome","post_content":"[엑스포츠뉴스=전아람 기자] The official music videos of “WHISTLE” and “BOOMBAYAH”, the double title tracks of girl group BLACKPINK’s debut album, have surpassed 30 million views.\r\n\r\nAs of August 19 at 8AM, “WHISTLE” and “BOOMBAYAH”, the double title tracks of BLACKPINK’s debut single album “SQUARE ONE”, recorded 14,447,441 views and 16,826,103 views, respectively, reaching total 31,273,544 views in combination. Those are exceptional numbers hard to attain for a rookie artist.\r\n\r\nPlus, BLACKPINK’s “WHISTLE” and “BOOMBAYAH” are in the first and second place, respectively, on K-pop weekly chart of China’s biggest music-streaming website QQ Music.\r\n\r\nBLACKPINK is exerting a big influence on the charts of Chinese and Korean music-streaming websites, staying in top ranks. At the same time, “WHISTLE” is in No.1 on the real-time charts of three major music-streaming websites: NAVER Music, Monkey 3, and Soribada. Furthermore, “WHISTLE” reclaimed No.1 on Melon’s chart.\r\n\r\nAs such, BLACKPINK is creating sensation in the music scene, sweeping No.1 on the real-time, daily, and weekly charts of all music-streaming websites in Korea, No.1 on iTunes charts of 14 countries, and No.1 and No.2 on American Billboard’s World Digital Songs chart.","post_date":"2016-09-08","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/160805BP_D-3_GROUP2_clean.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/160805BP_D-3_GROUP2_clean.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/160805BP_D-3_GROUP2_clean.jpg","excerpt":"MV of BLACKPINK’s “WHISTLE+BOOMBAYAH” reached 30 million views… BLACKPINK syndrome","url_friendly_name":"mv-of-blackpinks-whistleboombayah-reached-30-million-views-blackpink-syndrome","artist_id":602,"related_event":[]},"1153":{"id":1153,"post_title":"[Exclusive] MINO to Release a New Single on September 8 with a Revised MV","post_content":"[스타뉴스=길혜성 기자] WINNER’s MINO is about to release a solo single titled “BODY”, and its music video was too sexy that it had to be edited and modified.\r\nMINO’s “BODY” will be released at 12 AM on September 8. The song is written by MINO and co-composed by MINO and FUTURE BOUNCE, a team of producers. Earlier on, YG announced that “BODY” is a slow hiphop song that has a mystical and sensual feel to it.\r\nSince it is a sexy song, YG Entertainment and YANG HYUN SUK put in extra care to make a good music video, but it wasn’t a smooth process.\r\nAn YG official told Star News on September 7, “We had to shoot the music video twice. We weren’t satisfied with the first version of the music video although it was 100% complete. So we decided to shoot another one”.\r\nHe went on to say, “Before the shooting for the second one began, YANG HYUN SUK said that he wanted the music video to be sexy as ‘BODY’ is a sexy song and it wasn’t conveyed well in the first version. Then, MINO went over the top and the music video became too sexy, which made YANG HYUN SUK laugh.”\r\nHe added, “The second music video was good, but it was too sexy. So we had to edit and modify it to come up with a final version. The final music video will be released at 12 AM on the 8th along with the song. The first version of the ‘BODY’ music video will also be released later and it will of course be R-rated.”\r\nMeanwhile, iKON’s BOBBY released his solo single “HOLUP!” on September 7. BOBBY and MINO formed a sub unit group called “MOBB” and will release “HIT ME” and “FULL HOUSE” on September 9.","post_date":"2016-09-07","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/MINO.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/MINO.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/MINO.jpg","excerpt":"[Exclusive] MINO to Release a New Single on September 8 with a Revised MV","url_friendly_name":"exclusive-mino-to-release-a-new-single-on-september-8-with-a-revised-mv","artist_id":514,"related_event":[]},"1151":{"id":1151,"post_title":"GD’s V-LIVE broadcasting today… “GD’s great sense of humor will be revealed”","post_content":"[OSEN=박소영 기자] BIGBANG’s G-DRAGON is meeting fans on V-APP, following DAESUNG who did V-LIVE broadcasting for the first time among BIGBANG members.\r\nG-DRAGON hosts V-LIVE broadcasting titled “G-DRAGON ON-AIR”, on September 7 at 7PM. He will create special memories with fans, closely communicating with them in premium live-broadcasting.\r\nBIGBANG has hosted V-APP live-broadcasting once every week since the 31st last month. The broadcasting will be aired for a month. DAESUNG was the first one to have a pleasant time with fans in V-LIVE broadcasting, engaging in “one to five” game with fans.\r\nG-DRAGON is the second BIGBANG member to do the broadcasting. On the 14 this month, TAEYANG; on the 19, T.O.P; and on the 28, SEUNGRI will meet fans in live-broadcasting.\r\nBIGBANG is continuing to draw keen attention from fans, presenting special gifts for fans in celebration of the 10thanniversary of their debut. ","post_date":"2016-09-07","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/GD.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/GD.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/GD.jpg","excerpt":"GD’s V-LIVE broadcasting today… “GD’s great sense of humor will be revealed”","url_friendly_name":"gds-v-live-broadcasting-today-gds-great-sense-of-humor-will-be-revealed","artist_id":454,"related_event":[]},"1138":{"id":1138,"post_title":"[Exclusive] BLACKPINK to Make Their Last TV Appearance on September 11 to Prepare for their New Album","post_content":"[OSEN=선미경 기자] BLACKPINK will end their promotions for their debut album “SQUARE ONE” after appearing on Inkigayo this weekend.\r\n\r\nOn September 6, sources confirmed that BLACKPINK will appear on SBS’s Inkigayo on September 11 and then end their debut album promotions. Inkigayo will not air during the Chuseok holiday season, so BLACKPINK’s last TV appearance will take place on September 11.\r\n\r\nBLACKPINK released their debut album “SQUARE ONE” on August 8, and its title tracks—“WHISTLE” and “BOOMBAYAH”—swept the charts. “WHISTLE” kept the no.1 spot on the charts for almost a month, which is rare for a rookie. BLACKPINK also became the girl group that topped music show charts in the shortest time. Because of their enormous popularity, BLACKPINK’s promotions went on longer than originally planned.\r\n\r\nYG officials said, “BLACKPINK will be doing their last TV appearance on September 11 and end their debut album promotions. We thank the fans for their support. We’re sorry that BLACKPINK could not do promotions for longer although it was longer that what we’ve planned. BLACKPINK will be working hard on the new album from now on. We think that releasing a good album is the only way to reciprocate the fans’ love. BLACKPINK will do a wider range of promotions for their next album”.\r\n\r\nBLACKPINK is the first girl group that YG launched in seven years, and upon debut, the group took Korea’s pop music scene by storm. They proved that they have the talent and the looks with their debut album, and expectations are running high for their next album.","post_date":"2016-09-06","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP.jpg","excerpt":"[Exclusive] BLACKPINK to Make Their Last TV Appearance on September 11 to Prepare for their New Album","url_friendly_name":"exclusive-blackpink-to-make-their-last-tv-appearance-on-september-11-to-prepare-for-their-new-album","artist_id":602,"related_event":[]},"1123":{"id":1123,"post_title":"[Exclusive] SONG MINHO X BOBBY's unit team MOBB to perform in \"INKIGAYO\" on September 11","post_content":"[OSEN=김보라 기자] WINNER’s SONG MINHO and iKON’s BOBBY will make their debut as a unit on September 9, and have also confirmed their performance on SBS' \"INKIGAYO\" on September 11.\r\nAccording to multiple broadcasting insiders on September 5, “MOBB”, the name of SONG MINHO and BOBBY’s unit team, will perform two songs on “INKIGAYO” to be live-broadcasted on Sunday this week (September 11).\r\nMOBB's double digital single and two music videos will be unveiled on September 9 at 0 o’clock (Korea time) and one day before, on September 8, “BODY” written by SONG MINHO (co-produced by FUTURE BOUNCE) will be released. Plus, On September 7, BOBBY’s intense hip-hop song “HOLUP!” will be released. So, the two are releasing new songs for three consecutive days.\r\nThe duo debut of rappers from different teams of the same label is expected to draw keen attention from the music scene and music fans.","post_date":"2016-09-06","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/MOBB.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/MOBB.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/MOBB.jpg","excerpt":"[Exclusive] SONG MINHO X BOBBY's unit team MOBB to perform in \"INKIGAYO\" on September 11","url_friendly_name":"exclusive-song-minho-x-bobbys-unit-team-mobb-to-perform-in-inkigayo-on-september-11","artist_id":514,"related_event":[]},"1140":{"id":1140,"post_title":"SONG MINHO X BOBBY teamed up as “MOBB”… Coming back as a unit team on the 9","post_content":"[헤럴드POP=박수인 기자] The hidden strategy of YG Entertainment (“YG”) has been unveiled: the comeback of a unit team consisting of WINNER’s SONG MINHO and iKON’s BOBBY.\r\nYG announced BOBBY’s solo comeback on September 7 and SONG MINHO’s solo release on September 8. As the two are the main rappers of iKON and WINNER, respectively, the two’s coinciding solo comeback and competition between them have been drawing keen attention. Now that YG announced on September 5 that SONG MINHO and BOBBY are coming back on September 9 together in a unit team, not as solo artists separately, SONG MINHO and BOBBY are going to collaborate, not competing against one another.\r\nThe name of SONG MINHO and BOBBY’s team is “MOBB”, which is combination of letters in the two’s names. “Mob” in English word “flash mob” means crowd, and “Mobb” in Swedish means a rioter. The promotion for “MOBB” carried out for three consecutive days like a festival is all the more special and even surprising, as YG has never done such kind of promotion in the past 20 years and there has been no unit team consisting of members of different YG teams.\r\nNotably, “MOBB” will release four songs along with four music videos. Considering the widely-known fact that YG artists release their new songs usually behind the schedule and they even just throw completed music videos away if those videos are not satisfactory, releasing four music videos of SONG MINHO and BOBBY unit in three days in a row demonstrates how thoroughly YG has been working on the unit team’s comeback for a long time.\r\nFurthermore, on September 5 at 11AM, YG Entertainment unveiled a teaser poster that announces the comeback of SONG MINHO and BOBBY’s unit team on the company’s official blog.\r\nThe teaser image shows “MOBB”, the name of the unit team of “MINOXBOBBY”, also saying that the team’s double digital single will be released on September 9 at 0 o’clock along with two music videos. In the teaser, SONG MINHO and BOBBY are looking into the camera with charismatic eyes and faces.\r\nBOBBY is the main rapper of iKON and the winner of “Show Me the Money” show in 2014 and SONG MINHO is the main rapper of WINNER, who was the runner-up of “Show Me the Money” show in 2015. The two have always been in a competing relationship from the days when they competed against each other in debut survival audition “WIN” before their debut, all the way up until recently. Therefore, many music fans are paying keen attention to what kind of music and performance will be presented by the two’s unit team “MOBB”.","post_date":"2016-09-05","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/MOBB.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/MOBB.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/MOBB.jpg","excerpt":"SONG MINHO X BOBBY teamed up as “MOBB”… Coming back as a unit team on the 9","url_friendly_name":"song-minho-x-bobby-teamed-up-as-mobb-coming-back-as-a-unit-team-on-the-9","artist_id":514,"related_event":[]},"1143":{"id":1143,"post_title":"SONG MIN HO of WINNER to Release a Solo Single Titled “BODY” on September 8","post_content":"[enews24=전수미 기자] Following the teaser poster of BOBBY’s solo single “HOLUP!”, the teaser image of SONG MIN HO’s solo single “BODY” has been revealed.\r\n\r\nSONG MIN HO will release his solo single only a day after BOBBY’s solo single, which will be released on September 7. With only several days to go until the release date, they both have revealed the titles of their solo singles.\r\n\r\nIt is interesting that the rappers of iKON and WINNER, groups that are both signed to YG Entertainment, are releasing solo singles with only a day apart from each other. BOBBY was the winner of Show Me The Money in 2014 and SONG MIN HO was the runner-up in 2015, and so there always has been slight competition and tension between the two rappers.\r\n\r\nYG Entertainment commented, “They are in different groups now, but they have been close friends for years since they were trainees. BOBBY’s “HOLUP!” is a song with a powerful beat and SONG MIN HO’s “BODY” is a mystical sexy song with a slow beat. Because they are very different songs, you won’t feel that they are competing against each other.”\r\n\r\nThey went on to say, “Because they are releasing solo singles almost at the same time, they have each other to rely on when promoting their singles.”\r\n\r\nSONG MIN HO wrote the lyrics of his new single on his own and the music together with FUTURE BOUNCE. FUTURE BOUNCE is a team that consists of producers PK and DEE.P. The team has worked with WINNER, BIGBANG, and EPIK HIGH and produced songs in various genres.\r\n\r\nSONG MIN HO showed off his charismatic masculinity with his solo track “I’M HIM” in WINNER’s debut album. He also released “FEAR” and “OKEY DOKEY” while doing Show Me The Money last year, of which he became the runner-up.\r\n\r\nSONG MIN HO’s “BODY” will be released at 12 AM on September 8 along with its music video.","post_date":"2016-09-04","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/MINO.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/MINO.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/MINO.jpg","excerpt":"SONG MIN HO of WINNER to Release a Solo Single Titled “BODY” on September 8","url_friendly_name":"song-min-ho-of-winner-to-release-a-solo-single-titled-body-on-september-8","artist_id":514,"related_event":[]},"1141":{"id":1141,"post_title":"[Exclusive] CL to Appear as a Guest on The Late Late Show","post_content":"[스포츠동아=김원겸 기자] CL is to begin her US promotions by appearing on a popular US chat show.\r\n\r\nCL will appear as a guest on The Late Late Show, an American late-night talk show hosted by James Corden on CBS.\r\n\r\nOn September 5, CL will be shooting Carpool Karaoke, a segment in which James and musical guests sing along to their songs whilst driving in Los Angeles. The segment began in March 2013, and since then, world-class stars such as One Direction, Mariah Carey, Carrie Underwood, Stevie Wonder, Jennifer Hudson, Rod Stewart, Chris Martin, and Elton John appeared as guests.\r\n\r\nAfter releasing her US debut single “LIFTED” on August 19, CL has not been doing any promotions in the US. But with her appearance in The Late Late Show, CL is surely off to a great start.\r\n\r\nCL appearing on The Late Late Show has great meaning as only a few Korean singers such as PSY and Girls’ Generation have succeeded in appearing on popular US talk shows until now. Furthermore, it means that CL will not be starting the promotions for her single at small clubs but on a nationally televised TV talk show. This is partly due to the influence of Scooter Braun, the manager of top stars such as Justin Bieber. But it is only possible because CL is quite well known in the US. CL will be doing various promotions for her new song after her appearance on The Late Late show.\r\n\r\nThe Late Late Show first aired in 1995 and has become CBS’s most popular talk show. The show has posted 630 million views on Youtube so far.\r\n\r\nCL’s first US single “LIFTED” became no.17 on Billboard’s Social Chart 50 and was chosen as Apple Music’s Best Of The Week Songs. Major US media outlets such as The Time, Entertainment Weekly, and USA Today published articles about CL’s new US single.","post_date":"2016-09-04","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/CL-e1473453234986.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/CL-e1473453234986.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/CL-e1473453234986.jpg","excerpt":"[Exclusive] CL to Appear as a Guest on The Late Late Show","url_friendly_name":"exclusive-cl-to-appear-as-a-guest-on-the-late-late-show","artist_id":243,"related_event":[]},"962":{"id":962,"post_title":"[DUMMY DATA] TITLE PLACEHOLD-2","post_content":"Following their romantic Italian vacation, Beyoncé and Jay Z returned stateside and managed to sneak into the Hands of Stone premiere in NYC on Monday night. While the couple skipped the red carpet, Usher took to Snapchat to share a photo of the pair cuddled up backstage, writing, \"Familia.\" The following day, Beyoncé took to her blog and shared a couple photos of her outfit, as well as a cute snap of her and Jay Z. Usher has been friends with the power couple for quite some time now, and earlier this year, he posted a hilarious video of the trio hanging out at the Super Bowl, where Beyoncé killed it with her amazing performance.","post_date":"2016-08-31","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/201608180803775530_57b4edb32b1ba_99_20160818080604.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/201608180803775530_57b4edb32b1ba_99_20160818080604.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/201608180803775530_57b4edb32b1ba_99_20160818080604.jpg","excerpt":"he posted a hilarious video of the trio hanging out at the Super Bowl, where Beyoncé killed it with her amazing performance.","url_friendly_name":"dummy-data-title-placehold-2","artist_id":454,"related_event":[754,961]},"961":{"id":961,"post_title":"[DUMMY DATA] TITLE PLACEHOLD-1","post_content":"Following their romantic Italian vacation, Beyoncé and Jay Z returned stateside and managed to sneak into the Hands of Stone premiere in NYC on Monday night. While the couple skipped the red carpet, Usher took to Snapchat to share a photo of the pair cuddled up backstage, writing, \"Familia.\" The following day, Beyoncé took to her blog and shared a couple photos of her outfit, as well as a cute snap of her and Jay Z. Usher has been friends with the power couple for quite some time now, and earlier this year, he posted a hilarious video of the trio hanging out at the Super Bowl, where Beyoncé killed it with her amazing performance.","post_date":"2016-08-31","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/2016081708080743852_1_99_20160817104826.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/2016081708080743852_1_99_20160817104826.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/2016081708080743852_1_99_20160817104826.jpg","excerpt":"Following their romantic Italian vacation","url_friendly_name":"dummy-data-title-placehold-1","artist_id":243,"related_event":[754]},"1147":{"id":1147,"post_title":"[Exclusive] BLACKPINK’s JISOO to Fill in for Jungyeon and Emcee This Week’s Inkigayo","post_content":"[OSEN=최나영 기자] BLACKPINK’s JISOO will be the emcee of this week’s Inkigayo, which will be broadcasted live on SBS.\r\nSources confirmed on August 30 that Jungyeon will not be able to emcee the September 4th show of Inkigayo. \r\nThis is because she will be performing at the 2016 JYP Nation Concert Mix &amp; Match, which will take place in Japan in early September.\r\nBLACKPINK’s JISOO is to fill in her place. For JISOO, it will be the first time emceeing a music show.\r\nJungyeon has been emceeing SBS’s Inkigayo along with her sister Gong Seungyeon and actor Kim Min-seok since July 3.\r\nJISOO is a member of the newly rising star group BLACKPINK, but even before debut, she has received much spotlight thanks to her gorgeous looks. She is considered to be one of the most likable members of BLACKPINK, and her fan base is only getting larger by day.","post_date":"2016-08-30","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_2.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_2.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_2.jpg","excerpt":"[Exclusive] BLACKPINK’s JISOO to Fill in for Jungyeon and Emcee This Week’s Inkigayo","url_friendly_name":"exclusive-blackpinks-jisoo-to-fill-in-for-jungyeon-and-emcee-this-weeks-inkigayo","artist_id":602,"related_event":[]},"1590":{"id":1590,"post_title":"BLACKPINK Dominates the Charts For Three Consecutive Weeks","post_content":"[OSEN=최나영 기자] Despite the host of newly-released singles, BLACKPINK has succeeded in maintaining the no.1 spot on the charts for three weeks in a row.\r\nAs of 2 PM on August 29, “WHISTLE”, one of the title tracks of BLACKPINK’s debut album “SQUARE ONE”, is on the top of the charts of Monkey3 and Naver Music as well as no.2 on the Melon chart.\r\nUpon debut, BLACKPINK swept all the major realtime, daily, and weekly charts of Korea and ranked high on Gaon charts.\r\nThe Gaon charts for the 34th week was announced on August 26, and BLACKPINK was no.1 on its digital chart, streaming chart, and mobile chart, demonstrating its huge popularity. \r\nAlthough BLACKPINK is a mere rookie, the group is writing new history. BLACKPINK became no.1 on SBS’s Inkigayo in only 14 days after its debut, taking the shortest time for a girl group to become no.1 on a music show.","post_date":"2016-08-29","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/블랙핑크.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/블랙핑크.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/블랙핑크.jpg","excerpt":"BLACKPINK Dominates the Charts For Three Consecutive Weeks","url_friendly_name":"blackpink-dominates-the-charts-for-three-consecutive-weeks","artist_id":602,"related_event":[1369]},"1280":{"id":1280,"post_title":"BLACKPINK’s “WHISTLE” MV Surpasses 20 Million Views","post_content":"[enews24=전수미 기자] The music video of BLACKPINK’s “WHISTLE” surpassed the 20 million mark on Youtube views following the group’s other title song “BOOMBAYAH”.\r\n\r\nAt 11 PM on August 27, “WHISTLE” MV surpassed 20 million views on Youtube and, as of 9 AM on August 28, the music video posted 20,353,873 views.\r\n\r\nThe music video is going viral thanks to its unique and sensual images, which fit perfectly with the song. The mysterious, gorgeous look of BLACKPINK members and the powerful choreography make the music video even more appealing.\r\n\r\nBLACKPINK has also been nominated the no.1 spot of SBS’s Inkigayo chart for two weeks in a row.\r\n\r\nLast week, BLACKPINK won the trophy in just 14 days after its debut and set a new record of taking the no.1 spot on a music show in the shortest time. This week, BLACKPINK’s “WHISTLE” and “BOOMBAYAH” were both nominated for the no.1 spot, and many are wondering whether BLACKPINK will be able to keep the no.1 spot for two consecutive weeks.\r\n\r\nBLACKPINK had their debut stage on August 14 on the same music show. After the show was aired, BLACKPINK became the hot topic of various portal websites, and their debut stage video posted high views.\r\n\r\nBLACKPINK has achieved astonishing success and writing new history although it is a mere rookie. The group dominated Korea’s music charts upon debut, became no.1 on the iTunes charts of 14 countries, and took the top two spot of Billboard’s World Digital Songs charts.","post_date":"2016-08-28","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_6.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/BP_3.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/BP_3.jpg","excerpt":"BLACKPINK’s “WHISTLE” MV Surpasses 20 Million Views","url_friendly_name":"blackpinks-whistle-mv-surpasses-20-million-views","artist_id":602,"related_event":[]},"1622":{"id":1622,"post_title":"BIGBANG and iKON Appear in “a-nation” Enthralling 55,000 People","post_content":"[OSEN=최나영 기자] YG Entertainment’s BIGBANG and iKON participated in Japan’s biggest summer festival “a-nation”.\r\n\r\nOn August 27, BIGBANG and iKON performed at Japan’s “a-nation” festival, which took place at the Ajinomoto Stadium in Tokyo and drove 55,000 people into a near frenzy.\r\n\r\niKON was the first to go up on the stage, and the group set the party mood by performing a remix version of “RHYTHM TA” and “SINO SIJAK”. Then, they performed “MY TYPE”, “#WYD”, “WHAT’S WRONG”, and “DUMB &amp; DUMBER”, to which the audience sang along and cheered loudly.\r\n\r\niKON said, “It’s a honor to participate in ‘a-nation.’ We hope you all have a great time today.”\r\n\r\nWhen the sun was about to set, BIGBANG appeared on the stage, headlining the festival for three years in a row. When the video was played to announce their appearance, the audience started to go wild. Then, BIGBANG appeared on the stage and sang “BANG BANG BANG” and made the audience go wild.\r\n\r\nBIGBANG performed for more than an hour singing 12 of their hit songs including “TONIGHT”, “IF YOU”, “WE LIKE 2 PARTY”, “BAE BAE”, and “BAD BOY”. But the highlight was when the group sang “FANTASTIC BABY”. 55,000 people sang along the chorus part as if it was BIGBANG’s solo concert.\r\n\r\nBefore ending their performance, BIGBANG said, “We have received a lot of love from you at our ’MADE’ tour, 10thanniversary concerts, and here at ‘a-nation’. We hope that you’ll also come and have fun at our dome tour that will start in November.”\r\n\r\nMeanwhile, BIGBANG’s Japan dome tour that kicked off in November last year ended in success drawing 911,000 people, which is the biggest number of audience for a foreign artist. BIGBANG also did a fan club event tour in May and 10thanniversary concerts in July. BIGBANG will go on its fourth dome tour in November, setting a new record of becoming the first foreign artist to go on a dome tour for four consecutive years.\r\n\r\niKON also demonstrated its popularity in Japan by drawing 146,000 people in its first arena tour this year. Also, on August 26, iKON made its first appearance in Fuji TV’s Mezamashi Live. iKON will go on its second arena tour in September, which is surprising for a rookie. iKON will hold 16 concerts in six cities starting with the concerts at the Makuhari Messe, Tokyo on September 10-11. More than 176,000 people are expected to attend iKON’s concerts.","post_date":"2016-08-28","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BB-IKON.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BB-IKON.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BB-IKON.jpg","excerpt":"BIGBANG and iKON Appear in “a-nation” Enthralling 55,000 People","url_friendly_name":"bigbang-and-ikon-appear-in-a-nation-enthralling-55000-people","artist_id":454,"related_event":[]},"1620":{"id":1620,"post_title":"iKON will Hold Additional Concerts for their Japan Tour","post_content":"[텐아시아=유찬희 인턴기자] Thanks to the fervent response to their second arena tour, iKON has decided to hold an additional concert.\r\n\r\nOn August 26, YG Entertainment announced that it has received many requests for more tickets to iKON’s second arena tour “iKON JAPAN TOUR 2016” and that iKON will hold add another concert to its tour. The additional concert will be held at the Yoyogi National Gymnasium in Tokyo on October 26.\r\n\r\n“iKON JAPAN TOUR 2016” will kick off at Makuhari Messe, Chiba on September 10-11. A total of 16 concerts will be held in six cities, and 176,000 people are expected to come to iKON’s concerts.\r\n\r\niKON released their Japan debut album “WELCOME BACK” on January 13, and the album became no.1 on Oricon’s daily CD chart. iKON successfully finished their first arena tour, “iKONCERT 2016 SHOWTIME TOUR IN JAPAN, earlier in the year. The group held concerts in a number of cities including Fukuoka, Tokyo, Kobe, Chiba, and Osaka and drew 146,000 people, which is remarkable considering that iKON is only a rookie and that it was their first tour.\r\n\r\nOn August 27, iKON will perform at the Ajinomoto Stadium for the A-nation Stadium Festival powered by dTV and meet their Japanese fans.","post_date":"2016-08-26","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/IKON_2-1.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/IKON_2-1.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/IKON_2-1.jpg","excerpt":"iKON will Hold Additional Concerts for their Japan Tour","url_friendly_name":"ikon-will-hold-additional-concerts-for-their-japan-tour","artist_id":241,"related_event":[1618]},"754":{"id":754,"post_title":"[DUMMY DATA] TITLE PLACEHOLD","post_content":"Following their romantic Italian vacation, Beyoncé and Jay Z returned stateside and managed to sneak into the Hands of Stone premiere in NYC on Monday night. While the couple skipped the red carpet, Usher took to Snapchat to share a photo of the pair cuddled up backstage, writing, \"Familia.\" The following day, Beyoncé took to her blog and shared a couple photos of her outfit, as well as a cute snap of her and Jay Z. Usher has been friends with the power couple for quite some time now, and earlier this year, he posted a hilarious video of the trio hanging out at the Super Bowl, where Beyoncé killed it with her amazing performance.","post_date":"2016-08-24","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/TEST_PSY2.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/TEST_PSY2.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/TEST_PSY2.jpg","excerpt":"Following their romantic Italian vacation","url_friendly_name":"dummy-data-title-placehold","artist_id":277,"related_event":[]},"1338":{"id":1338,"post_title":"The Music Video of CL’s New US Single Surpasses 2 Million Views","post_content":"[엑스포츠뉴스=박소현 기자] 2NE1’s CL recently released her US debut single “LIFTED”, and the music video for the track has surpassed the two million mark.\r\n\r\nAs of 7 AM on August 20, CL’s official debut single “LIFTED” posted 2,365,789 views on YouTube.\r\n\r\nThe music video hit one million views in just half a day after its release. Now, in just 25 hours, the music video surpassed the two million mark. Such rapid rise in views shows that the song is going viral across the world.\r\n\r\nThe song is also doing well on the charts. ‘LIFTED” went up two spot and took the no.12 spot on iTunes Top 40 American Hip-hop chart. It is also among the top 10 in the iTunes charts of nine countries including Malaysia, the Philippines, Thailand, Cambodia, Hong Kong, and Indonesia, and no.1 in Singapore, Taiwan, and Vietnam.\r\n\r\nMeanwhile, “LIFTED” is produced by TEDDY and co-written by CL, TEDDY, and Asher Roth. It sampled the legendary hip-hop group Wu- Tang Clan’s “Method Man.”","post_date":"2016-08-20","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/CL_3.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/CL_3.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/CL_3.jpg","excerpt":"The Music Video of CL’s New US Single Surpasses 2 Million Views","url_friendly_name":"the-music-video-of-cls-new-us-single-surpasses-2-million-views","artist_id":243,"related_event":[]},"1626":{"id":1626,"post_title":"BLACKPINK Becomes No.1 On China’s Biggest Online Chart and Has Been Dominating Korea’s Charts for 13 Days","post_content":"[일간스포츠=이미현 기자] BLACKPINK is rocking the charts in China.\r\n\r\nAs of 9 AM on August 20, the title tracks of BLACKPINK debut album “SQUARE ONE”—“WHISTLE” and “BOOMBAYAH”—took the top two spots of QQ Music’s MV chart. QQ Music is China’s largest music streaming provider.\r\n\r\nIn Korea, BLACKPINK has also taken back the no.1 spot on the realtime charts amidst the flurry of newly released songs.\r\n\r\n“WHISTLE” is at the no.1 spot on the charts of Melon, Monkey3, Naver Music, Bugs, Soribada, and Mnet. BLACKPINK has kept the no.1 spot for 13 days as the group has succeeded in building a wide fanbase and winning the public’s love at the same time.\r\n\r\nMeanwhile, upon debut, BLACKPINK has swept the music industry by dominating all the realtime, daily, and weekly charts in Korea. They also became no.1 on the iTunes charts of 14 countries and no.1 and no.2 on Billboards’ world digital songs chart.","post_date":"2016-08-20","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BLACKPINK_CLEAN3.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BLACKPINK_CLEAN3.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BLACKPINK_CLEAN3.jpg","excerpt":"BLACKPINK Becomes No.1 On China’s Biggest Online Chart and Has Been Dominating Korea’s Charts for 13 Days","url_friendly_name":"blackpink-becomes-no-1-on-chinas-biggest-online-chart-and-has-been-dominating-koreas-charts-for-13-days","artist_id":602,"related_event":[]},"1624":{"id":1624,"post_title":"BLACKPINK’s “WHISTLE” Climbs Back Up to No.1 on the Charts and the Dance Video Surpassed One Million Views","post_content":"[스포츠조선닷컴=정안지 기자] BLACKPINK’s “WHISTLE”, one of the title tracks of the group’s debut album, became no.1 on the charts again.\r\n\r\nTwelve days have passed since the song has been released, but “WHISTLE” took back the no.1 spot as of August 19 on the charts of Melon, Monkey3, and Naver Music. Although BLACKPINK is only a rookie, they have maintained a strong presence on the charts for quite some time now.\r\n\r\n“WHISTLE” has been dominating the charts for a while, demonstrating BLACKPINK’s huge popularity. The group’s dance practice video that was released earlier on is also getting a lot of views.\r\n\r\nBLACKPINK also released a dance video of “WHISTLE” on August 18, and the video posted 1,092,411 views in just a day. The choreography for the song is made by four world-renowned choreographers, including the choreographer of Beyonce’s “Single Ladies”. It has been receiving favorable reviews from K-Pop fans that it is pretty and chic at the same time.\r\n\r\nMeanwhile, BLACKPINK has succeeded in becoming no.1 on all the major online realtime, daily, and weekly charts. The group’s song has also become a great hit outside of Korea and ranked no.1 on the iTunes charts of 14 countries, the World Digital Song Chart of Billboards, and QQ Music’s K-Pop Weekly Chart.","post_date":"2016-08-19","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_15.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_15.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_15.jpg","excerpt":"BLACKPINK’s “WHISTLE” Climbs Back Up to No.1 on the Charts and the Dance Video Surpassed One Million Views","url_friendly_name":"blackpinks-whistle-climbs-back-up-to-no-1-on-the-charts-and-the-dance-video-surpassed-one-million-views","artist_id":602,"related_event":[]},"1263":{"id":1263,"post_title":"CL officially debuts in America on the 19… Will she break the highest record set by a Korean artist on American Billboard chart? ①","post_content":"CL of 2NE1 (CL, DARA, and BOM), one of the leading K-pop girl groups, is soon to unveil her first official output in the United States, the world’s biggest pop music market. Music fans are paying keen attention to if she will be able to break Korean artist’s highest record on American Billboard main albums chart, which is held by 2NE1.\r\n\r\nOn August 17, CL’s label YG Entertainment (“YG”) officially announced that CL will release her first official solo single “LIFTED” in the United States on the 19 this month. CL has long prepared for her debut in the States, in cooperation with Scooter Braun who helped management of PSY in the States. Now, finally, CL is unveiling her first official single in the country.\r\n\r\n\r\n\r\nCL’s launching in the United States is drawing keen attention, as she is the first one in Korea who is from a top girl group and who tries to succeed in the world’s biggest pop music market alone. People are also keenly interested in if CL will be able to break 2NE1’s record of highest ranking on Billboard 200, American Billboard main albums chart, for a Korean singer. In early 2014, album “CRUSH” of 2NE1 for which CL is the leader took 61st rank on American Billboard’s main albums chart. That is still the highest-ever record on the Billboard 200 chart for any Korean singer.\r\n\r\nCL’s first official single in the States has only one song. That song is the one that will be included in her official debut album in the States. In other words, it is a lead single for CL’s full-fledged debut album in the country. Therefore, the popularity of “LIFTED” will be the bellwether for the success of CL’s official debut album in the country. So, people are showing growing interest in the record to be set by CL’s lead single. CL will release some more singles after the lead single, before finally releasing her full-fledged debut album in America.\r\n\r\nThere is a high chance for CL to break 2NE1’s record on Billboard 200 chart with her debut album in the States which will include the songs in her debut singles. There are a couple of reasons to expect such success for CL’s debut in the States.\r\n\r\nFirst, Scooter Braun, who perfectly understands the circumstances in the pop music market in the States, will be in charge of CL’s management in the country. Scooter Braun recruited world-famous pop star Justin Bieber and he is currently working for top singer Ariana Grande. In a word, Scooter Braun is one of the most powerful and influential figures in America’s pop music market, so working with him will be extremely helpful for CL. The reason why CL has been able to work on her debut album in collaboration with America’s famous musicians so far is largely attributable to Scooter Braun’s help.\r\n\r\nCL released “HELLO BITCHES”, the pre-promotion song for her solo debut in the States, in November last year, to take No.1 on global music-streaming website Sportify. Such record drew even bigger attention, as it was set while many media outlets of the States and other countries were expressing their big anticipation for CL’s debut in the States. That is one of the reasons why people have bigger interest in the success of CL’s first debut single to be released on the 19 and her debut full album that will be released later.\r\n\r\nAnother reason why CL’s debut in the States with the debut single and debut full album is believed to be promising is because she has outstanding talent in rap, vocal, and performance and is fluent in English. She can play a leading role in her own promotion in the country.\r\n\r\nIt is worthwhile to look forward to CL’s successful debut in America’s pop music market and the possibility for her to break her own record of the highest rank on Billboard albums chart for any Korean singer, which is still held by 2NE1.\r\n\r\n&nbsp;","post_date":"2016-08-17","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/CL_2.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/CL_2.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/CL_2.jpg","excerpt":"CL officially debuts in America on the 19… Will she break the highest record set by a Korean artist on American Billboard chart? ①","url_friendly_name":"cl-officially-debuts-in-america-on-the-19-will-she-break-the-highest-record-set-by-a-korean-artist-on-american-billboard-chart-%e2%91%a0","artist_id":243,"related_event":[]},"1268":{"id":1268,"post_title":"BLACKPINK’s First Ever “WHISTLE” & “BOOMBAYAH” Performance Hit Six Million Views","post_content":"[OSEN=김보라 기자] Only nine days have passed since BLACKPINK’s debut, but the group is still rocking the charts. This is extraordinary considering that BLACKPINK is only a rookie.\r\n\r\n“WHISTLE”, one of the title tracks of BLACKPINK’s debut single album “SQUARE ONE”, is no.1 on the charts of Melon, Monkey3, Olleh, Naver Music, Bugs, and Genie as of 2:30 PM on August 16.\r\n\r\nOn August 14, BLACKPINK went up on the stage and sang “WHISTLE” and “BOOMBAYAH” for the first time on SBS’s Inkigayo. BLACKPINK caught the eyes and ears of the viewers with their impeccable live performance.\r\n\r\nVideos of the group’s debut performance were uploaded on Youtube, and the “WHISTLE” video posted 2,830,709 views and the “BOOMBAYAH” video, 2,739,816 views. Combined, the two videos reached 5,570,525 views, reflecting the public’s high interest in the group.\r\n\r\nBLACKPINK is writing new history as it has dominated the realtime, daily and weekly charts of eight major music streaming websites upon debut.\r\n\r\nIt will be interesting to watch how much higher BLACKPINK will go after their successful debut.","post_date":"2016-08-16","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_5.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_5.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_5.jpg","excerpt":"BLACKPINK’s First Ever “WHISTLE” & “BOOMBAYAH” Performance Hit Six Million Views","url_friendly_name":"blackpinks-first-ever-whistle-boombayah-performance-hit-six-million-views","artist_id":602,"related_event":[]},"1362":{"id":1362,"post_title":"BIGBANG takes part in UNICEF donation project in celebration of 10th anniversary of debut","post_content":"[엑스포츠뉴스=정지원 기자] Group BIGBANG is carrying out a celebratory donation project with UNICEF, in celebration of the 10th anniversary of their debut.\r\n\r\nThe project between BIGBANG and UNICEF was planned in order to promote UNICEF’s “celebratory donation” program that helps people spend their special days such as graduation, admission to schools, wedding, and employment all the more meaningfully. BIGBANG will encourage donation by implementing the program along with UNICEF.\r\n\r\nNotably, August 8 of 2016 is the birthday of BIGBANG’s leader G-DRAGON and August 19 is the 10th anniversary of BIGBANG’s debut. On August 20, BIGBANG is holding a concert that celebrates the 10th anniversary. To spend those special days all the more meaningfully with fans, BIGBANG decided to take part in the donation project.\r\n\r\nIn a special video clip created for the project, BIGBANG talks about the day when they made debut 10 years ago, the day when they took No.1 in a TV music show for the first time, and the day of their first-ever concert, expressing gratitude for fans’ unchanged support and love for BIGBANG.\r\n\r\nYG Entertainment said, “The project to be implemented with UNICEF was planned in order to reward fans’ constant support and love for BIGBANG for the past 10 years and to celebrate BIGBANG’s 10th anniversary in the most meaningful way. BIGBANG made donations on every special day and the ‘celebratory donation’ project with UNICEF will be a meaningful and special occasion to remember and reward fans’ love”.\r\n\r\nRecently, BIGBANG has actively communicated with fans in a variety of projects such as a movie and exhibition, in celebration of the 10th anniversary of their debut. On August 20, BIGBANG will hold 10th anniversary concert “0.TO.10” at Sangam-dong World Cup Stadium in Seoul.","post_date":"2016-08-16","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BB.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BB.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BB.jpg","excerpt":"BIGBANG takes part in UNICEF donation project in celebration of 10th anniversary of debut","url_friendly_name":"bigbang-takes-part-in-unicef-donation-project-in-celebration-of-10th-anniversary-of-debut","artist_id":454,"related_event":[]},"1600":{"id":1600,"post_title":"[Music Talk Talk] BLACKPINK’s “WHISTLE” Takes Back No.1 Spot on the Charts","post_content":"[OSEN=정준화 기자] BLACKPINK is on the top of the charts again with “WHISTLE”. The song went down the charts for a while, but it has taken back the no.1 spot again, and on all the major charts at that.\r\n\r\nAs of 9 AM on August 14, “WHISTLE” is no.1 on the realtime charts of Melon, Genie, Naver Music, Bugs, Soribada, Olleh Music, Monkey3, and Mnet Music.\r\n\r\nIn just four hours after its release on August 8, the song became no.1 on all the major charts. Although it gave the no.1 spot to the songs of other singers for a while after that, “WHISTLE” was able to take back the top spot thanks to BLACKPINK’s huge popularity.\r\n\r\nIt is surprising considering that BLACKPINK has done nothing yet but release their debut singles. It is expected that their song will keep on dominating the charts for a while as there is no other strong contenders.\r\n\r\nBLACKPINK’s music videos are going viral too. In addition to “BOOMBAYAH”, “WHISTLE” has surpassed the 10 million mark in Youtube views. As of 8 AM on August 14, “WHISTLE” posted 10,523,510 views and “BOOMBAYAH”, 12,292,657 views. Combined, the two music videos surpassed the 20 million mark.\r\n\r\nThe interesting part is when the two music videos reached the 10 million mark. “BOOMBAYAH” surpassed 10 million views in the afternoon of August 13 first, and then later in the day, “WHISTLE” also posted 10 million views. This shows that the two songs are equally popular.\r\n\r\n“WHISTLE” is a sexy and hypnotizing hip-hop song with a simple beat. Its unique melody that is themed around the sound of a whistle and tinkling water bubble sounds make the song pleasant to the ear. “BOOMBAYA” is a fast-tempo song with powerful drum beats and unique synth sounds. Fans are able to see the different charms of BLACKPINK with these two very different songs.\r\n\r\nBLACKPINK is to go up on the stage for the first time on August 14. According to SBS, BLACKPINK’s “WHISTLE” and “BOOMBAYAH” performances will be aired on Inkigayo on August 14 for the first time, and expectations are running high among fans and within the music industry.","post_date":"2016-08-14","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_11.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_11.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_11.jpg","excerpt":"[Music Talk Talk] BLACKPINK’s “WHISTLE” Takes Back No.1 Spot on the Charts","url_friendly_name":"music-talk-talk-blackpinks-whistle-takes-back-no-1-spot-on-the-charts","artist_id":602,"related_event":[]},"1596":{"id":1596,"post_title":"WINNER’s SONG MINHO to Join iKON’s Japan Arena Tour as a Special Guest","post_content":"[동아닷컴=곽현수 기자] SONG MINHO of WINNER will join iKON’s Japan arena tour as a special guest.\r\n\r\nWINNER and iKON will come together once again. WINNER’s SONG MINHO will back up iKON on their Japan arena tour by appearing in their concerts as a special guest.\r\n\r\niKON will kick off their second arena tour by holding concerts at the Makuhari Messe, Chiba on September 10-11. Then, additional concerts will be held at Nihon Gaishi Hall, Aichi on September 24-25;at the Osaka-jō Hall, Osaka on October 5-6; at the World Memorial Hall, Kobe on October 8; and at the Marine Messe Fukuoka, Fukuoka on October 10. The tour will consist of 14 concerts in five cities and is expected to draw 150,000 people.\r\n\r\niKON’s tour will be a special present for the fans. It has already been announced that SONG MINHO and BOBBY will form a unit group, and the tour will be a great chance to see the two perform together. \r\n\r\nMeanwhile, the tickets to iKON’s second Japan arena tour will be sold starting from 10 AM on August 13.","post_date":"2016-08-12","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/IKON_2.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/IKON_2.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/IKON_2.jpg","excerpt":"WINNER’s SONG MINHO to Join iKON’s Japan Arena Tour as a Special Guest","url_friendly_name":"winners-song-minho-to-join-ikons-japan-arena-tour-as-a-special-guest","artist_id":241,"related_event":[]},"1594":{"id":1594,"post_title":"BIGBANG holds a fan meeting at an arena in Hawaii… “First Korean artist to hold an arena fan meeting in Hawaii”","post_content":"[마이데일리=전원 기자] Boy group BIGBANG holds a fan meeting in October this year in Hawaii, for the first time for a Korean artist.\r\n\r\nYG Entertainment announced that BIGBANG will hold fan meeting “BIGBANG MADE [V.I.P] TOUR IN HONOLULU” at “Neal S. Blaisdell Center Arena” located in Honolulu, Hawaii, on October 22.\r\n\r\nIt is the first time for BIGBANG to give performances in Hawaii. Plus, even though there have been some Korean artists who held concert in Hawaii, BIGBANG is the first Korean artist to hold an event at an arena there.\r\n\r\nBIGBANG will present a mini-concert and a variety of fun games at the fan meeting in Hawaii, in order to more closely communicate with fans. The special contents of the fan meeting will present special memories for local fans in Hawaii.\r\n\r\nIn March, June, and July this year, BIGBANG met 110,000 Chinese fans in a fan meeting held in Foshan, Nanjing, Harbin, Dailan, Chongqing, and Chengdu in China. BIGBANG boasted their remarkable influence in the country by selling out all the tickets for the fan meeting. Fierce competition is expected as well for the Hwaii fan meeting whose tickets will be opened for sale on the 19 on “Ticket Master”.\r\n\r\nBefore the Hawaii fan meeting, BIGBANG will first have fan meetings in Macao on September 3 to 4 and in Taiwan on September 8 to 10. Plus, BIGBANG will hold a concert in celebration of the 10th anniversary of their debut on August 20 at Sang-am World Cup Stadium in Seoul.","post_date":"2016-08-12","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BB-Honolulu.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BB-Honolulu.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BB-Honolulu.jpg","excerpt":"BIGBANG holds a fan meeting at an arena in Hawaii… “First Korean artist to hold an arena fan meeting in Hawaii”","url_friendly_name":"bigbang-holds-a-fan-meeting-at-an-arena-in-hawaii-first-korean-artist-to-hold-an-arena-fan-meeting-in-hawaii","artist_id":454,"related_event":[]},"1254":{"id":1254,"post_title":"BLACKPINK’s “WHISTLE” in No.1 place on seven charts… Exceptionally successful","post_content":"[스타뉴스=윤상근 기자] YG’s new girl group BLACKPINK (JISOO, JENNIE, ROSÉ, and LISA) is making exceptionally great success, sweeping top places on real-time music charts for two days in a row since their debut.\r\n\r\nBLACKPINK’s debut song “WHISTLE” released on August 8 topped the chart of seven music-streaming websites: Melon, Bugs, Genie, Soribada, NAVER Music, Mnet Music, and Olleh Music, as of August 10 at 7AM. Only on the chart of Monkey 3, “WHISTLE” is staying in the second place, following Standing Egg’s “In Summer Night, We”.\r\n\r\nBLACKPINK’s debut song “WHISTLE” is a minimal hip-hop track that has a dreamy and sexy feel.\r\n\r\nBLACKPINK drew big attention from even before their debut, as YG’s first rookie girl group in seven years since 2NE1. Now, BLACKPINK’s debut is achieving an exceptionally great success.\r\n\r\nMany music fans are keenly interested in the future of BLACKPINK. BLACKPINK will give their first debut performance on August 14 in SBS “INKIGAYO”.","post_date":"2016-08-10","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_3.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_3.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_3.jpg","excerpt":"BLACKPINK’s “WHISTLE” in No.1 place on seven charts… Exceptionally successful","url_friendly_name":"blackpinks-whistle-in-no-1-place-on-seven-charts-exceptionally-successful","artist_id":602,"related_event":[]},"1592":{"id":1592,"post_title":"BLACKPINK is sweeping charts for three days since their debut… New history of girl group","post_content":"[OSEN=표재민 기자] BLACKPINK, YG Entertainment’s first new girl group in seven years, is sweeping No.1 on music charts for three days in a row.\r\n\r\n“WHISTLE” in BLACKPINK’s debut single album “SQUARE ONE” is in the top place on the chart of seven music-streaming websites: Melon, Genie, NAVER Music, Mnet.com, Bugs, Soribada, and Olleh Music, as of August 10 at 7AM. On the chart of Monkey 3, “WHISTLE” is in the second place, following Standing Egg’s “In Summer Night, We”.\r\n\r\n“BOOMBAYAH”, the other track in BLACKPINK’s debut album, is also staying in top 10 on charts, proving big attention and popularity BLACKPINK is enjoying. BLACKPINK is sweeping No.1 on music charts for three days in a row since the release of the debut album released on August 8 at 8PM. BLACKPINK drew keen attention from even before their debut, as they are the first rookie girl group of YG in seven years. Now that they have finally made an official debut, BLACKPINK is drawing even bigger attention, being recognized as the “perfect girl group” who has outstanding talent, beauty, and charms.\r\n\r\nIt is a very exceptional case for rookie girl group to sweep No.1 on music charts upon their debut. Music fans are expressing keen interest in the next moves of BLACKPINK who is writing new history of girl group right from their debut.","post_date":"2016-08-10","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_10.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_10.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_10.jpg","excerpt":"BLACKPINK is sweeping charts for three days since their debut… New history of girl group","url_friendly_name":"blackpink-is-sweeping-charts-for-three-days-since-their-debut-new-history-of-girl-group","artist_id":602,"related_event":[1590]},"1149":{"id":1149,"post_title":"iKON’s First Japanese Single Album to be Released on September 28","post_content":"[동아닷컴=홍세영 기자] iKON’s first Japanese single album “DUMB &amp; DUMBER” will be released on September 28.\r\n\r\nThe album will consist of Japanese versions of iKON’s hit songs “DUMB &amp; DUMBER”, “#WYD”, “LOVE ME” and “SINO SIJAK REMIX”.\r\n\r\nThe DVD will include three music videos and behind-the-scenes videos of “DUMB &amp; DUMBER”, “#WYD”, and “ANTHEM REMIX (CHOICE37 Ver.) \/ B.I&amp;BOBBY”, making the fans anticipate it even more.\r\n\r\nA special event is prepared to celebrate the release of the single album. For those who purchased the deluxe version, there will be a draw to pick people who will have the chance to shake hands with the members at the Pacifico Yokohama on October 22 and at the Kobe Convention Center on October 23. There will also be a draw for those who buy the album in advance via online stores until August 22, and those who win the draw will get to participate in a signing event.\r\n\r\nFans can also apply to see concert rehearsals and participate in group photos and official hi-fives that will take place during iKON’s second arena tour. The tour will begin in September, and 14 concerts will be in five cities, drawing 150,000 people. For details, go to iKON’s official Japanese website.\r\n\r\n\r\n\r\nMeanwhile, iKON is one of the casts of China’s audition program “The Remix” along with PSY, and the group is receiving great feedbacks from the Chinese viewers for their fabulous performance every week. \r\n\r\niKON will start their first Asia tour titled “iKONCERT 2016 [SHOWTIME] TOUR” in August and hold concerts in Malaysia and Indonesia.","post_date":"2016-08-10","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/iKON.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/iKON.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/iKON.jpg","excerpt":"iKON’s First Japanese Single Album to be Released on September 28","url_friendly_name":"ikons-first-japanese-single-album-to-be-released-on-september-28","artist_id":241,"related_event":[]},"1591":{"id":1591,"post_title":"[Music Talk Talk] Who’s BLACKPINK? Dominating music charts + No.1 on iTunes chart of 9 countries","post_content":"[OSEN=손남원 기자] What on earth is BLACKPINK? This catchy new girl group of YG has left a strong impression in the world’s music market upon their debut. BLACKPINK’s debut song topped charts of nine countries including Hong Kong, Finland, and Indonesia, and took the second place on the charts of more than ten countries including New Zealand, Sweden, Vietnam, Turkey, and Singapore (as of August 9 in the morning).\r\n\r\nBLACKPINK created sensation in the music scene upon their debut on August 8. Then, within four hours of debut, they swept No.1 on all the on-line music charts in Korea. BLACKPINK’s music videos that look like blockbuster movies as YG music videos always do, are also recording big number of views.\r\n\r\nBLACKPINK’s two debut songs are taking the first and second places on charts at the same time and setting unprecedentedly high records that go over the range of statistics collection repeatedly. The power and appeal that BLACKPINK presented on the day of their debut are definitely more exceptional and unprecedented than any other YG rookies.\r\n\r\nBLACKPINK drew keen attention by releasing “WHISTLE” and “BOOMBAYAH”, the double title tracks of debut single album “SQUARE ONE”, after four years of hard training by YG. They drew attention first by releasing music videos in the showcase held before the release of the album and then, made an official debut by releasing the debut songs.\r\n\r\n“WHISTLE” and “BOOMBAYAH” have contrasting feels. While “BOOMBAYAH” with a quick tempo has a cool appeal that goes well with the summer season and intense feel that triggers girl crush, “WHISTLE” has a catchy and dreamlike feel. Sensual scenes of the music videos of the songs also boast unique and sophisticated appeals.\r\n\r\nFirst, “WHISTLE” has a unique atmosphere that is bubbly and exciting but tender like a dream at the same time. It also has YG’s flagship unique feel, which is well expressed by BLACKPINK’s members. Along with the sexy and dreamy mood, exciting and funny expression is outstanding.\r\n\r\nROSÉ’s vocal and JENNIE’s rap in the intro part are impressive. The intro of the song has a very unique and dreamy feel and it is well expressed by ROSÉ’s attractive voice. The voice of JENNIE who is good at both vocal and rap is also impressive. The harmony created by the combination of the four members is catchier than expected. The 808 drum sound makes listeners sing along it over and over again.\r\n\r\nThe two debut songs of BLACKPINK swept No.1 on the real-time chart of four music-streaming websites within one hour of release. With such record, BLACKPINK made an unprecedentedly successful debut.\r\n\r\nROSÉ said, “I’m nervous as I’ve longed for debut for a long time, but I’ll do my best to show you everything I have learned in good performances on the stage”.\r\n\r\nJENNIE said, “I thank people who have waited for us with anticipation for a long time. I’ll do my best to show you BLACKPINK’s unique color. I hope BLACKPINK will be loved by many people”. “I’m so much excited and nervous as I’m finally making debut after a long time of training. BLACKPINK will always show you good performances”, added JISOO.\r\n\r\nThen, LISA said, “I’m so excited to make debut with the members with whom I’ve been trained for a long time. I hope many people will love BLACKPINK”.\r\n\r\nBLACKPINK is a rookie girl group whose members have been hard-trained by YG for four to six years. The members have already been recognized for their outstanding talent built in the long-time training and collaboration work with YG artists.","post_date":"2016-08-09","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/BP_3.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/BP_3.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/BP_3.jpg","excerpt":"[Music Talk Talk] Who’s BLACKPINK? Dominating music charts + No.1 on iTunes chart of 9 countries","url_friendly_name":"music-talk-talk-whos-blackpink-dominating-music-charts-no-1-on-itunes-chart-of-9-countries","artist_id":602,"related_event":[1359]},"1361":{"id":1361,"post_title":"BLACKPINK’s Showcase Surpasses 450,000 Views and 10 Million Hears on V Live","post_content":"\r\n\r\n[스포츠서울=김도형 기자] YG Entertainment’s new girl group, BLACKPINK, has released their music videos for the first time via V Live. The music videos have surpassed 450,000 simultaneous views, reflecting the high expectations for the group’s debut.\r\n\r\nOn August 8, BLACKPINK’s debut showcase was broadcasted live on Naver’s V Live.\r\n\r\nAt the showcase, the music videos and behind-the-scenes videos of BLACKPINK’s debut singles of—“BOOMBAYA” and “WHISTLE”—were released to the public for the first time.\r\n\r\nAfter the music videos were released, BLACKPINK members went up on the stage and described their feelings about debuting. The press conference that took place afterwards was not broadcasted.\r\n\r\nHowever, the thirty-minute debut showcase posted 457,596 simultaneous views and received 10,129,277 hearts as of 3:40 PM, demonstrating the public’s great interest in the group.\r\n\r\nMeanwhile, BLACKPINK’s debut singles will be released at 8 PM on August 8.","post_date":"2016-08-08","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_5.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_5.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_5.jpg","excerpt":"BLACKPINK’s Showcase Surpasses 450,000 Views and 10 Million Hears on V Live","url_friendly_name":"blackpinks-showcase-surpasses-450000-views-and-10-million-hears-on-v-live","artist_id":602,"related_event":[]},"1359":{"id":1359,"post_title":"[Music Talk Talk] BLACKPINK finally debuts after four years of preparation… The monstrous rookie is coming","post_content":"[OSEN=선미경 기자] YG’s new girl group BLACKPINK is finally making debut today.\r\n\r\nBLACKPINK is making an official debut on August 8 at 8PM, releasing debut song “BOOMBAYAH” and “WHISTLE”. As BLACKPINK is a rookie girl group launched by YG for the first time in seven years with full support from the company, music fans expect that they will become a “monstrous rookie”.\r\n\r\n“BOOMBAYAH” is a song jointly written by YG’s main producer TEDDY and Bekuh BOOM. The song’s music video is directed by Seo Hyeon-seung, a famous director who has directed many music videos of BIGBANG and 2NE1. “BOOMBAYAH” is known to be a song of an intense and quick rhythm, which is exciting enough to cool down this summer’s heat wave.\r\n\r\nThe other title track is “WHISTLE”. YG’s main producer TEDDY and Future Bounce wrote the melody and TEDDY wrote the lyrics of the song. The song boasts powerful charisma, differently from “BOOMBAYAH”. This minimal hip-hop song with a dreamlike and sexy feel expresses exciting love between a man and woman in the word “whistle”.\r\n\r\nBLACKPINK meets the public for the first time before the official release of the new songs in a showcase at 3PM. The showcase to be live-broadcasted on search engine NAVER’s V-APP will unveil the new songs and music videos. All the songs in BLACKPINK’s debut album were written and directed by YG’s main producer TEDDY, so many music fans are paying keen attention to the quality of the music.\r\n\r\nBLACKPINK has four members JENNIE, LISA, ROSÉ, and JISOO who have been hard-trained for four to six years. The whole music scene is paying keen attention to if BLACKPINK’s debut will create sensation just as 2NE1’s debut did.","post_date":"2016-08-08","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_7.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_7.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/08\/BP_3.jpg","excerpt":"[Music Talk Talk] BLACKPINK finally debuts after four years of preparation… The monstrous rookie is coming","url_friendly_name":"music-talk-talk-blackpink-finally-debuts-after-four-years-of-preparation-the-monstrous-rookie-is-coming","artist_id":602,"related_event":[]},"1358":{"id":1358,"post_title":"[Music Talk Talk] Dance Practice of YG’s BLACKPINK Surpasses 6 Million Views","post_content":"[OSEN=손남원 기자] The dance practice video of BLACKPINK surpassed six million views on the day before the group’s official debut. The short dance practice video was released online, and it was the first time the public saw BLACKPINK members as a group. The video is currently posting high views.\r\n\r\nSeven years have passed since YG Entertainment launched a new girl group. After announcing that its new girl group BLACKPINK will officially debut on August 8, YG released BLACKPINK’s dance practice video on July 21. The video, which features all the members of BLACKPINK dancing passionately, posted one million views in just a day after its release. Then, it surpassed two million views in three days, three million in nine days, and four million in two weeks. The rapidly rise in the video’s views demonstrate the group’s popularity.\r\n\r\nIndeed, BLACKPINK is going viral worldwide. Fans around the world are sending their support for JISOO, JENNIE, ROSÉ, and LISA by posting dance covers and reaction videos online.\r\n\r\nIt’s rare that a rookie receives so much spotlight. From July 1, the profile of members had been released one by one every week, and thanks to the members’ gorgeous looks, which is unusual for YG artists, fans have been anticipating to see them. The view is that YG has succeeded in forming a group with members that have both the talent and the looks. The fact that YG’s main producer TEDDY was put in charge of producing BLACKPINK’s album only raised the expectations even more.\r\n\r\nIn a way, YG is very cheeky. Today, there are so many idol groups, and other labels are launching groups that have diverse members, much like confectionary boxes. But, YG is going to launch a four-member group. Idol groups nowadays consist of at least five members, and some of them as much as 12 or 13, but YG is jumping into the game only with a selected few.\r\n\r\nThe group’s name also shows the group’s identity. The name “BLACKPINK” combines black and pink, which represent special and universal, respectively. So, the name reflects that four members, who are as pretty as the color pink, have infinite potential, uniqueness, and charisma as the color black.\r\n\r\nBLACKPINK’s debut singles, “BOOMBAYAH” and “WHISTLE”, and the songs’ music videos are to be released at 8 PM on August 8. Earlier in the day at 3 PM, a showcase will be held, and BLACKPINK members will appear before the public for the first time. The showcase will be broadcasted live on Naver V App.","post_date":"2016-08-07","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_5.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_5.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_5.jpg","excerpt":"[Music Talk Talk] Dance Practice of YG’s BLACKPINK Surpasses 6 Million Views","url_friendly_name":"music-talk-talk-dance-practice-of-ygs-blackpink-surpasses-6-million-views","artist_id":602,"related_event":[]},"1262":{"id":1262,"post_title":"“YG rookie never fails expectations”… BLACKPINK’s dance practice video already recording three million views… “Drawing keen attention from around the world”","post_content":"[OSEN=선미경 기자] YG Entertainment’s new girl group BLACKPINK’s first dance practice video has surpassed three million views.\r\n\r\nAs of today (July 14) at 9AM, BLACKPINK’s group dance practice video recorded 3,062,804 views within 9 days of release, proving the team’s big popularity which is very unusual for a rookie who has not even made official debut.\r\n\r\nNotably, the video is showing a rapid growth in the number of views, after reaching one million within a day of release, then two million in three days, and three million in 14 days. It is drawing keen attention, recording a rapid growth in the number of views within a week.\r\n\r\nIn the video, JISOO, JENNIE, ROSÉ, and LISA present disciplined group dance to an intense beat, in “all black” outfits. Plus, all the members display eye-catchingly sexy choreography, boasting their perfectly-proportioned bodies. As such, the video is further raising fans’ anticipation for BLACKPINK’s performance on the stage.\r\n\r\nFans from around the world are posting BLACKPINK dance cover and reaction videos in a variety of styles, to draw big attention.\r\n\r\nThe debut album of BLACKPINK to make official debut soon has been worked on by YG’s main producer TEDDY who has given birth to numerous hit songs of BIGBANG and 2NE1, for the past two years. BLACKPINK will shoot a music video for every song included in their debut album. That shows how big confidence and expectations YG has for BLACKPINK.\r\n\r\nIn the meantime, music fans are paying keen attention to what kind of new history will be written by BLACKPINK that has talented members aged 19 on average, who have been hard-trained at YG from four to six years.","post_date":"2016-07-14","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_4.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_4.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_4.jpg","excerpt":"“YG rookie never fails expectations”… BLACKPINK’s dance practice video already recording three million views… “Drawing keen attention from around the world”","url_friendly_name":"yg-rookie-never-fails-expectations-blackpinks-dance-practice-video-already-recording-three-million-views-drawing-keen-attention-from-around-the-wo-2","artist_id":602,"related_event":[]},"1260":{"id":1260,"post_title":"“BIGBANG MADE” records 50,000 viewers… The highest-ever number for a music documentary film","post_content":"[일간스포츠=황미현 기자] The movie released in celebration of the 10th anniversary of BIGBANG’s debut has recorded 50,000 viewers in Korea.\r\n\r\n“BIGBANG MADE”, a movie released on the 30 last month in celebration of the 10th anniversary of BIGBANG’s debut, recorded more than 50,000 viewers as of July 14. That is the highest-ever record in Korea, for a music documentary film. Now, fans are paying keen attention to whether BIGBANG will really be able to hold a guerilla concert. In NAVER V-APP broadcasting on the 28 last month, BIGBANG promised that they will hold a surprise guerilla concert if the movie surpasses the 100,000 viewers mark.\r\n\r\nAs of the same day, the movie also recorded 70,000 viewers in Japan, proving BIGBANG’s big popularity in the country. With such big support from fans from in and out of the country, BIGBANG will also release the movie in 10 countries including LA in the United States, Singapore, Thailand, and Hong Kong.\r\n\r\n“BIGBANG MADE” is a film that depicts the journey of BIGBANG’s second world tour “MADE” that drew 1.5 million fans to 66 concerts held in 32 cities in 13 countries in North and Central America, Oceania, and Asia. It is drawing keen attention and interest from fans, as it vividly shows BIGBANG’s fancy performances on the stage acclaimed by fans around the world, as well as their everyday lives.\r\n\r\nNotably, the movie is enjoying big popularity for vividly depicting BIGBANG’s concert on the three-side screen and for displaying BIGBANG’s true heart about their serious attitude toward music and performance, gratitude for fans who have been with them for 10 years, and thoughts about the renewal of contract with YG.\r\n\r\nIn the meantime, BIGBANG will continue to closely communicate with fans in a variety of projects for celebration of the 10th anniversary of their debut, including 10th anniversary exhibition to be held from August 5 to October 30 at S-factory in Seongsu-dong, Seongdong-gu, Seoul, as well as the 10th anniversary concert to be held on August 20.","post_date":"2016-07-14","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BB-MADE_2.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BB-MADE_2.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BB-MADE_2.jpg","excerpt":"“BIGBANG MADE” records 50,000 viewers… The highest-ever number for a music documentary film","url_friendly_name":"bigbang-made-records-50000-viewers-the-highest-ever-number-for-a-music-documentary-film","artist_id":454,"related_event":[]},"1258":{"id":1258,"post_title":"“YG rookie never fails expectations”… BLACKPINK’s dance practice video already recording three million views… “Drawing keen attention from around the world”","post_content":"[OSEN=선미경 기자] YG Entertainment’s new girl group BLACKPINK’s first dance practice video has surpassed three million views.\r\n\r\nAs of today (July 14) at 9AM, BLACKPINK’s group dance practice video recorded 3,062,804 views within 9 days of release, proving the team’s big popularity which is very unusual for a rookie who has not even made official debut.\r\n\r\nNotably, the video is showing a rapid growth in the number of views, after reaching one million within a day of release, then two million in three days, and three million in 14 days. It is drawing keen attention, recording a rapid growth in the number of views within a week.\r\n\r\nIn the video, JISOO, JENNIE, ROSÉ, and LISA present disciplined group dance to an intense beat, in “all black” outfits. Plus, all the members display eye-catchingly sexy choreography, boasting their perfectly-proportioned bodies. As such, the video is further raising fans’ anticipation for BLACKPINK’s performance on the stage.\r\n\r\nFans from around the world are posting BLACKPINK dance cover and reaction videos in a variety of styles, to draw big attention.\r\n\r\nThe debut album of BLACKPINK to make official debut soon has been worked on by YG’s main producer TEDDY who has given birth to numerous hit songs of BIGBANG and 2NE1, for the past two years. BLACKPINK will shoot a music video for every song included in their debut album. That shows how big confidence and expectations YG has for BLACKPINK.\r\n\r\nIn the meantime, music fans are paying keen attention to what kind of new history will be written by BLACKPINK that has talented members aged 19 on average, who have been hard-trained at YG from four to six years.","post_date":"2016-07-14","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_4.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_4.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_4.jpg","excerpt":"“YG rookie never fails expectations”… BLACKPINK’s dance practice video already recording three million views… “Drawing keen attention from around the world”","url_friendly_name":"yg-rookie-never-fails-expectations-blackpinks-dance-practice-video-already-recording-three-million-views-drawing-keen-attention-from-around-the-wo","artist_id":602,"related_event":[]},"1256":{"id":1256,"post_title":"“BIGBANG MADE” will be released in ten more countries including LA in the United States and Hong Kong","post_content":"[조이뉴스24=정병근 기자] A movie that celebrates the 10th anniversary of BIGBANG’s debut has surpassed the 50,000 viewers mark in Korea.\r\n\r\n“BIGBANG MADE”, a movie released on the 30 last month in celebration of the 10th anniversary of BIGBANG’s debut, recorded 50,000 viewers as of July 14. That is the highest-ever number for a music documentary film. Now, fans are paying keen attention to whether BIGBANG will be able to keep their promise to hold a guerrilla concert if the movie records 100,000 viewers.\r\n\r\nPlus, as of the same day, the movie recorded 70,000 viewers in Japan, proving BIGBANG’s big popularity in the country. With such great support from fans from around the world, BIGBANG will release “BIGBANG MADE” in ten more countries including the United States in LA, Singapore, Thailand, and Hong Kong.\r\n\r\n“BIGBANG MADE” is a film that depicts the journey of BIGBANG’s second world tour “MADE” that drew 1.5 million fans to 66 concerts held in 32 cities in 13 countries in North and Central America, Oceania, and Asia. It is drawing keen attention and interest from fans, as it vividly shows BIGBANG’s fancy performances on the stage acclaimed by fans around the world, as well as their everyday lives.\r\n\r\nNotably, the movie is enjoying big popularity for vividly depicting BIGBANG’s concert on the three-side screen and for displaying BIGBANG’s true heart about their serious attitude toward music and performance, gratitude for fans who have been with them for 10 years, and thoughts about the renewal of contract with YG.","post_date":"2016-07-14","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BB-MADE.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BB-MADE.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BB-MADE.jpg","excerpt":"“BIGBANG MADE” will be released in ten more countries including LA in the United States and Hong Kong","url_friendly_name":"bigbang-made-will-be-released-in-ten-more-countries-including-la-in-the-united-states-and-hong-kong","artist_id":454,"related_event":[]},"1437":{"id":1437,"post_title":"[Exclusive] BLACKPINK to Promote Their Album from July until the End of This Year with At Least 8 Music Videos","post_content":"[스타뉴스=길혜성 기자] YG Entertainment is providing full support to its new four-member girl group BLACKPINK.\r\n\r\nBLACKPINK is to officially debut at the end of this month, and they will promote the tracks in their debut album until the end of this year. They are to shoot music videos for all the tracks in their album. As of now, they plan to shoot at least eight music videos.\r\n\r\nThis shows that YG Entertainment has high hopes for BLACKPINK, which is YG’s first new girl group in seven years after they launched 2NE1 in 2009.\r\n\r\nA high-ranking official of YG informed Star News in the afternoon of July, “The debut song of BLACKPINK will be released at the end of this month, and until the end of December, we will release new songs one by one.”\r\n\r\nHe also said, “Because nowadays the music industry evolves around digital singles, if you release an album, only the title track will get attention. We think that all BLACKPINK’s songs are great, and that’s why we decided to released them one by one.”\r\n\r\nHe went on to say, “TEDDY was in charge of producing BLACKPINK’s debut album, and for the past two years, he had put in a lot of effort into making music that suits BLACKPINK. Currently, he has completed eight songs, and BLACKPINK is going to shoot music videos for all the tracks in their debut album. So, as of now, our plan is to shoot at least eight music videos.”\r\n\r\n“They have already completed two music videos and are currently shooting another one. The target of BLACKPINK is not only the domestic market but also the global market, so we are working extra hard to make high-quality songs and high-quality music videos.”\r\n\r\nMeanwhile, BLACKPINK has JENNIE, LISA, JISOO, and ROSÉ as its members, and the average age of the members is 19. Expectations are running high as they have the looks and the talent to make it to the top.","post_date":"2016-07-12","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_9.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_9.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BP_9.jpg","excerpt":"[Exclusive] BLACKPINK to Promote Their Album from July until the End of This Year with At Least 8 Music Videos","url_friendly_name":"exclusive-blackpink-to-promote-their-album-from-july-until-the-end-of-this-year-with-at-least-8-music-videos","artist_id":602,"related_event":[1369,1268,1254]},"1849":{"id":1849,"post_title":"PSY Sets another New Record with “GANGNAM STYLE” Surpassing 2.6 Billion YouTube Views","post_content":"[OSEN=최나영 기자] The music video of PSY’s “GANGNAM STYLE” surpassed 2.6 billion views on YouTube, setting a new record once again.\r\n\r\nAt 9 PM on July 2, “GANGNAM STYLE” music video surpassed the 2.6 billion mark on YouTube and set a new record once again.\r\n\r\nSince its release in July 2012, “GANGNAM STYLE” has gained worldwide popularity. The music video posted 2.4 billion views in August last year and 2.5 billion views in January this year. Six months afterwards, in July this year, the “GANGNAM STYLE” music video surpassed 2.6 billion views.\r\n\r\nGoogle’s YouTube increased the maximum view count from 2.1 billion to 9.22 quintillion in March last year because of the record-breaking views of “GANGNAM STYLE”.\r\n\r\nPSY’s other music videos have also gone viral. His “GENTLEMEN” music video, which was released in 2013, has almost reached the one billion mark. The music videos of “DADDY”, “HANGOVER”, “OPPA IS JUST MY STYLE” all surpassed 100 million YouTube views. PSY now has five mega hit music videos that surpassed 100 million YouTube views.\r\n\r\nNow that PSY’s “GANGNAM STYLE” became the most watched music video in the world with 2.6 billion YouTube views, it will be interesting to see how it will keep on setting new records.\r\n\r\nMeanwhile, PSY appeared as a mentor on China’s “The Remix”, which premiered on June 19, and showed off his excellent producing skills.","post_date":"2016-07-03","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201607030803770135_5778490a75271_99_20160703080803.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201607030803770135_5778490a75271_99_20160703080803.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201607030803770135_5778490a75271_99_20160703080803.jpg","excerpt":"PSY Sets another New Record with “GANGNAM STYLE” Surpassing 2.6 Billion YouTube Views","url_friendly_name":"psy-sets-another-new-record-with-gangnam-style-surpassing-2-6-billion-youtube-views","artist_id":277,"related_event":[]},"1842":{"id":1842,"post_title":"iKON to Hold their 2nd Arena Tour in Japan, Which is Very Unusual for a Rookie","post_content":"[동아닷컴=홍세영 기자] iKON will go on their second arena tour in Japan. Not even a year has passed since iKON’s debut, and it is very unusual for such a rookie to go on two arena tours.\r\nFor their second arena tour, iKON will hold 14 concerts in five cities: at the Makuhari Messe, Chiba on September 10-11; at the Nihon Gaishi Hall, Aichi on September 24-25; at the Osaka Jo Hall, Osaka on October 5-6; at the Kobe World Memorial Hall, Hyogo on October 8; and at the Marine Messe Fukuoka, Fukuoka on October 10. Their concerts are expected to draw a total of 150,000 fans.\r\nEarlier on, iKON kicked off their first arena tour under the title of “iKONCERT 2016 SHOWTIME TOUR IN JAPAN” at the Marine Messe Fukuoka on February 11. They put on 14 concerts in five cities, drawing 146,000 people. More than 250,000 people applied for the tickets to their concerts.\r\nIn January, iKON’s Japan debut album “WELCOME BACK” became no.1 on Oricon’s daily CD album chart. The total number of sales of iKON’s debut album “WELCOME BACK” and their repackaged album “WELCOME BACK COMPLETE EDITION” adds up to 120,000, a whopping record if you consider that iKON is still a rookie and foreign artist in Japan.\r\n\r\n\r\nMeanwhile, iKON is casted on China’s audition show “The Remix” along with their labelmate PSY. Currently, they are spending most of their time in China to shoot the show. \r\nIn the upcoming July, iKON is to hold concerts in Thailand, Singapore, and Indonesia as part of their first Asia tour “iKONCERT 2016-SHOWTIME TOUR”.","post_date":"2016-07-01","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/78973638.1_99_20160701170807.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/78973638.1_99_20160701170807.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/78973638.1_99_20160701170807.jpg","excerpt":"iKON to Hold their 2nd Arena Tour in Japan, Which is Very Unusual for a Rookie","url_friendly_name":"ikon-to-hold-their-2nd-arena-tour-in-japan-which-is-very-unusual-for-a-rookie","artist_id":241,"related_event":[]},"1851":{"id":1851,"post_title":"BIGBANG hosts an exhibition to celebrate 10th anniversary of their debut… “Shows BIGBANG’s past, present, and future”","post_content":"[동아닷컴=홍세영 기자] BIGBANG hosts exhibition titled “BIGBANG10 THE EXHIBITION: A TO Z”, in celebration of the 10thanniversary of their debut. \r\nStarting from film “BIGBANG MADE” that is the first of the projects for celebration of the 10th anniversary of BIGBANG’s debut, BIGBANG will meet fans in a variety of channels, including “BIGBANG10 THE CONCERT : 0.TO.10” concert on August 20 and the exhibition. \r\nThe exhibition “BIGBANG10 THE EXHIBITION: A TO Z” will be hosted from August 5 to October 30 at S-FACTORY located in Seongsu-dong, Seongdong-gu, Seoul.\r\nThe exhibition that shows the past, present, and future of BIGBANG will give visitors an opportunity to look into BIGBANG from a variety of perspectives, in line with the theme of “Five perspectives to see BIGBANG” under which 26 words directly picked by the members of BIGBANG in an order from alphabet A to Z.\r\nNotably, the exhibition will offer a one-stop experience to see all the pieces of work that represent BIGBANG for the past 10 years, including their albums, photos, costumes, videos, interviews, music video sets, and concert stages, as well as contents newly created in celebration of the 10th anniversary. Therefore, the exhibition will provide fans with a very special chance to witness the new future ahead of BIGBANG.\r\nThe exhibition is not just for showing, unlike art galleries and museums are. Anticipation for the exhibition is growing high, as BIGBANG members themselves cherry-picked every piece of the display out of important things that have made today’s BIGBANG and the exhibition itself has a format which enables close communication between BIGBANG and fans with direct participation of BIGBANG members in the planning and production.\r\nFurthermore, an interactive section in which visitors can get first-hand experience and enjoy tryout events will be created. Including VR tryout, video-playing, and an opportunity to listen to playlists of BIGBANG’s own selection, spaces to give special experiences for visitors will be available at exhibition “BIGBANG10 THE CONCERT : 0.TO.10”.","post_date":"2016-07-01","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/78964052.2_99_20160701091005.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/78964052.2_99_20160701091005.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/78964052.2_99_20160701091005.jpg","excerpt":"BIGBANG hosts an exhibition to celebrate 10th anniversary of their debut… “Shows BIGBANG’s past, present, and future”","url_friendly_name":"bigbang-hosts-an-exhibition-to-celebrate-10th-anniversary-of-their-debut-shows-bigbangs-past-present-and-future","artist_id":454,"related_event":[]},"1892":{"id":1892,"post_title":"[Midnight New Song] Zion.T X KUSH, “MACHINE GUN” and “Koong” released on-line","post_content":"[OSEN=박소영 기자] You can finally listen to these songs as much as you want. The songs, Zion.T and KUSH’s “Koong” and “MACHINE GUN”, which had been available only in broadcasting replay service, are now released on-line.\r\n“Koong” and “MACHINE GUN” sung by Zion.T and KUSH in Mnet “Show Me the Money 5”s producer competition have been released on on-line music-streaming websites,on June 29 at 0AM. Right after the two songs were aired on June 10 in “Show Me the Money” show, viewers of the show have been requesting their on-line release. \r\n“Koong” touches the hearts of listeners, with Zion.T’s solo rap and vocal. Zion.T’s flagship murmuring rap and deeply sentimental vocal catch the ears of listeners. The song captivated music fans, to be called the second “Yanghwa BRDG”. Zion.T’s such delicate sentiment is well expressed in the song released on-line as well.\r\nOn the contrary, “MACHINE GUN” is a song of full hip-hop swag. Its exciting verse added by Zion.T’s dynamic rap make listeners naturally dance to the rhythm. SONG MINHO’s powerful rap gives some more weight and power to the song. The harmony between the three talented YG artists sounds really great.\r\nThe performance of the songs excited the audience. “Show Me the Money 5”s contestants who watched the performances of “Koong” and “MACHINE GUN” were also fascinated by the songs, so most of them picked the team of Zion.T and KUSH when they had to select their own teams. The audience was fascinated, too. The YG team became the most sought-after team, for the performance of the two songs.\r\nThanks to many requests from the viewers of “Show Me the Money”, “Koong” and “MACHINE GUN” are now available on on-line music-streaming websites. Naturally, the two songs are expected to take high ranks on music charts. Music fans’ hearts will continue to be captivated by Zion.T and KUSH’s “Koong” and “MACHINE GUN”.","post_date":"2016-06-29","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201606281821773656_57725a04c27ba_99_20160629000104.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201606281821773656_57725a04c27ba_99_20160629000104.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201606281821773656_57725a04c27ba_99_20160629000104.jpg","excerpt":"[Midnight New Song] Zion.T X KUSH, “MACHINE GUN” and “Koong” released on-line","url_friendly_name":"midnight-new-song-zion-t-x-kush-machine-gun-and-koong-released-on-line","artist_id":1903,"related_event":[]},"1856":{"id":1856,"post_title":"YG’s new girl group has confirmed to be “BLACKPINK” with four members… TEDDY is the dedicated producer [Final announcement about YG’s new girl group]","post_content":"[OSEN=최나영 기자] YG Entertainment (“YG”)’s next girl group has confirmed to be “BLACKPINK” with four members.\r\nAccording to the official announcement made on YG’s official blog on June 29, YG’s new girl group to be launched eight years after 2NE1 is named “BLACKPINK”, with four members of JENNIE, JISOO, LISA, and ROSÉ who have been unveiled so far. \r\n\r\nThe average age of the four members of BLACKPINK is 19. They joined YG as trainees at the age of 13 to 15 and have been trained hard for four to six years. Therefore, they are the most talented trainees of YG, according to insiders. \r\nAccording to a high-ranking insider of YG, the new girl group was originally supposed to have total nine members. However, two years ago, YG’s head YANG HYUN SUK changed the plan to make four of them debut first.  \r\n\r\nEven though what YANG has in his mind is not clear as of now, the rest of the five trainees are still working at YG. So, it is known that YG people regard BLACKPINK as a unit of the new girl group to make debut first. \r\nYANG HYUN SUK designated YG’s main producer TEDDY who have taken part in producing of many hit songs of BIGBANG and 2NE1 as the dedicated producer for BLACKPINK. TEDDY has been working on writing the lyrics and melody of all the songs of BLACKPINK as well as producing for the past two years, to recently complete the debut album. \r\n\r\nAn YG insider explained about the name “BLACKPINK”, saying, “’BLACKPINK’ has a meaning of a little bit twist for the pink color which is usually thought to be a pretty color. The message it conveys is that ‘Being pretty is not enough’. So, the team name suggests that this team has both pretty appearance and talent as an artist”.\r\nPlus, just as special products are “black-labeled”, “BLACKPINK” means the special quality of the new girl group. \r\n\r\nYG is now concentrating on the final touch to the preparation for BLACKPINK’s successful debut, including choreography for the debut song worked by four famous foreign choreographers.","post_date":"2016-06-29","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201606290929771630_57731c5fde1f4_99_20160629103905.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201606290929771630_57731c5fde1f4_99_20160629103905.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201606290929771630_57731c5fde1f4_99_20160629103905.jpg","excerpt":"YG’s new girl group has confirmed to be “BLACKPINK” with four members… TEDDY is the dedicated producer [Final announcement about YG’s new girl group]","url_friendly_name":"ygs-new-girl-group-has-confirmed-to-be-blackpink-with-four-members-teddy-is-the-dedicated-producer-final-announcement-about-ygs-new-girl-group","artist_id":602,"related_event":[]},"1862":{"id":1862,"post_title":"[Pop-up Review] “BIGBANG MADE”, #performance #members #future of BIGBANG who celebrates the 10th anniversary of debut","post_content":"[헤럴드POP=노윤정 기자] The way of BIGBANG’s celebration of the 10th anniversary of their debut is so special. \r\n“BIGBANG MADE”, the first of projects prepared to celebrate the 10th anniversary of BIGBANG’s debut, was unveiled in the media preview held in the afternoon on the 28. “BIGBANG MADE” is a documentary film that depicts the 340-day-long world tour concert “MADE” held in 32 cities in 13 countries. \r\n“It is like the excited feeling you feel before you go to see your loved one after a long time”\r\nOn May 1 last year, BIGBANG excited fans by releasing new songs three years after “STILL ALIVE” released in 2012. Under the name of “MADE” series, BIGBANG released a single album with more than one song every month for four months until August that year. Wondering about the outcome? Every song swept music charts upon its release and music fans could see unusual phenomenon of BIGBANG songs taking top places on charts away from other BIGBANG songs.\r\nAfter making the long-awaited comeback, BIGBANG went off for their second world tour beginning from a concert in Seoul. BIGBANG who stood before fans as a complete team after a long time of absence made much effort to present more perfect performances. In order to show perfectly flawless performances, all the members actively took part in the preparation, from the very beginning. As the members themselves had such high expectations for the tour, they felt bigger disappointment when things did not turn out as planned. The hard-work put in the preparation of BIGBANG’s tour concert is all vividly demonstrated in movie “BIGBANG MADE”.\r\nBIGBANG members encouraged concert staff and sometimes, they gave bitter criticism for a better concert. They tried to take care of every single detail including whether to call the city they were in “LA” or “OC”. As a result, fans acclaimed everything BIGBANG showed on the stage. The images of the concert in movie “MADE” give a chance to experience the heat of the concert, though indirectly.\r\n\r\n“He gets upset when I do it. That looks really cute”\r\nDocumentary film “BIGBANG MADE” also demonstrates BIGBANG’s fun everyday lives, not just their performances on the stage. All the members are professionals who have been standing on the stage for 11 years when performing, but in their everyday lives, they are Gwon Ji-yong, Dong Young-bae, Choi Seung-hyun, Kang Daesung, and Lee Seung-hyun, men in their twenties who give off different appeals.\r\nThey made jokes on one another in waiting room, taking video of other members in shower, saying some bad words to others’ naughty jokes. When they were shooting the music video of “WE LIKE 2 PARTY” while drunken in Jeju Island, they looked just like mischievous boys travelling and playing with friends.\r\nThe members were like family for the staff and the closest and dearest friends for each other, who are going through the most shining chapter in their lives together. That is well-displayed in the honest conversations and interviews of the members, in “BIGBANG MADE”.\r\n“I thought these days would never come again”\r\nBIGBANG openly talked about some sensitive and heavy topics as well, in movie “BIGBANG MADE”. They answered to questions about the renewal of the contract with the current label as well as BIGBANG’s future, which are the questions about which fans are most curious.\r\nWhen BIGBANG came back to the music scene after a long-time absence, the issue of BIGBANG’s choice was raised. Many people paid keen attention to whether BIGBANG will renew their contract with YG Entertainment. However, in last November, BIGBANG decided to stay with YG Entertainment, saying that “We have never thought of leaving YG, as it is like our home”. Even though it is true that there have been some moments of crisis so far, the members reached an agreement to stably maintain the team.\r\nBIGBANG members also opened talked about what they felt like about their imminent military service. Nobody knows when the members could stand on the stage as a complete team again. The members said that they worked even harder to give a good memory for foreign fans, as they don’t know when they could see overseas fans again.\r\nAs such, “BIGBANG MADE” depicts the life of the top idol group who celebrates the 10th anniversary of their debut, as well as the daily lives of the members of the group who are also young men living their lives with fierce efforts. The movie openly talks about BIGBANG’s true hearts to look back the past 10 years of BIGBANG’s history and to make fans have even bigger expectations for the next 10 years. The movie will be released to the general public on June 30. ","post_date":"2016-06-29","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201606290614022421323_20160629061441_01_99_20160629063103.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201606290614022421323_20160629061441_01_99_20160629063103.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201606290614022421323_20160629061441_01_99_20160629063103.jpg","excerpt":"[Pop-up Review] “BIGBANG MADE”, #performance #members #future of BIGBANG who celebrates the 10th anniversary of debut","url_friendly_name":"pop-up-review-bigbang-made-performance-members-future-of-bigbang-who-celebrates-the-10th-anniversary-of-debut","artist_id":454,"related_event":[]},"1917":{"id":1917,"post_title":"[OSEN=박소영 기자] You can finally listen to these songs as much as you want. The songs, Zion.T and KUSH’s “Koong” and “MACHINE GUN”, which had been available only in broadcasting replay service, are now released on-line.  “Koong” and “MACHINE GUN” sung by Zion.T and KUSH in Mnet “Show Me the Money 5”s producer competition have been released on on-line music-streaming websites,on June 29 at 0AM. Right after the two songs were aired on June 10 in “Show Me the Money” show, viewers of the show have been requesting their on-line release.   “Koong” touches the hearts of listeners, with Zion.T’s solo rap and vocal. Zion.T’s flagship murmuring rap and deeply sentimental vocal catch the ears of listeners. The song captivated music fans, to be called the second “Yanghwa BRDG”. Zion.T’s such delicate sentiment is well expressed in the song released on-line as well.  On the contrary, “MACHINE GUN” is a song of full hip-hop swag. Its exciting verse added by Zion.T’s dynamic rap make listeners naturally dance to the rhythm. SONG MINHO’s powerful rap gives some more weight and power to the song. The harmony between the three talented YG artists sounds really great.  The performance of the songs excited the audience. “Show Me the Money 5”s contestants who watched the performances of “Koong” and “MACHINE GUN” were also fascinated by the songs, so most of them picked the team of Zion.T and KUSH when they had to select their own teams. The audience was fascinated, too. The YG team became the most sought-after team, for the performance of the two songs.  Thanks to many requests from the viewers of “Show Me the Money”, “Koong” and “MACHINE GUN” are now available on on-line music-streaming websites. Naturally, the two songs are expected to take high ranks on music charts. Music fans’ hearts will continue to be captivated by Zion.T and KUSH’s “Koong” and “MACHINE GUN”.","post_content":"\r\n\r\n[스타뉴스=김미화 기자] “BIGBANG’s past ten years can create a whole movie”\r\nGroup BIGBANG (G-DRAGON, TAEYANG, T.O.P, DAESUNG, and SEUNGRI) released a movie that celebrates the 10thanniversary of their debut. \r\nOn June 28 in the afternoon, BIGBANG met fans in NAVER V-APP’s “BIGBANG10 THE MOVIE ‘BIGBANG MADE’ MOVIE TALK”.\r\nIn the afternoon, BIGBANG had the media preview of “BIGBANG MADE”, where they made the first public appearance as a complete team in three months.\r\nGreeting fans who came to see them, BIGBANG said, “The movie will show you the real BIGBANG”.\r\nG-DRAGON said, “I’m grateful that so many people came to see our movie. It’s been quite some time since all the five of us made a public appearance together. I hope you enjoy the movie and talk about it to your family and friends. It is my first time to greet people for my movie”.\r\nThen, T.O.P said, “It’s been a while since I saw Korean fans. Thank you for saving your time to see the BIGBANG movie. Hope you get a good memory”. TAEYANG said, “It’s been a long time since I saw my fans last time. It’s really nice to see you and I missed you so much. Our past ten years have become a movie. It is surprising for ourselves, too. The movie shows much about who we really are. Please enjoy the movie”.\r\nDAESUNG said, “We shot this movie, but actually, it is more like a documentary that shows what we’re like behind the scenes, than a film. Please enjoy the movie, as you can peek into what BIGBANG is like in our daily lives”. SEUNGRI said, “I believe that the movie will quench your thirst. We show everything about us in the movie. It’s a real documentary”.\r\nThen, BIGBANG joined MC Kim Saeng-min, to continue with their movie talk. DAESUNG introduced the movie by saying, “We’re a carefree and easygoing group and you can see even more carefree and easygoing BIGBANG in the movie”. G-DRAGON said, “Actually, people do not know much about us, except for us singing and dancing. I think what people are curious about is what we’re like in our everyday lives. The movie is just about that”.\r\nBIGBANG also showed off their special friendship, making jokes on each other. Notably, SEUNGRI boasted his talent by saying words of greetings in Korean, Japanese, Chinese, and English. On the day, BIGBANG members made promise of holding a guerilla concert if the movie records 100,000 viewers, and unveiling SEUNGRI’s shower scene not included in the movie if it records 500,000 viewers.\r\nBIGBANG’s comeback not on the stage but in the screen is drawing keen attention about what kind of fun and touching stories they will deliver to fans.\r\n“BIGBANG MADE” is movie that reveals true hearts of the five guys of BIGBANG: Gwon Ji-yong, Dong Young-bae, Choi Seung-hyun, Kang Daesung, and Lee Seung-hyun, who say that they were born to be BIGBANG.","post_date":"2016-06-29","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/2016062817515495005_1_99_20160628184704.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/2016062817515495005_1_99_20160628184704.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/2016062817515495005_1_99_20160628184704.jpg","excerpt":"[OSEN=박소영 기자] You can finally listen to these songs as much as you want. The songs, Zion.T and KUSH’s “Koong” and “MACHINE GUN”, which had been available only in broadcasting replay service, are now released on-line.  “Koong” and “MACHINE GUN” sung by Zion.T and KUSH in Mnet “Show Me the Money 5”s producer competition have been released on on-line music-streaming websites,on June 29 at 0AM. Right after the two songs were aired on June 10 in “Show Me the Money” show, viewers of the show have been requesting their on-line release.   “Koong” touches the hearts of listeners, with Zion.T’s solo rap and vocal. Zion.T’s flagship murmuring rap and deeply sentimental vocal catch the ears of listeners. The song captivated music fans, to be called the second “Yanghwa BRDG”. Zion.T’s such delicate sentiment is well expressed in the song released on-line as well.  On the contrary, “MACHINE GUN” is a song of full hip-hop swag. Its exciting verse added by Zion.T’s dynamic rap make listeners naturally dance to the rhythm. SONG MINHO’s powerful rap gives some more weight and power to the song. The harmony between the three talented YG artists sounds really great.  The performance of the songs excited the audience. “Show Me the Money 5”s contestants who watched the performances of “Koong” and “MACHINE GUN” were also fascinated by the songs, so most of them picked the team of Zion.T and KUSH when they had to select their own teams. The audience was fascinated, too. The YG team became the most sought-after team, for the performance of the two songs.  Thanks to many requests from the viewers of “Show Me the Money”, “Koong” and “MACHINE GUN” are now available on on-line music-streaming websites. Naturally, the two songs are expected to take high ranks on music charts. Music fans’ hearts will continue to be captivated by Zion.T and KUSH’s “Koong” and “MACHINE GUN”.","url_friendly_name":"osen%eb%b0%95%ec%86%8c%ec%98%81-%ea%b8%b0%ec%9e%90-you-can-finally-listen-to-these-songs-as-much-as-you-want-the-songs-zion-t-and-kushs-koong-and-machine-gun","artist_id":454,"related_event":[]},"1955":{"id":1955,"post_title":"[스타뉴스=김미화 기자] “BIGBANG’s past ten years can create a whole movie”  Group BIGBANG (G-DRAGON, TAEYANG, T.O.P, DAESUNG, and SEUNGRI) released a movie that celebrates the 10th anniversary of their debut.   On June 28 in the afternoon, BIGBANG met fans in NAVER V-APP’s “BIGBANG10 THE MOVIE ‘BIGBANG MADE’ MOVIE TALK”.  In the afternoon, BIGBANG had the media preview of “BIGBANG MADE”, where they made the first public appearance as a complete team in three months.  Greeting fans who came to see them, BIGBANG said, “The movie will show you the real BIGBANG”.  G-DRAGON said, “I’m grateful that so many people came to see our movie. It’s been quite some time since all the five of us made a public appearance together. I hope you enjoy the movie and talk about it to your family and friends. It is my first time to greet people for my movie”.  Then, T.O.P said, “It’s been a while since I saw Korean fans. Thank you for saving your time to see the BIGBANG movie. Hope you get a good memory”. TAEYANG said, “It’s been a long time since I saw my fans last time. It’s really nice to see you and I missed you so much. Our past ten years have become a movie. It is surprising for ourselves, too. The movie shows much about who we really are. Please enjoy the movie”.  DAESUNG said, “We shot this movie, but actually, it is more like a documentary that shows what we’re like behind the scenes, than a film. Please enjoy the movie, as you can peek into what BIGBANG is like in our daily lives”. SEUNGRI said, “I believe that the movie will quench your thirst. We show everything about us in the movie. It’s a real documentary”.  Then, BIGBANG joined MC Kim Saeng-min, to continue with their movie talk. DAESUNG introduced the movie by saying, “We’re a carefree and easygoing group and you can see even more carefree and easygoing BIGBANG in the movie”. G-DRAGON said, “Actually, people do not know much about us, except for us singing and dancing. I think what people are curious about is what we’re like in our everyday lives. The movie is just about that”.  BIGBANG also showed off their special friendship, making jokes on each other. Notably, SEUNGRI boasted his talent by saying words of greetings in Korean, Japanese, Chinese, and English. On the day, BIGBANG members made promise of holding a guerilla concert if the movie records 100,000 viewers, and unveiling SEUNGRI’s shower scene not included in the movie if it records 500,000 viewers.  BIGBANG’s comeback not on the stage but in the screen is drawing keen attention about what kind of fun and touching stories they will deliver to fans.  “BIGBANG MADE” is movie that reveals true hearts of the five guys of BIGBANG: Gwon Ji-yong, Dong Young-bae, Choi Seung-hyun, Kang Daesung, and Lee Seung-hyun, who say that they were born to be BIGBANG.","post_content":"[스타뉴스=윤성열 기자] Popular idol group BIGBANG (DAESUNG, T.O.P, SEUNGRI, G-DRAGON, and TAEYANG) is making a public appearance as a complete team, after a long time of absence.\r\n\r\nBIGBANG will attend the media preview event for movie “BIGBANG MADE”, a music documentary film that celebrates the 10thanniversary of BIGBANG’s debut, which is held on June 28 at CGV Yeongdeungpo located in Yeongdeungpo-gu, Seoul. \r\n\r\nIt is the first time for all the five members of BIGBANG to make a public appearance together in four months since their world tour concert “MADE” held from March 4 to 6 at the Gymnastics Arena of Olympic Park in Songpa-gu, Seoul.\r\n\r\nAs the preview is a very meaningful occasion to unveil BIGBANG’s documentary film that celebrates the team’s 10thanniversary, all the five members decided to attend the event together, despite their busy schedules. Notably, SEUNGRI will directly go to the preview right after his schedule in China on the day. \r\n\r\nAfter giving short greetings for the media in the preview, BIGBANG will meet viewers in advance in NAVER V-APP’s movie talk. BIGBANG will also attend the following VIP preview.\r\n\r\n\r\n\r\n“BIGBANG MADE” is a film that vividly depicts BIGBANG’s “MADE” tour concerts that were held in 32 cities in 13 countries. It was produced on the occasion of the 10th anniversary of BIGBANG’s debut. The film will show the member’s true hearts that have not been able to be unveiled on TV so far, as well as what they are actually like in their everyday lives.  \r\n\r\n“BIGBANG MADE” will be released in the 2D and Screen X version at CGV. Screen X is a technology that plays films on three sides of the front, left, and right. The 2D version of “BIGBANG MADE” runs for 114 minutes, and the “Screen X” version for 122 minutes. The movie will be released on the 30 this month.","post_date":"2016-06-28","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/2016062811352898384_1_99_20160628120315.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/2016062811352898384_1_99_20160628120315.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/2016062811352898384_1_99_20160628120315.jpg","excerpt":"[스타뉴스=김미화 기자] “BIGBANG’s past ten years can create a whole movie”  Group BIGBANG (G-DRAGON, TAEYANG, T.O.P, DAESUNG, and SEUNGRI) released a movie that celebrates the 10th anniversary of their debut.   On June 28 in the afternoon, BIGBANG met fans in NAVER V-APP’s “BIGBANG10 THE MOVIE ‘BIGBANG MADE’ MOVIE TALK”.  In the afternoon, BIGBANG had the media preview of “BIGBANG MADE”, where they made the first public appearance as a complete team in three months.  Greeting fans who came to see them, BIGBANG said, “The movie will show you the real BIGBANG”.  G-DRAGON said, “I’m grateful that so many people came to see our movie. It’s been quite some time since all the five of us made a public appearance together. I hope you enjoy the movie and talk about it to your family and friends. It is my first time to greet people for my movie”.  Then, T.O.P said, “It’s been a while since I saw Korean fans. Thank you for saving your time to see the BIGBANG movie. Hope you get a good memory”. TAEYANG said, “It’s been a long time since I saw my fans last time. It’s really nice to see you and I missed you so much. Our past ten years have become a movie. It is surprising for ourselves, too. The movie shows much about who we really are. Please enjoy the movie”.  DAESUNG said, “We shot this movie, but actually, it is more like a documentary that shows what we’re like behind the scenes, than a film. Please enjoy the movie, as you can peek into what BIGBANG is like in our daily lives”. SEUNGRI said, “I believe that the movie will quench your thirst. We show everything about us in the movie. It’s a real documentary”.  Then, BIGBANG joined MC Kim Saeng-min, to continue with their movie talk. DAESUNG introduced the movie by saying, “We’re a carefree and easygoing group and you can see even more carefree and easygoing BIGBANG in the movie”. G-DRAGON said, “Actually, people do not know much about us, except for us singing and dancing. I think what people are curious about is what we’re like in our everyday lives. The movie is just about that”.  BIGBANG also showed off their special friendship, making jokes on each other. Notably, SEUNGRI boasted his talent by saying words of greetings in Korean, Japanese, Chinese, and English. On the day, BIGBANG members made promise of holding a guerilla concert if the movie records 100,000 viewers, and unveiling SEUNGRI’s shower scene not included in the movie if it records 500,000 viewers.  BIGBANG’s comeback not on the stage but in the screen is drawing keen attention about what kind of fun and touching stories they will deliver to fans.  “BIGBANG MADE” is movie that reveals true hearts of the five guys of BIGBANG: Gwon Ji-yong, Dong Young-bae, Choi Seung-hyun, Kang Daesung, and Lee Seung-hyun, who say that they were born to be BIGBANG.","url_friendly_name":"%ec%8a%a4%ed%83%80%eb%89%b4%ec%8a%a4%ea%b9%80%eb%af%b8%ed%99%94-%ea%b8%b0%ec%9e%90-bigbangs-past-ten-years-can-create-a-whole-movie-group-bigbang-g-dragon-taeyang-t-o","artist_id":454,"related_event":[]},"1968":{"id":1968,"post_title":"BIGBANG Continues with their China Tour and is to Meet Fans in Dalian Today (Jun.26)","post_content":"[스타뉴스=길혜성 기자] The most iconic K-Pop idol group BIGBANG (G-DRAGON,T.O.P, TAEYANG,DAESUNG, and SEUNGRI) is to meet their fans in Dalian, China.\r\n\r\nBIGBANG’s fan meeting will be held in the afternoon of June 26 in Dalian, China. The event is part of BIGBANG’s “2016 BIGBANG MADE V.I.P TOUR”.\r\n\r\nEarlier on, starting off their fan meeting in Beijing in March, BIGBANG held fan meetings in eight Chinese cities including Zhengzhou, Nanjing, Hefei, and Hangzhou for four weeks as their “2016 BIGBANG MADE V.I.P TOUR”, and all the tickets to their fan meetings were sold.\r\n\r\nTo accommodate the enthusiastic response of their Chinese fans, BIGBANG restarted their fan meeting tour by holding a fan meeting in Foshan. So far, they held fan meetings in Nanning and Harbin.\r\n\r\nBIGBANG’s fan meeting for this tour consists of a mini concert and a chatting time, so expectations are running high for their fan meeting in Dalian.\r\n\r\nAfter their Dalian fan meeting, BIGBANG will continue with their tour and hold fan meetings in Chongqing and Chengdu in early July.\r\n\r\nMeanwhile, BIGBANG’s MADE SERIES album, which was released on February 3 in Japan, ranked 10th on Oricon’s 50 most sold albums chart with 194,992 copies sold. BIGBANG was the only K-Pop artist on the chart.","post_date":"2016-06-26","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/2016062416365968878_1_99_20160626080504.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/2016062416365968878_1_99_20160626080504.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/2016062416365968878_1_99_20160626080504.jpg","excerpt":"BIGBANG Continues with their China Tour and is to Meet Fans in Dalian Today (Jun.26)","url_friendly_name":"bigbang-continues-with-their-china-tour-and-is-to-meet-fans-in-dalian-today-jun-26","artist_id":454,"related_event":[]},"1449":{"id":1449,"post_title":"WINNER kicked off third Japan tour… LEE SEUNGHOON performed hard despite back injury","post_content":"[스타뉴스=윤성열 기자] Group WINNER (KANG SEUNGYOON, LEE SEUNGHOON, SONG MINHO, NAM TAEHYUN, and KIM JINWOO) has kicked off their third Japan concert tour.\r\nAccording to YG Entertainment on June 20, WINNER kicked off their third Japan tour “2016 WINNER EXIT TOUR IN JAPAN” by holding concerts on June 18 and 19 at Makuhari Messe Event Hall in Chiba Prefecture, Japan. \r\nWINNER began the concert by performing “Love is a Lie” of their first album “2015 S\/S”. They gave passionate performance in funky style jackets, on a sophisticated stage set that looked like a street in London. \r\nThen, WINNER sang the Japanese version of “SENTIMENTAL”, one of the double title tracks of “EXIT:E” album released early this year, to be acclaimed by fans. Then, WINNER performed their hit songs including “empty” and “COLOR RING”. For more than two hours, WINNER performed total 22 songs. \r\n\r\nLEE SEUNGHOON performed passionately on the stage despite his back injury, for fans who have long waited for WINNER concert. LEE SEUNGHOON said, “I’m sorry that I was hurt. However, please enjoy the concert, as we have worked so hard for it”. \r\nWINNER will continue with the Japan tour, holding concert on June 25 and 26 at Sun Palace Hotel &amp; Hall in Fukuoka. ","post_date":"2016-06-20","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/WINNER.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/WINNER.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/WINNER.jpg","excerpt":"WINNER kicked off third Japan tour… LEE SEUNGHOON performed hard despite back injury","url_friendly_name":"winner-kicked-off-third-japan-tour-lee-seunghoon-performed-hard-despite-back-injury","artist_id":514,"related_event":[]},"1451":{"id":1451,"post_title":"Music video of BIGBANG’s “LOSER” surpassed 100 million views… BIGBANG’s 4th music video of 100 million views","post_content":"[일간스포츠=황미현 기자] The music video of BIGBANG’s “LOSER” has surpassed 100 million views on YouTube.\r\nThe music video of “LOSER” recorded 100,000,207 views as of June 14 in the morning, to surpass 100 million views mark. The video that was released in April 2015 drew big attention from major media outlets both in and out of the country such as American Billboard and FUSE TV and it enjoyed big popularity, surpassing 10 million views within 88 hours of release.\r\nThe number of the video has recorded a consistent growth, to finally reach the 100 million mark. The record has made BIGBANG the first Korean boy group who has total four music videos that surpassed 100 million views on YouTube. So far, the videos of BIGBANG’s “FANTASTIC BABY”, “BANG BANG BANG”, and GD&amp;TAEYANG’s “GOOD BOY” have recorded 100 million views on YouTube.\r\n“LOSER” is the title track of “MADE SERIES”’s first album “M” released last year. The song has BIGBANG’s flagship hip-hop feel and impressively catchy repeat part. With “MADE SERIES”, BIGBANG not only proved their popularity by sweeping top places on music charts in and out of the country and TV music shows of public and cable TV network, but also received as many as 21 trophies in six major music awards in 2015, including Melon Music Awards, MAMA, Seoul Music Awards, Golden Disc Awards, and Gaon Chart Music Awards. Such record made BIGBANG get recognized as an artist of remarkable popularity and quality music.\r\nAs this year marks the 10th anniversary of BIGBANG’s debut, the team is now preparing for a variety of projects to celebrate the big event. “BIGBANG MADE”, the movie which is the beginning of those celebratory projects, will be exclusively released at CGV on June 30. ","post_date":"2016-06-14","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BB__2.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BB__2.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/BB__2.jpg","excerpt":"Music video of BIGBANG’s “LOSER” surpassed 100 million views… BIGBANG’s 4th music video of 100 million views","url_friendly_name":"music-video-of-bigbangs-loser-surpassed-100-million-views-bigbangs-4th-music-video-of-100-million-views","artist_id":454,"related_event":[]},"1618":{"id":1618,"post_title":"iKON’s China Tour Reached the Grand Finale in the Run Up to their Concerts in Bangkok and Singapore in July","post_content":"[OSEN=선미경 기자] iKON has successfully completed their China tour.\r\n\r\nOn June 12, iKON held the last concert of their China tour under the title of “‘iKONCERT 2016 ‘SHOWTIME TOUR’ IN SHANGHAI” at the Grand Stage in Shanghai. Previously, they had held concerts in four Chinese cities including Chengdu, Nanjing, and Shenzhen.\r\n\r\niKON kicked off the concert by singing “RHYTHM TA”. Then, they performed “DUMB &amp; DUMBER” and “SINO SIJAK” – their hit songs with powerful beats. Afterwards, iKON put on cute performances for “MY TYPE” and “TODAY”.\r\n\r\nIn addition, iKON captured the hearts of the audience by singing a variety of their hit songs such as “APOLOGY”, “AIRPLANE”, “WAIT FOR ME”, and “M.U.P”. They heated up the atmosphere by showing off their cute appeal in between their charismatic performances. iKON also did a cover of BIGBANG’s “BANG BANG BANG”, and B.I, BOBBY, and KIM JIN HWAN each did a solo performance.\r\n\r\nWhenever iKON released a song, it swept QQ Music’s charts, demonstrating iKON’s huge popularity in China.\r\n\r\nLast year, iKON won the Best Group Award at the Netease Attitude Awards held by Wangyi.com, one of China’s top four portal sites. In the beginning of this year, iKON also won awards for Best New Force and Best Album of the Year (chosen by the media) thanks to their huge popularity in China.\r\n\r\nAlthough their tour in China has ended, iKON is likely to visit China often to meet with their fans. iKON will continue with their Asia tour and perform at Bangkok’s Impact Arena Exhibition Hall 3&amp;4 on July 16 and at the Singapore Indoor Stadium on July 24.","post_date":"2016-06-12","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/iKON-concert.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/iKON-concert.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/iKON-concert.jpg","excerpt":"iKON’s China Tour Reached the Grand Finale in the Run Up to their Concerts in Bangkok and Singapore in July","url_friendly_name":"ikons-china-tour-reached-the-grand-finale-in-the-run-up-to-their-concerts-in-bangkok-and-singapore-in-july","artist_id":241,"related_event":[]},"2013":{"id":2013,"post_title":"[M+Music Chart] AKMU is sweeping No.1 on music charts… Succeeded in ranking all the songs in the album in top places on charts","post_content":"[MBN스타=유지훈 기자] Group AKMU has boasted their big influence on charts once again.\r\nOn May 4 (at 8am), “RE-BYE” which is the title track of AKMU’s new album “SPRING Vol.1” is staying in No.1 place on eight charts including Melon, Olleh Music, NAVER, Genie, Soribada, Monkey 3, and Mnet.\r\nOther than the title song, “Haughty Girl”, “Green Window”, “Every Little Thing”, and “Around” are also recording remarkable success, sweeping top places on music charts.\r\n“SPRING Vol.1” is AKMU’s new album released two years after their debut album “PLAY”. The new album’s title track “RE-BYE” is a song that expresses a heart that does not want to be hurt by repeated small and big partings in everyday life.","post_date":"2016-05-04","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/500000040000_99_20160504092204.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/500000040000_99_20160504092204.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/500000040000_99_20160504092204.jpg","excerpt":"[M+Music Chart] AKMU is sweeping No.1 on music charts… Succeeded in ranking all the songs in the album in top places on charts”","url_friendly_name":"mmusic-chart-akmu-is-sweeping-no-1-on-music-charts-succeeded-in-ranking-all-the-songs-in-the-album-in-top-places-on-charts","artist_id":240,"related_event":[]},"2015":{"id":2015,"post_title":"AKMU appeals overseas, too… In top 10 on iTunes charts of 10 countries","post_content":"[OSEN=선미경 기자] Brother and sister duo AKMU has entered top 10 on iTunes albums charts of 10 countries, while sweeping top places on music charts in Korea.\r\nAKMU released new album “SPRING Vol.1” on May 4 at 0 o’clock. The album’s title track “RE-BYE” is recording No.1 on the real-time chart of eight major music-streaming websites in Korea. Plus, all the songs in the new album are ranked in top places on charts, to prove AKMU’s enormous potential.\r\nAKMU is creating sensation overseas as well. The new album is taking No.1 place on the iTunes albums chart of Hong Kong and Thailand as of May 4 at 7am. It is also recording second rank on the iTunes chart of Taiwan; fourth in Singapore; fifth in Malaysia; fifth in Indonesia and the Philippines; seventh in Finland; eighth in Slovakia; and 10th in Norway. The album is staying in top 10 on the iTunes chart of total 10 countries now. It is also ranked in the 73rd place on the iTunes chart of the United States. \r\nAKMU picked an adolescence of thoughts that could come to anyone as the theme for their comeback, to complete a very original and unique album. Music fans say that the new album well-reveals AKMU’s flagship wit and appeal.","post_date":"2016-05-04","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/a8f538a372044cc81a2a958e15e6cb51.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/a8f538a372044cc81a2a958e15e6cb51.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/a8f538a372044cc81a2a958e15e6cb51.jpg","excerpt":"AKMU appeals overseas, too… In top 10 on iTunes charts of 10 countries","url_friendly_name":"akmu-appeals-overseas-too-in-top-10-on-itunes-charts-of-10-countries","artist_id":240,"related_event":[]},"2017":{"id":2017,"post_title":"[Exclusive] iKON is coming, now shooting MV for a new song… “Comeback soon”","post_content":"[OSEN=선미경 기자] Boy group iKON has kicked off shooting for the music video of their new song.\r\niKON is currently shooting the music video of their new song. News about iKON’s music video shooting is announced on social media channels, drawing big attention for iKON’s comeback already. Even though the timeline for iKON’s comeback has not been confirmed yet, it seems iKON will release a new album soon, since they have already begun to work on new songs.\r\nRegarding iKON’s comeback, YG Entertainment’s insider confirmed to OSEN that “iKON is now shooting a music video”. The insider gave “no comment” on the timeline for iKON’s comeback, but said, “You can hear good news soon”. iKON has been thought to be the next YG artist to comeback following AKMU who is coming back on May 2.\r\nAs the news about iKON’s comeback has been confirmed, the lineup of YG’s artists to come back in the first half of this year has been completed. YG Entertainment has recently given big pleasure to music fans with comeback of LEE HI and AKMU, and will continue to do so with iKON’s comeback soon.\r\niKON is a rookie boy group with formidable potential. The team swept rookie of the year awards at the end-of-year music awards last year, after making debut in October. iKON held a concert that filled up the Olympic Gymnastics Arena in Seoul, which is one of the largest concert halls in Korea, within four months after their debut, and then held their first Asian tour within six months from their debut, evolving into the next-generation trend of the global music scene.\r\nBeginning from “MY TYPE”, iKON created sensation with “RHYTHM TA”, and “APOLOGY”. Now, music fans are paying keen attention to iKON once again, expressing big interest in with what kind of new music they will fascinate fans again.","post_date":"2016-05-02","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201605021154778868_5726c1aac8bf7_99_20160502115705.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201605021154778868_5726c1aac8bf7_99_20160502115705.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201605021154778868_5726c1aac8bf7_99_20160502115705.jpg","excerpt":"[Exclusive] iKON is coming, now shooting MV for a new song… “Comeback soon”","url_friendly_name":"exclusive-ikon-is-coming-now-shooting-mv-for-a-new-song-comeback-soon","artist_id":241,"related_event":[]},"2019":{"id":2019,"post_title":"LEE HI Became the First One to be Interviewed by Fuse during their Teen Takeover Week","post_content":"[엑스포츠뉴스=최진실 기자] LEE HI was the first “19 Under 19 honorees” to be interviewed by Fuse during their Teen Takeover Week.\r\n\r\nRecently, Fuse published their interview with LEE HI, in which she talked candidly about her life as a teenage artist and the behind story of her debut.\r\n\r\nEarlier on, LEE HI became the only Korean to make it on Fuse’s Top 19 Biggest Teen Musicians of 2016.\r\n\r\nIn her interview with Fuse, LEE HI said, “There are a lot of advantages being a teen musician. Being young means that I have the opportunity to try out different genres of music and styles in the future.”\r\n\r\nWhen asked if it was hard making her artist decisions heard as a teenage artist, LEE HI answered, “When I debuted at 16, there were, of course, difficulties because of my young age. Since I was so young, it was hard to express my opinion, as was working with staff members much older than me. But nowadays, I don’t have the same hardships. If I don’t speak up and express my opinion, I know that we will not be able to come up with an outstanding performance. That’s why I tend to stay balanced with much larger sense of responsibility, trying to strongly state my opinion. Everyone, regardless of age, has gathered to make outstanding pieces of work, and so I try to actively express my view or ideas in relations to stage setting, song selection and the overall album work procedure.”\r\n\r\nTo round off the interview, she said, “To those who are having trouble finding their dreams and paths to achieve their dreams, I want to tell them to enjoy the process a little more and challenge diverse things…If you courageously challenge yourself, you will become a greater person in the future. Teens can do anything, and this is what makes this age so awesome! Good luck!”\r\n\r\nEarlier on, LEE HI LEE HI released her SEOULITE album at 12 AM on April 20, and the title track of the album—“MY STAR”—topped the realtime charts of seven major music streaming websites and six daily charts upon release. “MY STAR” also took China by storm and ranked no.1 on the new songs chart of QQ Music, China’s biggest music streaming service provider.\r\n\r\n“MY STAR” is composed by YG’s main producers and hit song makers, TEDDY and KUSH. It is a retrosoul song, the genre that suits LEE HI G the most. As with her debut song “1,2,3,4”, “MY STAR” is full of groove and easy to dance to.\r\n\r\nLEE HI will appear on SBS’s Inkigayo on May 1 to meet with her fans.","post_date":"2016-05-01","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/1462068324310_99_20160501110604.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/1462068324310_99_20160501110604.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/1462068324310_99_20160501110604.jpg","excerpt":"LEE HI Became the First One to be Interviewed by Fuse during their Teen Takeover Week","url_friendly_name":"lee-hi-became-the-first-one-to-be-interviewed-by-fuse-during-their-teen-takeover-week","artist_id":239,"related_event":[]},"2022":{"id":2022,"post_title":"EPIK HIGH Sang 18 Songs and Put on a Powerful Stage on their Third Japan Tour","post_content":"&nbsp;\r\n\r\n\r\n\r\n[스포츠조선=이유나 기자] EPIK HIGH kicked off their third Japan tour successfully.\r\n\r\nOn April 29, EPIK HIGH started their third Japan tour titled “EPIK HIGH JAPAN TOUR 2016” at Zepp Nagoya, Aichi, Japan and put on a powerful stage.\r\n\r\nEPIK HIGH sang 18 of their hit songs including “FLY (ft. AMIN. J from SOULCIETY)”, “LOVE LOVE LOVE (ft. YOONGJIN from CASKER)”, and “FAN”. They also sang “DON’T HATE ME” in Japanese and sent the audience into a near frenzy.\r\n\r\nSince they have been a group for a long time, EPIK HIGH members had a great chemistry on stage. They freely roamed about the stage sprinkling water and went down to the audience seats to sing in front of them.\r\n\r\nWith their concert in Aichi as a start, EPIK HIGH will continue with their tour by holding concerts in Kanagawa on May 1, in Fukuoka on May 3, in Tokyo on May 5, in Osaka on May 9-10, and in Okinawa on May 29.\r\n\r\nOn the upcoming June 8, EPIK HIGH’ repackaged best album titled “THE BEST OF EPIK HIGH ～SHOW MUST GO ON &amp; ON～” will be released in Japan.\r\n\r\nOn their previous tours, EPIK HIGH held concerts in the three cities of Tokyo, Osaka, and Nagoya in 2014 and in eight cities including Kanagawa, Shizuoka, and Kyoto last year.","post_date":"2016-04-30","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/2016043001002516000181242_99_20160430091002.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/2016043001002516000181242_99_20160430091002.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/2016043001002516000181242_99_20160430091002.jpg","excerpt":"EPIK HIGH Sang 18 Songs and Put on a Powerful Stage on their Third Japan Tour","url_friendly_name":"epik-high-sang-18-songs-and-put-on-a-powerful-stage-on-their-third-japan-tour","artist_id":242,"related_event":[]},"2025":{"id":2025,"post_title":"LEE HI Chosen as Fuse TV’s Top 19 Biggest Teen Musicians of 2016","post_content":"[TV리포트=김가영 기자] LEE HI demonstrated her global influence by making it on the Fuse TV’s list of Top 19 Biggest Teen Musicians of 2016.\r\n\r\nFuse TV praised LEE HI and said, “Despite a three-year hiatus between albums, the smoky-voiced star reminded everyone why they fell in love with her on the debut season of K-Pop Star in 2012.”\r\n\r\nThey went on to say, “Lee Hi’s voice has something that transcends language and age.”\r\n\r\nLEE HI was the only Korean to be chosen as one of Fuse TV’s Top 19 Biggest Teen Musicians of 2016. Jaden Smith, Will Smith’s son and an all round entertainer, US female pop band Fifth Harmony and Japan’s female trio Babymetal were also on the list.\r\n\r\nLEE HI released her SEOULITE album at 12 AM on April 20, and the title track of the album—“MY STAR”—topped the realtime charts of seven major music streaming websites and six daily charts upon release. “MY STAR” also took China by storm and ranked no.1 on the new songs charts of QQ Music, China’s biggest music streaming service provider.","post_date":"2016-04-29","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/1eabc3d4fb80fc25f0953e19e6cde468.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/1eabc3d4fb80fc25f0953e19e6cde468.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/1eabc3d4fb80fc25f0953e19e6cde468.jpg","excerpt":"LEE HI Chosen as Fuse TV’s Top 19 Biggest Teen Musicians of 2016","url_friendly_name":"lee-hi-chosen-as-fuse-tvs-top-19-biggest-teen-musicians-of-2016","artist_id":239,"related_event":[]},"2027":{"id":2027,"post_title":"iKON confirmed on additional concerts in six more cities including Bangkok for their “Asian tour” [Official Announcement]","post_content":"[동아닷컴=홍세영 기자]iKON confirmed on additional concerts in six cities in Asia for their Asian tour “iKON-iKONCERT 2016 ‘SHOWTIME TOUR’ IN ASIA”, proving their big popularity in Asian countries.\r\n\r\nYG Entertainment announced the news by unveiling iKON’s tour poster on April 29 at 1pm on the company’s official social media channel. According to the poster, iKON will hold additional concerts in six Asian cities: Shenzhen and Shanghai in China, Bangkok in Thailand, Singapore, Kuala Lumpur in Malaysia, and Jakarta in Indonesia.\r\n\r\nA concert will be held on June 3 at “SHENZHEN BAY SPORTS CENTER GYMNASIUM”, on June 11 at Shanghai “GRAND STAGE”, on July 16 at Bangkok “IMPACT EXHIBITION HALL 3&amp;4”, on July 24 at Singapore “SINGAPORE INDOOR STADIUM”, on August 13 at Kuala Lumpur “STADIUM NEGARA”, and on September 3 at Jakarta “ICE BSD CITY HALL 5”.\r\n\r\niKON has already proven their big popularity overseas by successfully rounding off their first Japan arena tour “iKONCERT 2016 SHOWTIME TOUR IN JAPAN” that attracted 146,000 fans to 14 concerts in five cities in Japan in March this year. The news of large-scale Asian tour “iKON iKONCERT 2016 ‘SHOWTIME TOUR’ IN ASIA” drew keen attention from fans throughout Asia.\r\n\r\niKON kicked off the Asian tour on April 22 at Taipei Arena in Taiwan. From even before the beginning of the concert, local media flocked to the concert to report about iKON, demonstrating iKON’s big popularity in the country. iKON’s flagship passionate and perfect performances fascinated local fans.\r\n\r\niKON successfully launched their Asian tour with a concert in Taiwan. Now, iKON will continue with the tour to hold a concert in Hong Kong on May 7, in Chengdu and Nanjing in China on May 14 and 21, respectively.","post_date":"2016-04-29","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/47bc11ac770f72ae28db33adf08744aa.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/47bc11ac770f72ae28db33adf08744aa.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/47bc11ac770f72ae28db33adf08744aa.jpg","excerpt":"iKON confirmed on additional concerts in six more cities including Bangkok for their “Asian tour” [Official Announcement]","url_friendly_name":"ikon-confirmed-on-additional-concerts-in-six-more-cities-including-bangkok-for-their-asian-tour-official-announcement","artist_id":241,"related_event":[]},"2029":{"id":2029,"post_title":"[Issue is] AKMU’s LEE CHAN HYUK wrote all the songs in new album… “Will release two albums before joining the army”","post_content":"[일간스포츠=엄동진 기자]AKMU is filling their new album with songs they wrote by themselves once again.\r\n\r\nAKMU who is called “the monster on music charts” is coming back with double title tracks of their new album which is filled with songs all written by member LEE CHAN HYUK. “RE-BYE” and “How People Move” are the title tracks and they are arousing people’s curiosity already. The album also includes other songs: “Haughty Girl”, “Green Window”, “Every Little Thing”, and “Around”.\r\n\r\nOn April 29 at 10am, YG unveiled the track list of AKMU’s new album “SPRING” on the company’s official blog. The AKMU brother and sister are making a big smile in the poster of the track list, raising music fans’ anticipation for AKMU’s new album.\r\n\r\nReleasing new albums with double title tracks is YG’s flagship strategy. AKMU’s big influence on music charts has already been proven. Now, music fans are paying keen attention to whether AKMU will create sensation again with the double title tracks of their new album. Plus, older brother LEE CHAN HYUK wants to serve his mandatory military service next year. AKMU will release new albums twice in this spring and fall, before he goes to join the army.\r\n\r\nAKMU’s new album is known to be talking about the “adolescence of thoughts” that could come to anyone at any age, rather than about the adolescence for teenagers.\r\n\r\nAKMU’s new album “SPRING Vol.1” that talks about the “adolescence of thoughts” for anyone will be released on-line on May 4 at 0 o’clock and off-line on May 9.","post_date":"2016-04-29","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/500000040000_99_20160504092204.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/500000040000_99_20160504092204.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/500000040000_99_20160504092204.jpg","excerpt":"[Issue is] AKMU’s LEE CHAN HYUK wrote all the songs in new album… “Will release two albums before joining the army”","url_friendly_name":"issue-is-akmus-lee-chan-hyuk-wrote-all-the-songs-in-new-album-will-release-two-albums-before-joining-the-army","artist_id":240,"related_event":[]},"2031":{"id":2031,"post_title":"AKMU confirmed double title tracks for new album… To be released on May 4 at 0 o’clock","post_content":"[동아닷컴=장경국 기자] The title tracks of AKMU’s new album have confirmed to be “RE-BYE” and “HOW PEOPLE MOVE”.\r\nOn April 28 at 2 o’clock in the afternoon, YG Entertainment unveiled a poster titled “AKMU ‘SPRING Vol.1 (思春記上)’ NEW ALBUM RELEASE” on the company’s official blog (www.yg-life.com), to announce the news. \r\nThe poster shows the AKMU brother and sister who are wearing refreshing smile. “RE-BYE” and “HOW PEOPLE MOVE”, the double title tracks of the new album “SPRING Vol.1 (思春記上)” are written on the top of the poster, to draw big attention. \r\nAKMU already drew big attention before, when they unveiled a teaser poster for their new album and an art film that displayed the new album’s concept, on the 25 and 27 this month. While the new poster with the title tracks of the new album is raising people’s curiosity once again, music fans are expressing anticipation on what kind of songs will fill the new album of AKMU.\r\nIn the meantime, AKMU’s new album “SPRING Vol.1 (思春記上)” talks more about the “adolescence of thoughts” that could come to anyone at any age, rather than about the adolescence for teenagers. The album will be released on-line on May 4 at 0 o’clock and off-line on May 9. ","post_date":"2016-04-28","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/a8f538a372044cc81a2a958e15e6cb51.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/a8f538a372044cc81a2a958e15e6cb51.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/a8f538a372044cc81a2a958e15e6cb51.jpg","excerpt":"AKMU confirmed double title tracks for new album… To be released on May 4 at 0 o’clock","url_friendly_name":"akmu-confirmed-double-title-tracks-for-new-album-to-be-released-on-may-4-at-0-oclock","artist_id":240,"related_event":[]},"2032":{"id":2032,"post_title":"[Music Talk Talk] LEE HI fascinated China. Will she have to eventually debut in China?","post_content":"[OSEN=박소영 기자] China is eyeing on LEE HI. She has yet to debut officially in China, but already great attention is being paid to her. China’s music charts are already responding. YG Entertainment’s soul princess, LEE HI, has captivated Chinese fans.\r\nOn 25 April, according to China’s largest music streaming website QQ Music chart, “MY STAR”, which is the title song of LEE HI’s full album “SEOULITE”, topped its new songs chart.\r\nAlong with this, “HOLD MY HAND”, her double title track in the half album released last month, topped QQ Music’s K-pop weekly chart. The song continued to take over the chart even though a month has passed since its release.\r\n“MY STAR” is a retro-soul song, written and composed by YG’s main producers Teddy and Kush. Fans in Korea and abroad love this song as the song highlights LEE HI’s unique soulful voice and groove.\r\nTogether with the song, “MY STAR” music video is also being loved by many Chinese fans, taking the second place on the K-pop music video chart. Both her music video and song are captivating Chinese fans.\r\nIndeed, China had been paying much attention to LEE HI, even before her debut in Korea. When she was being featured in SBS ‘K-pop Star Season 1’, Chinese netizens cheered for her and supported her.\r\nThis was largely thanks to her soulful voice that is not very common in the Chinese pop music scene. Her unique voice full of emotions, her groovy addictive music and her cute stage manners were enough to fascinate Chinese fans.\r\nIf this trend continues, LEE HI may have to debut in China. Just in four years after her debut in Korea, both Korean and Chinese fans are having their eye on LEE HI. Her music is having China dancing.","post_date":"2016-04-26","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201604261437777384_571eff2f7804f_99_20160426144304.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201604261437777384_571eff2f7804f_99_20160426144304.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201604261437777384_571eff2f7804f_99_20160426144304.jpg","excerpt":"[Music Talk Talk] LEE HI fascinated China. Will she have to eventually debut in China?","url_friendly_name":"music-talk-talk-lee-hi-fascinated-china-will-she-have-to-eventually-debut-in-china","artist_id":239,"related_event":[]},"2034":{"id":2034,"post_title":"[Music Talk Talk] BIGBANG at top for “10 years”, irreplaceable & undeniable","post_content":"[OSEN=정소영 기자] It has been already 10 years. BIGBANG who celebrates the 10th anniversary of their debut this year is still at the top and numerous rivals have come and gone so far. Such trend is not confined to Korea, but is spreading overseas.\r\n\r\n\r\n\r\nBIGBANG decided to add one more concert to their two-day concert at Osaka Yamma Stadium Nagai on July 30 and 31 which will be held in celebration of BIGBANG’s 10th anniversary. The number of audience was expected at 110,000, but fans’ big interest in the concert made the number increase to 165,000. That is a truly impressive scale.\r\n\r\nBIGBANG successfully rounded off world tour that drew total 911,000 fans in Japan from November last year to February this year. BIGBANG is the first foreign artist in Japan who has held tour in the country for three years in a row. That proves the unrivaled popularity BIG is enjoying in Japan.\r\n\r\nThat was not the end. BIGBANG’s stadium concert scheduled for this July is creating sensation again, proving BIGBANG’s nickname “GOD-bang”.\r\n\r\nPlus, BIGBANG kicked off fan club event tour in Japan two years after the last fan meeting tour and has been carrying out arena tour with 27 concerts in four cities: including one at Kobe World Memorial Hall from April 22 to 24 and another one at the same place from May 27 to 29.\r\n\r\nOther than performances as complete team BIGBANG, each member of the team has also established their own artistic presence in a variety of fields. It is true that Korean fans are rather dissatisfied with the fact that they can hardly see team BIGBANG in Korea because of their hectic overseas schedule. However, that is kind of unavoidable fate for fans of such global star.\r\n\r\nBIGBANG is enjoying such unending popularity for as long as ten years. There seems to be nobody who could ever replace BIGBANG’s “unprecented” success.\r\n\r\n\r\n","post_date":"2016-04-25","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201604251510779368_571db5709b5cc_99_20160425151704.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201604251510779368_571db5709b5cc_99_20160425151704.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201604251510779368_571db5709b5cc_99_20160425151704.jpg","excerpt":"[Music Talk Talk] BIGBANG at top for “10 years”, irreplaceable & undeniable","url_friendly_name":"music-talk-talk-bigbang-at-top-for-10-years-irreplaceable-undeniable","artist_id":454,"related_event":[]},"2036":{"id":2036,"post_title":"[Look @ Japan] “160,000 for 3 days”… What is the power of BIGBANG sweeping Japan?","post_content":"[TV리포트=이지호 객원기자] What would be the limit of BIGBANG’s draw of audience?\r\nBIGBANG has decided to add one more concert to their tour. BIGBANG is to hold stadium live concert on July 30 and 31 at Osaka Yanma Stadium in Osaka, Japan, in celebration of the 10th anniversary of the team’s debut. The predicted number of audience was 110,000. However, more than 450,000 tickets were applied for, so BIGBANG decided to hold one more concert on July 29. Therefore, the concert will draw total 165,000 fans for three days. \r\nBIGBANG successfully rounded off Japan dome tour from November last year to February this year, drawing 911,000 fans in Japan. That was an unprecedented record for a foreign singer, which was fifth highest number of audience for concerts ever held in Japan.\r\nIt has been barely half a year after the end of such large-scale tour concert, but BIGBANG is holding another large-scale concert that will draw 160,000 people. That is not all. Starting from this month, BIGBANG will have total 27 fan club events in their tour in four cities. With such hectic schedule, BIGBANG is now approaching toward the climax of their tour in Japan, the concert at stadium. Then, how come are that many people flocking to BIGBANG’s concert?\r\nBIGBANG’s biggest strength picked by Japanese fans at BIGBANG concert is the fact that “BIGBANG’s songs are really good”. When compared with other idol singers, BIGBANG’s songs and performances are outstanding, even if other idol singers also have many strengths.\r\nJapanese fans also think highly of BIGBANG’s originality and creativity. BIGBANG has a clearly distinctive character different from other idol groups and singers, which is sophisticated and cool. Not only BIGBANG’s music but also their fashion and performances on the stage are on the vanguard of latest trend.\r\nActually, BIGBANG is thought to be the “star of the stars” in Japan. Many Japanese celebrities come to watch BIGBANG concerts: Japan’s top models and actresses including Mizuhara Kiko, Komatsu Nana, and Takei Emi have proclaimed to be BIGBANG’s fans. Those Japanese stars post photos on their social media accounts after visiting BIGBANG concert, and that becomes part of motivation for young people in Japan to visit BIGBANG’s concert.\r\nConcert itself is acclaimed by Japanese fans as well. Fans who have watched BIGBANG concert once comes to see BIGBANG again and again every year. A Japanese fan said after watching BIGBANG concert, “I was really pleased, maybe because BIGBANG sang a lot of exciting songs. I jumped a lot, so I’m exhausted now. I want to visit BIGBANG concert again”.\r\nPerformances at the concert are of course good and another strength of BIGBANG concert is the team’s sincere fan service, according to Japanese fans. Japanese Nikkan Sports praised BIGBANG’s concert held in February by saying, “Disciplined dance, powerful singing, as well as charming remarks in not-that-good Japanese are the great draw of BIGBANG concert. They never stop trying to entertain Japanese fans”.\r\nThe harmony between outstanding talent, good look and personality, and hard-work of BIGBANG has enabled the team to enjoy ever-rising popularity for the 10 years since their debut.\r\nThis year is the last year for BIGBANG to perform in a complete team before the members go to serve their mandatory military service. Even if the five members join the army on the same day, for two years at least, fans will not be able to see them on the stage. That is another reason why more Japanese fans are flocking to BIGBANG concert in order to see complete team BIGBANG one more time.","post_date":"2016-04-25","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/20160307_1457276634_84761900_1_99_20160425134505.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/20160307_1457276634_84761900_1_99_20160425134505.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/20160307_1457276634_84761900_1_99_20160425134505.jpg","excerpt":"[Look @ Japan] “160,000 for 3 days”… What is the power of BIGBANG sweeping Japan?","url_friendly_name":"look-japan-160000-for-3-days-what-is-the-power-of-bigbang-sweeping-japan","artist_id":454,"related_event":[]},"2038":{"id":2038,"post_title":"AKMU confirmed on their comeback on May 4… Title of the album is “SPRING”","post_content":"\r\n\r\n[OSEN=정소영 기자] AKDONG MUSICIAN (AKMU) is coming back after one year and six months of absence from the music scene. The date of the team’s comeback has been confirmed to be May 4.\r\nOn April 25 at 10am, YG Entertainment unveiled teaser poster or AKMU’s new album on the company’s official blog. The title of the poster is “AKMU – ‘SPRING Vol.1 (思春記上)’ NEW ALBUM RELEASE’”. \r\nThe retro-style poster with a feel of innocence shows LEE CHANHYUK and LEE SUHYUN wearing school uniforms. Another poster released with the teaser poster also catches eyes, showing the AKMU brother and sister reading books.\r\nAlong with the title of the new album “AKMU SPRING” and “SPRING Vol.1 (思春記上)”, the date of comeback “May 4” is stated on the poster, raising fans’ anticipation for AKMU’s comeback. Notably, May 4 is LEE SUHYUN’s birthday, so the team’s comeback will be all the more meaningful. After the release of songs in the album on music-streaming websites on May 4, the album will be released off-line on the 9. \r\n\r\nAKMU’s new album “SPRING” is an album like a complete collection of works created based on the objet of “books”. The works talk about interest in the world, excitement about dream and love, and concerns about ego. Rather than the adolescence of teenagers, the album is talking more about the “adolescence of thoughts” that comes to anyone at any age. \r\nIn their first album, AKMU who were children living in the forest took their first step into the world by “PLAY”ing with music. New album “SPRING” is the place where stories of those children begin in earnest in their everyday lives.\r\nAKMU released their first full-length album “PLAY” in April 2014, to enjoy big popularity with songs of witty lyrics and innocent feel, including “200%” and “Give Love”. Therefore, the new album to be newly released is already drawing big attention.","post_date":"2016-04-25","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201604251009774498_571d6ef991e2b_99_20160425101304.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201604251009774498_571d6ef991e2b_99_20160425101304.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/201604251009774498_571d6ef991e2b_99_20160425101304.jpg","excerpt":"AKMU confirmed on their comeback on May 4… Title of the album is “SPRING”","url_friendly_name":"akmu-confirmed-on-their-comeback-on-may-4-title-of-the-album-is-spring","artist_id":240,"related_event":[]},"2043":{"id":2043,"post_title":"TAEYANG Sang His First Duet with a Female Singer on Fantastic Duo, and the Performance Won the Highest Score","post_content":"\r\n\r\n[엑스포츠뉴스=나금주 기자] TAEYANG sang his very first duet with a female singer on SBS’s Fantastic Duo, and it was perfect.\r\n\r\nOn April 24, the second episode of SBS’s Fantastic Duo was aired. The episode featured Lee Sun-hee, Im Chang-jung, Kim Bum-soo, and TAEYANG competing to become the “fantastic duo”.\r\n\r\nThe second team to go on stage was TAEYANG and Lee Seo-jin, a.k.a. “Master of Rhythm From Daejeon”. Before their performance, TAEYANG commented, “I’ve never sang a duet song with a female singer throughout my whole career. I think I would be able to learn a lot from today’s performance. It will be a very meaningful.”\r\n\r\nThen, TAEYANG and his partner sang TAEYANG’s “EYES, NOSE, LIPS” as if they are lovers madly in love but not together anymore. They sang in heart-melting voices looking into each other’s eyes all throughout the performance. They truly owned the stage. Even before the song ended, huge cheers came from the audience.\r\n\r\nAfter their performance, Jeon Hyun-moo said, “When TAEYANG walked to his partner while singing, I’m a man but even I thought he looked so sexy.” Jang Yun-jung commented, “They sounded as if they became one.”\r\n\r\nTAEYANG thanked his partner, “I was nervous watching other performances, but I was relieved after seeing my partner sing. I relied on her a lot actually.”\r\n\r\nThey received the highest score of 289 points and became no.1 winning against Im Chang-jung.","post_date":"2016-04-24","main_image":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/1461488739732_99_20160424180803.jpg","thumb_1x1":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/1461488739732_99_20160424180803.jpg","thumb_3x2":"http:\/\/yg.testroo.com\/wp-content\/uploads\/2016\/09\/1461488739732_99_20160424180803.jpg","excerpt":"TAEYANG Sang His First Duet with a Female Singer on Fantastic Duo, and the Performance Won the Highest Score","url_friendly_name":"taeyang-sang-his-first-duet-with-a-female-singer-on-fantastic-duo-and-the-performance-won-the-highest-score","artist_id":454,"related_event":[]}},"event_order":[1698,1703,1705,1721,1725,1760,1738,1736,1730,1605,1578,1577,1575,1378,1370,1369,1367,1364,1153,1151,1138,1123,1140,1143,1141,962,961,1147,1590,1280,1622,1620,754,1338,1626,1624,1263,1268,1362,1600,1596,1594,1254,1592,1149,1591,1361,1359,1358,1262,1260,1258,1256,1437,1849,1842,1851,1892,1856,1862,1917,1955,1968,1449,1451,1618,2013,2015,2017,2019,2022,2025,2027,2029,2031,2032,2034,2036,2038,2043]}